/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
  storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
  #[inline]
  pub const fn new(storage: Storage) -> Self {
    Self { storage }
  }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
  Storage: AsRef<[u8]> + AsMut<[u8]>,
{
  #[inline]
  fn extract_bit(byte: u8, index: usize) -> bool {
    let bit_index = if cfg!(target_endian = "big") {
      7 - (index % 8)
    } else {
      index % 8
    };
    let mask = 1 << bit_index;
    byte & mask == mask
  }
  #[inline]
  pub fn get_bit(&self, index: usize) -> bool {
    debug_assert!(index / 8 < self.storage.as_ref().len());
    let byte_index = index / 8;
    let byte = self.storage.as_ref()[byte_index];
    Self::extract_bit(byte, index)
  }
  #[inline]
  pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
    debug_assert!(index / 8 < core::mem::size_of::<Storage>());
    let byte_index = index / 8;
    let byte =
      unsafe { *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize) };
    Self::extract_bit(byte, index)
  }
  #[inline]
  fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
    let bit_index = if cfg!(target_endian = "big") {
      7 - (index % 8)
    } else {
      index % 8
    };
    let mask = 1 << bit_index;
    if val {
      byte | mask
    } else {

pub const STREAM_OPTIONS_MASK: u32 = 65280;
pub const STREAM_PROVIDERS_MASK: u32 = 255;
pub const STREAM_FLAGS_MASK: u32 = 65535;
pub const MPQ_OPEN_NO_LISTFILE: u32 = 65536;
pub const MPQ_OPEN_NO_ATTRIBUTES: u32 = 131072;
pub const MPQ_OPEN_NO_HEADER_SEARCH: u32 = 262144;
pub const MPQ_OPEN_FORCE_MPQ_V1: u32 = 524288;
pub const MPQ_OPEN_CHECK_SECTOR_CRC: u32 = 1048576;
pub const MPQ_OPEN_PATCH: u32 = 2097152;
pub const MPQ_OPEN_FORCE_LISTFILE: u32 = 4194304;
pub const MPQ_OPEN_READ_ONLY: u32 = 256;
pub const MPQ_CREATE_LISTFILE: u32 = 1048576;
pub const MPQ_CREATE_ATTRIBUTES: u32 = 2097152;
pub const MPQ_CREATE_SIGNATURE: u32 = 4194304;
pub const MPQ_CREATE_ARCHIVE_V1: u32 = 0;
pub const MPQ_CREATE_ARCHIVE_V2: u32 = 16777216;
pub const MPQ_CREATE_ARCHIVE_V3: u32 = 33554432;
pub const MPQ_CREATE_ARCHIVE_V4: u32 = 50331648;
pub const MPQ_CREATE_ARCHIVE_VMASK: u32 = 251658240;
pub const FLAGS_TO_FORMAT_SHIFT: u32 = 24;
pub const SFILE_VERIFY_SECTOR_CRC: u32 = 1;
pub const SFILE_VERIFY_FILE_CRC: u32 = 2;
pub const SFILE_VERIFY_FILE_MD5: u32 = 4;
pub const SFILE_VERIFY_RAW_MD5: u32 = 8;
pub const SFILE_VERIFY_ALL: u32 = 15;
pub const VERIFY_OPEN_ERROR: u32 = 1;
pub const VERIFY_READ_ERROR: u32 = 2;
pub const VERIFY_FILE_HAS_SECTOR_CRC: u32 = 4;
pub const VERIFY_FILE_SECTOR_CRC_ERROR: u32 = 8;
pub const VERIFY_FILE_HAS_CHECKSUM: u32 = 16;
pub const VERIFY_FILE_CHECKSUM_ERROR: u32 = 32;
pub const VERIFY_FILE_HAS_MD5: u32 = 64;
pub const VERIFY_FILE_MD5_ERROR: u32 = 128;
pub const VERIFY_FILE_HAS_RAW_MD5: u32 = 256;
pub const VERIFY_FILE_RAW_MD5_ERROR: u32 = 512;
pub const VERIFY_FILE_ERROR_MASK: u32 = 683;
pub const SFILE_VERIFY_MPQ_HEADER: u32 = 1;
pub const SFILE_VERIFY_HET_TABLE: u32 = 2;
pub const SFILE_VERIFY_BET_TABLE: u32 = 3;
pub const SFILE_VERIFY_HASH_TABLE: u32 = 4;
pub const SFILE_VERIFY_BLOCK_TABLE: u32 = 5;
pub const SFILE_VERIFY_HIBLOCK_TABLE: u32 = 6;
pub const SFILE_VERIFY_FILE: u32 = 7;
pub const SIGNATURE_TYPE_NONE: u32 = 0;
pub const SIGNATURE_TYPE_WEAK: u32 = 1;
pub const SIGNATURE_TYPE_STRONG: u32 = 2;
pub const ERROR_NO_SIGNATURE: u32 = 0;
pub const ERROR_VERIFY_FAILED: u32 = 1;
pub const ERROR_WEAK_SIGNATURE_OK: u32 = 2;
pub const ERROR_WEAK_SIGNATURE_ERROR: u32 = 3;
pub const ERROR_STRONG_SIGNATURE_OK: u32 = 4;
pub const ERROR_STRONG_SIGNATURE_ERROR: u32 = 5;
pub const MD5_DIGEST_SIZE: u32 = 16;
pub const SHA1_DIGEST_SIZE: u32 = 20;
pub const CCB_CHECKING_FILES: u32 = 1;
pub const CCB_CHECKING_HASH_TABLE: u32 = 2;
pub const CCB_COPYING_NON_MPQ_DATA: u32 = 3;
pub const CCB_COMPACTING_FILES: u32 = 4;
pub const CCB_CLOSING_ARCHIVE: u32 = 5;
pub const MPQ_HEADER_SIZE_V1: u32 = 32;
pub const MPQ_HEADER_SIZE_V2: u32 = 44;
pub const MPQ_HEADER_SIZE_V3: u32 = 68;
pub const MPQ_HEADER_SIZE_V4: u32 = 208;
pub const MPQ_HEADER_DWORDS: u32 = 52;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct _SETJMP_FLOAT128 {
  pub Part: [::std::os::raw::c_ulonglong; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SETJMP_FLOAT128"][::std::mem::size_of::<_SETJMP_FLOAT128>() - 16usize];
  ["Alignment of _SETJMP_FLOAT128"][::std::mem::align_of::<_SETJMP_FLOAT128>() - 16usize];
  ["Offset of field: _SETJMP_FLOAT128::Part"]
    [::std::mem::offset_of!(_SETJMP_FLOAT128, Part) - 0usize];
};
pub type SETJMP_FLOAT128 = _SETJMP_FLOAT128;
pub type TCHAR = u16;
pub type ULONG = ::std::os::raw::c_ulong;
pub type USHORT = ::std::os::raw::c_ushort;
pub type UCHAR = ::std::os::raw::c_uchar;
pub type DWORD = ::std::os::raw::c_ulong;
pub type BOOL = ::std::os::raw::c_int;
pub type BYTE = ::std::os::raw::c_uchar;
pub type WORD = ::std::os::raw::c_ushort;
pub type FLOAT = f32;
pub type PBYTE = *mut BYTE;
pub type LPBYTE = *mut BYTE;
pub type PDWORD = *mut DWORD;
pub type LPDWORD = *mut DWORD;
pub type LPVOID = *mut ::std::os::raw::c_void;
pub type LPCVOID = *const ::std::os::raw::c_void;
pub type INT = ::std::os::raw::c_int;
pub type UINT = ::std::os::raw::c_uint;
pub type INT_PTR = ::std::os::raw::c_longlong;
pub type UINT_PTR = ::std::os::raw::c_ulonglong;
pub type LONG_PTR = ::std::os::raw::c_longlong;
pub type ULONG_PTR = ::std::os::raw::c_ulonglong;
pub type SHANDLE_PTR = ::std::os::raw::c_longlong;
pub type SIZE_T = ULONG_PTR;
pub type SSIZE_T = LONG_PTR;
pub type DWORD_PTR = ULONG_PTR;
pub type DWORD64 = ::std::os::raw::c_ulonglong;
pub type KAFFINITY = ULONG_PTR;
pub type PVOID = *mut ::std::os::raw::c_void;
pub type CHAR = ::std::os::raw::c_char;
pub type SHORT = ::std::os::raw::c_short;
pub type LONG = ::std::os::raw::c_long;
pub type WCHAR = u16;
pub type LPWSTR = *mut WCHAR;
pub type PWSTR = *mut WCHAR;
pub type LPCWSTR = *const WCHAR;
pub type PCWSTR = *const WCHAR;
pub type PCZZWSTR = *const WCHAR;
pub type LPSTR = *mut CHAR;
pub type LPCSTR = *const CHAR;
pub type PCSTR = *const CHAR;
pub type PCZZSTR = *const CHAR;
pub type LPCTSTR = LPCWSTR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GROUP_AFFINITY {
  pub Mask: KAFFINITY,
  pub Group: WORD,
  pub Reserved: [WORD; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _GROUP_AFFINITY"][::std::mem::size_of::<_GROUP_AFFINITY>() - 16usize];
  ["Alignment of _GROUP_AFFINITY"][::std::mem::align_of::<_GROUP_AFFINITY>() - 8usize];
  ["Offset of field: _GROUP_AFFINITY::Mask"]
    [::std::mem::offset_of!(_GROUP_AFFINITY, Mask) - 0usize];
  ["Offset of field: _GROUP_AFFINITY::Group"]
    [::std::mem::offset_of!(_GROUP_AFFINITY, Group) - 8usize];
  ["Offset of field: _GROUP_AFFINITY::Reserved"]
    [::std::mem::offset_of!(_GROUP_AFFINITY, Reserved) - 10usize];
};
pub type GROUP_AFFINITY = _GROUP_AFFINITY;
pub type HANDLE = *mut ::std::os::raw::c_void;
pub type HRESULT = ::std::os::raw::c_long;
pub type LCID = DWORD;
pub type LONGLONG = ::std::os::raw::c_longlong;
pub type ULONGLONG = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _LARGE_INTEGER {
  pub __bindgen_anon_1: _LARGE_INTEGER__bindgen_ty_1,
  pub u: _LARGE_INTEGER__bindgen_ty_2,
  pub QuadPart: LONGLONG,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LARGE_INTEGER__bindgen_ty_1 {
  pub LowPart: DWORD,
  pub HighPart: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _LARGE_INTEGER__bindgen_ty_1"]
    [::std::mem::size_of::<_LARGE_INTEGER__bindgen_ty_1>() - 8usize];
  ["Alignment of _LARGE_INTEGER__bindgen_ty_1"]
    [::std::mem::align_of::<_LARGE_INTEGER__bindgen_ty_1>() - 4usize];
  ["Offset of field: _LARGE_INTEGER__bindgen_ty_1::LowPart"]
    [::std::mem::offset_of!(_LARGE_INTEGER__bindgen_ty_1, LowPart) - 0usize];
  ["Offset of field: _LARGE_INTEGER__bindgen_ty_1::HighPart"]
    [::std::mem::offset_of!(_LARGE_INTEGER__bindgen_ty_1, HighPart) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LARGE_INTEGER__bindgen_ty_2 {
  pub LowPart: DWORD,
  pub HighPart: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _LARGE_INTEGER__bindgen_ty_2"]
    [::std::mem::size_of::<_LARGE_INTEGER__bindgen_ty_2>() - 8usize];
  ["Alignment of _LARGE_INTEGER__bindgen_ty_2"]
    [::std::mem::align_of::<_LARGE_INTEGER__bindgen_ty_2>() - 4usize];
  ["Offset of field: _LARGE_INTEGER__bindgen_ty_2::LowPart"]
    [::std::mem::offset_of!(_LARGE_INTEGER__bindgen_ty_2, LowPart) - 0usize];
  ["Offset of field: _LARGE_INTEGER__bindgen_ty_2::HighPart"]
    [::std::mem::offset_of!(_LARGE_INTEGER__bindgen_ty_2, HighPart) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _LARGE_INTEGER"][::std::mem::size_of::<_LARGE_INTEGER>() - 8usize];
  ["Alignment of _LARGE_INTEGER"][::std::mem::align_of::<_LARGE_INTEGER>() - 8usize];
  ["Offset of field: _LARGE_INTEGER::u"][::std::mem::offset_of!(_LARGE_INTEGER, u) - 0usize];
  ["Offset of field: _LARGE_INTEGER::QuadPart"]
    [::std::mem::offset_of!(_LARGE_INTEGER, QuadPart) - 0usize];
};
pub type LARGE_INTEGER = _LARGE_INTEGER;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ULARGE_INTEGER {
  pub __bindgen_anon_1: _ULARGE_INTEGER__bindgen_ty_1,
  pub u: _ULARGE_INTEGER__bindgen_ty_2,
  pub QuadPart: ULONGLONG,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ULARGE_INTEGER__bindgen_ty_1 {
  pub LowPart: DWORD,
  pub HighPart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _ULARGE_INTEGER__bindgen_ty_1"]
    [::std::mem::size_of::<_ULARGE_INTEGER__bindgen_ty_1>() - 8usize];
  ["Alignment of _ULARGE_INTEGER__bindgen_ty_1"]
    [::std::mem::align_of::<_ULARGE_INTEGER__bindgen_ty_1>() - 4usize];
  ["Offset of field: _ULARGE_INTEGER__bindgen_ty_1::LowPart"]
    [::std::mem::offset_of!(_ULARGE_INTEGER__bindgen_ty_1, LowPart) - 0usize];
  ["Offset of field: _ULARGE_INTEGER__bindgen_ty_1::HighPart"]
    [::std::mem::offset_of!(_ULARGE_INTEGER__bindgen_ty_1, HighPart) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ULARGE_INTEGER__bindgen_ty_2 {
  pub LowPart: DWORD,
  pub HighPart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _ULARGE_INTEGER__bindgen_ty_2"]
    [::std::mem::size_of::<_ULARGE_INTEGER__bindgen_ty_2>() - 8usize];
  ["Alignment of _ULARGE_INTEGER__bindgen_ty_2"]
    [::std::mem::align_of::<_ULARGE_INTEGER__bindgen_ty_2>() - 4usize];
  ["Offset of field: _ULARGE_INTEGER__bindgen_ty_2::LowPart"]
    [::std::mem::offset_of!(_ULARGE_INTEGER__bindgen_ty_2, LowPart) - 0usize];
  ["Offset of field: _ULARGE_INTEGER__bindgen_ty_2::HighPart"]
    [::std::mem::offset_of!(_ULARGE_INTEGER__bindgen_ty_2, HighPart) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _ULARGE_INTEGER"][::std::mem::size_of::<_ULARGE_INTEGER>() - 8usize];
  ["Alignment of _ULARGE_INTEGER"][::std::mem::align_of::<_ULARGE_INTEGER>() - 8usize];
  ["Offset of field: _ULARGE_INTEGER::u"][::std::mem::offset_of!(_ULARGE_INTEGER, u) - 0usize];
  ["Offset of field: _ULARGE_INTEGER::QuadPart"]
    [::std::mem::offset_of!(_ULARGE_INTEGER, QuadPart) - 0usize];
};
pub type ULARGE_INTEGER = _ULARGE_INTEGER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LUID {
  pub LowPart: DWORD,
  pub HighPart: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _LUID"][::std::mem::size_of::<_LUID>() - 8usize];
  ["Alignment of _LUID"][::std::mem::align_of::<_LUID>() - 4usize];
  ["Offset of field: _LUID::LowPart"][::std::mem::offset_of!(_LUID, LowPart) - 0usize];
  ["Offset of field: _LUID::HighPart"][::std::mem::offset_of!(_LUID, HighPart) - 4usize];
};
pub type LUID = _LUID;
pub type DWORDLONG = ULONGLONG;
pub type BOOLEAN = BYTE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SINGLE_LIST_ENTRY {
  pub Next: *mut _SINGLE_LIST_ENTRY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SINGLE_LIST_ENTRY"][::std::mem::size_of::<_SINGLE_LIST_ENTRY>() - 8usize];
  ["Alignment of _SINGLE_LIST_ENTRY"][::std::mem::align_of::<_SINGLE_LIST_ENTRY>() - 8usize];
  ["Offset of field: _SINGLE_LIST_ENTRY::Next"]
    [::std::mem::offset_of!(_SINGLE_LIST_ENTRY, Next) - 0usize];
};
pub type SINGLE_LIST_ENTRY = _SINGLE_LIST_ENTRY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GUID {
  pub Data1: ::std::os::raw::c_ulong,
  pub Data2: ::std::os::raw::c_ushort,
  pub Data3: ::std::os::raw::c_ushort,
  pub Data4: [::std::os::raw::c_uchar; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _GUID"][::std::mem::size_of::<_GUID>() - 16usize];
  ["Alignment of _GUID"][::std::mem::align_of::<_GUID>() - 4usize];
  ["Offset of field: _GUID::Data1"][::std::mem::offset_of!(_GUID, Data1) - 0usize];
  ["Offset of field: _GUID::Data2"][::std::mem::offset_of!(_GUID, Data2) - 4usize];
  ["Offset of field: _GUID::Data3"][::std::mem::offset_of!(_GUID, Data3) - 6usize];
  ["Offset of field: _GUID::Data4"][::std::mem::offset_of!(_GUID, Data4) - 8usize];
};
pub type GUID = _GUID;
pub type LPGUID = *mut GUID;
pub type LPCGUID = *const GUID;
pub type IID = GUID;
pub type CLSID = GUID;
pub type FMTID = GUID;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_AMD64 {
  pub Count: DWORD,
  pub ScopeRecord: [_SCOPE_TABLE_AMD64__bindgen_ty_1; 1usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_AMD64__bindgen_ty_1 {
  pub BeginAddress: DWORD,
  pub EndAddress: DWORD,
  pub HandlerAddress: DWORD,
  pub JumpTarget: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SCOPE_TABLE_AMD64__bindgen_ty_1"]
    [::std::mem::size_of::<_SCOPE_TABLE_AMD64__bindgen_ty_1>() - 16usize];
  ["Alignment of _SCOPE_TABLE_AMD64__bindgen_ty_1"]
    [::std::mem::align_of::<_SCOPE_TABLE_AMD64__bindgen_ty_1>() - 4usize];
  ["Offset of field: _SCOPE_TABLE_AMD64__bindgen_ty_1::BeginAddress"]
    [::std::mem::offset_of!(_SCOPE_TABLE_AMD64__bindgen_ty_1, BeginAddress) - 0usize];
  ["Offset of field: _SCOPE_TABLE_AMD64__bindgen_ty_1::EndAddress"]
    [::std::mem::offset_of!(_SCOPE_TABLE_AMD64__bindgen_ty_1, EndAddress) - 4usize];
  ["Offset of field: _SCOPE_TABLE_AMD64__bindgen_ty_1::HandlerAddress"]
    [::std::mem::offset_of!(_SCOPE_TABLE_AMD64__bindgen_ty_1, HandlerAddress) - 8usize];
  ["Offset of field: _SCOPE_TABLE_AMD64__bindgen_ty_1::JumpTarget"]
    [::std::mem::offset_of!(_SCOPE_TABLE_AMD64__bindgen_ty_1, JumpTarget) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SCOPE_TABLE_AMD64"][::std::mem::size_of::<_SCOPE_TABLE_AMD64>() - 20usize];
  ["Alignment of _SCOPE_TABLE_AMD64"][::std::mem::align_of::<_SCOPE_TABLE_AMD64>() - 4usize];
  ["Offset of field: _SCOPE_TABLE_AMD64::Count"]
    [::std::mem::offset_of!(_SCOPE_TABLE_AMD64, Count) - 0usize];
  ["Offset of field: _SCOPE_TABLE_AMD64::ScopeRecord"]
    [::std::mem::offset_of!(_SCOPE_TABLE_AMD64, ScopeRecord) - 4usize];
};
pub type SCOPE_TABLE_AMD64 = _SCOPE_TABLE_AMD64;
pub type SCOPE_TABLE = SCOPE_TABLE_AMD64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_ARM {
  pub Count: DWORD,
  pub ScopeRecord: [_SCOPE_TABLE_ARM__bindgen_ty_1; 1usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_ARM__bindgen_ty_1 {
  pub BeginAddress: DWORD,
  pub EndAddress: DWORD,
  pub HandlerAddress: DWORD,
  pub JumpTarget: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SCOPE_TABLE_ARM__bindgen_ty_1"]
    [::std::mem::size_of::<_SCOPE_TABLE_ARM__bindgen_ty_1>() - 16usize];
  ["Alignment of _SCOPE_TABLE_ARM__bindgen_ty_1"]
    [::std::mem::align_of::<_SCOPE_TABLE_ARM__bindgen_ty_1>() - 4usize];
  ["Offset of field: _SCOPE_TABLE_ARM__bindgen_ty_1::BeginAddress"]
    [::std::mem::offset_of!(_SCOPE_TABLE_ARM__bindgen_ty_1, BeginAddress) - 0usize];
  ["Offset of field: _SCOPE_TABLE_ARM__bindgen_ty_1::EndAddress"]
    [::std::mem::offset_of!(_SCOPE_TABLE_ARM__bindgen_ty_1, EndAddress) - 4usize];
  ["Offset of field: _SCOPE_TABLE_ARM__bindgen_ty_1::HandlerAddress"]
    [::std::mem::offset_of!(_SCOPE_TABLE_ARM__bindgen_ty_1, HandlerAddress) - 8usize];
  ["Offset of field: _SCOPE_TABLE_ARM__bindgen_ty_1::JumpTarget"]
    [::std::mem::offset_of!(_SCOPE_TABLE_ARM__bindgen_ty_1, JumpTarget) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SCOPE_TABLE_ARM"][::std::mem::size_of::<_SCOPE_TABLE_ARM>() - 20usize];
  ["Alignment of _SCOPE_TABLE_ARM"][::std::mem::align_of::<_SCOPE_TABLE_ARM>() - 4usize];
  ["Offset of field: _SCOPE_TABLE_ARM::Count"]
    [::std::mem::offset_of!(_SCOPE_TABLE_ARM, Count) - 0usize];
  ["Offset of field: _SCOPE_TABLE_ARM::ScopeRecord"]
    [::std::mem::offset_of!(_SCOPE_TABLE_ARM, ScopeRecord) - 4usize];
};
pub type SCOPE_TABLE_ARM = _SCOPE_TABLE_ARM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_ARM64 {
  pub Count: DWORD,
  pub ScopeRecord: [_SCOPE_TABLE_ARM64__bindgen_ty_1; 1usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_ARM64__bindgen_ty_1 {
  pub BeginAddress: DWORD,
  pub EndAddress: DWORD,
  pub HandlerAddress: DWORD,
  pub JumpTarget: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SCOPE_TABLE_ARM64__bindgen_ty_1"]
    [::std::mem::size_of::<_SCOPE_TABLE_ARM64__bindgen_ty_1>() - 16usize];
  ["Alignment of _SCOPE_TABLE_ARM64__bindgen_ty_1"]
    [::std::mem::align_of::<_SCOPE_TABLE_ARM64__bindgen_ty_1>() - 4usize];
  ["Offset of field: _SCOPE_TABLE_ARM64__bindgen_ty_1::BeginAddress"]
    [::std::mem::offset_of!(_SCOPE_TABLE_ARM64__bindgen_ty_1, BeginAddress) - 0usize];
  ["Offset of field: _SCOPE_TABLE_ARM64__bindgen_ty_1::EndAddress"]
    [::std::mem::offset_of!(_SCOPE_TABLE_ARM64__bindgen_ty_1, EndAddress) - 4usize];
  ["Offset of field: _SCOPE_TABLE_ARM64__bindgen_ty_1::HandlerAddress"]
    [::std::mem::offset_of!(_SCOPE_TABLE_ARM64__bindgen_ty_1, HandlerAddress) - 8usize];
  ["Offset of field: _SCOPE_TABLE_ARM64__bindgen_ty_1::JumpTarget"]
    [::std::mem::offset_of!(_SCOPE_TABLE_ARM64__bindgen_ty_1, JumpTarget) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SCOPE_TABLE_ARM64"][::std::mem::size_of::<_SCOPE_TABLE_ARM64>() - 20usize];
  ["Alignment of _SCOPE_TABLE_ARM64"][::std::mem::align_of::<_SCOPE_TABLE_ARM64>() - 4usize];
  ["Offset of field: _SCOPE_TABLE_ARM64::Count"]
    [::std::mem::offset_of!(_SCOPE_TABLE_ARM64, Count) - 0usize];
  ["Offset of field: _SCOPE_TABLE_ARM64::ScopeRecord"]
    [::std::mem::offset_of!(_SCOPE_TABLE_ARM64, ScopeRecord) - 4usize];
};
pub type SCOPE_TABLE_ARM64 = _SCOPE_TABLE_ARM64;
pub type PACCESS_TOKEN = PVOID;
pub type PSECURITY_DESCRIPTOR = PVOID;
pub type PSID = PVOID;
pub type ACCESS_MASK = DWORD;
pub type PACCESS_MASK = *mut ACCESS_MASK;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GENERIC_MAPPING {
  pub GenericRead: ACCESS_MASK,
  pub GenericWrite: ACCESS_MASK,
  pub GenericExecute: ACCESS_MASK,
  pub GenericAll: ACCESS_MASK,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _GENERIC_MAPPING"][::std::mem::size_of::<_GENERIC_MAPPING>() - 16usize];
  ["Alignment of _GENERIC_MAPPING"][::std::mem::align_of::<_GENERIC_MAPPING>() - 4usize];
  ["Offset of field: _GENERIC_MAPPING::GenericRead"]
    [::std::mem::offset_of!(_GENERIC_MAPPING, GenericRead) - 0usize];
  ["Offset of field: _GENERIC_MAPPING::GenericWrite"]
    [::std::mem::offset_of!(_GENERIC_MAPPING, GenericWrite) - 4usize];
  ["Offset of field: _GENERIC_MAPPING::GenericExecute"]
    [::std::mem::offset_of!(_GENERIC_MAPPING, GenericExecute) - 8usize];
  ["Offset of field: _GENERIC_MAPPING::GenericAll"]
    [::std::mem::offset_of!(_GENERIC_MAPPING, GenericAll) - 12usize];
};
pub type GENERIC_MAPPING = _GENERIC_MAPPING;
pub type PGENERIC_MAPPING = *mut GENERIC_MAPPING;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LUID_AND_ATTRIBUTES {
  pub Luid: LUID,
  pub Attributes: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _LUID_AND_ATTRIBUTES"][::std::mem::size_of::<_LUID_AND_ATTRIBUTES>() - 12usize];
  ["Alignment of _LUID_AND_ATTRIBUTES"][::std::mem::align_of::<_LUID_AND_ATTRIBUTES>() - 4usize];
  ["Offset of field: _LUID_AND_ATTRIBUTES::Luid"]
    [::std::mem::offset_of!(_LUID_AND_ATTRIBUTES, Luid) - 0usize];
  ["Offset of field: _LUID_AND_ATTRIBUTES::Attributes"]
    [::std::mem::offset_of!(_LUID_AND_ATTRIBUTES, Attributes) - 8usize];
};
pub type LUID_AND_ATTRIBUTES = _LUID_AND_ATTRIBUTES;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SID_IDENTIFIER_AUTHORITY {
  pub Value: [BYTE; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SID_IDENTIFIER_AUTHORITY"]
    [::std::mem::size_of::<_SID_IDENTIFIER_AUTHORITY>() - 6usize];
  ["Alignment of _SID_IDENTIFIER_AUTHORITY"]
    [::std::mem::align_of::<_SID_IDENTIFIER_AUTHORITY>() - 1usize];
  ["Offset of field: _SID_IDENTIFIER_AUTHORITY::Value"]
    [::std::mem::offset_of!(_SID_IDENTIFIER_AUTHORITY, Value) - 0usize];
};
pub type SID_IDENTIFIER_AUTHORITY = _SID_IDENTIFIER_AUTHORITY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SID {
  pub Revision: BYTE,
  pub SubAuthorityCount: BYTE,
  pub IdentifierAuthority: SID_IDENTIFIER_AUTHORITY,
  pub SubAuthority: [DWORD; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SID"][::std::mem::size_of::<_SID>() - 12usize];
  ["Alignment of _SID"][::std::mem::align_of::<_SID>() - 4usize];
  ["Offset of field: _SID::Revision"][::std::mem::offset_of!(_SID, Revision) - 0usize];
  ["Offset of field: _SID::SubAuthorityCount"]
    [::std::mem::offset_of!(_SID, SubAuthorityCount) - 1usize];
  ["Offset of field: _SID::IdentifierAuthority"]
    [::std::mem::offset_of!(_SID, IdentifierAuthority) - 2usize];
  ["Offset of field: _SID::SubAuthority"][::std::mem::offset_of!(_SID, SubAuthority) - 8usize];
};
pub type SID = _SID;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SE_SID {
  pub Sid: SID,
  pub Buffer: [BYTE; 68usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SE_SID"][::std::mem::size_of::<_SE_SID>() - 68usize];
  ["Alignment of _SE_SID"][::std::mem::align_of::<_SE_SID>() - 4usize];
  ["Offset of field: _SE_SID::Sid"][::std::mem::offset_of!(_SE_SID, Sid) - 0usize];
  ["Offset of field: _SE_SID::Buffer"][::std::mem::offset_of!(_SE_SID, Buffer) - 0usize];
};
pub type SE_SID = _SE_SID;
pub const _SID_NAME_USE_SidTypeUser: _SID_NAME_USE = 1;
pub const _SID_NAME_USE_SidTypeGroup: _SID_NAME_USE = 2;
pub const _SID_NAME_USE_SidTypeDomain: _SID_NAME_USE = 3;
pub const _SID_NAME_USE_SidTypeAlias: _SID_NAME_USE = 4;
pub const _SID_NAME_USE_SidTypeWellKnownGroup: _SID_NAME_USE = 5;
pub const _SID_NAME_USE_SidTypeDeletedAccount: _SID_NAME_USE = 6;
pub const _SID_NAME_USE_SidTypeInvalid: _SID_NAME_USE = 7;
pub const _SID_NAME_USE_SidTypeUnknown: _SID_NAME_USE = 8;
pub const _SID_NAME_USE_SidTypeComputer: _SID_NAME_USE = 9;
pub const _SID_NAME_USE_SidTypeLabel: _SID_NAME_USE = 10;
pub const _SID_NAME_USE_SidTypeLogonSession: _SID_NAME_USE = 11;
pub type _SID_NAME_USE = ::std::os::raw::c_int;
pub use self::_SID_NAME_USE as SID_NAME_USE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SID_AND_ATTRIBUTES {
  pub Sid: PSID,
  pub Attributes: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SID_AND_ATTRIBUTES"][::std::mem::size_of::<_SID_AND_ATTRIBUTES>() - 16usize];
  ["Alignment of _SID_AND_ATTRIBUTES"][::std::mem::align_of::<_SID_AND_ATTRIBUTES>() - 8usize];
  ["Offset of field: _SID_AND_ATTRIBUTES::Sid"]
    [::std::mem::offset_of!(_SID_AND_ATTRIBUTES, Sid) - 0usize];
  ["Offset of field: _SID_AND_ATTRIBUTES::Attributes"]
    [::std::mem::offset_of!(_SID_AND_ATTRIBUTES, Attributes) - 8usize];
};
pub type SID_AND_ATTRIBUTES = _SID_AND_ATTRIBUTES;
pub type PSID_AND_ATTRIBUTES = *mut _SID_AND_ATTRIBUTES;
pub type SID_AND_ATTRIBUTES_ARRAY = [SID_AND_ATTRIBUTES; 1usize];
pub type SID_HASH_ENTRY = ULONG_PTR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SID_AND_ATTRIBUTES_HASH {
  pub SidCount: DWORD,
  pub SidAttr: PSID_AND_ATTRIBUTES,
  pub Hash: [SID_HASH_ENTRY; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SID_AND_ATTRIBUTES_HASH"]
    [::std::mem::size_of::<_SID_AND_ATTRIBUTES_HASH>() - 272usize];
  ["Alignment of _SID_AND_ATTRIBUTES_HASH"]
    [::std::mem::align_of::<_SID_AND_ATTRIBUTES_HASH>() - 8usize];
  ["Offset of field: _SID_AND_ATTRIBUTES_HASH::SidCount"]
    [::std::mem::offset_of!(_SID_AND_ATTRIBUTES_HASH, SidCount) - 0usize];
  ["Offset of field: _SID_AND_ATTRIBUTES_HASH::SidAttr"]
    [::std::mem::offset_of!(_SID_AND_ATTRIBUTES_HASH, SidAttr) - 8usize];
  ["Offset of field: _SID_AND_ATTRIBUTES_HASH::Hash"]
    [::std::mem::offset_of!(_SID_AND_ATTRIBUTES_HASH, Hash) - 16usize];
};
pub type SID_AND_ATTRIBUTES_HASH = _SID_AND_ATTRIBUTES_HASH;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACL {
  pub AclRevision: BYTE,
  pub Sbz1: BYTE,
  pub AclSize: WORD,
  pub AceCount: WORD,
  pub Sbz2: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _ACL"][::std::mem::size_of::<_ACL>() - 8usize];
  ["Alignment of _ACL"][::std::mem::align_of::<_ACL>() - 2usize];
  ["Offset of field: _ACL::AclRevision"][::std::mem::offset_of!(_ACL, AclRevision) - 0usize];
  ["Offset of field: _ACL::Sbz1"][::std::mem::offset_of!(_ACL, Sbz1) - 1usize];
  ["Offset of field: _ACL::AclSize"][::std::mem::offset_of!(_ACL, AclSize) - 2usize];
  ["Offset of field: _ACL::AceCount"][::std::mem::offset_of!(_ACL, AceCount) - 4usize];
  ["Offset of field: _ACL::Sbz2"][::std::mem::offset_of!(_ACL, Sbz2) - 6usize];
};
pub type ACL = _ACL;
pub type PACL = *mut ACL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACE_HEADER {
  pub AceType: BYTE,
  pub AceFlags: BYTE,
  pub AceSize: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _ACE_HEADER"][::std::mem::size_of::<_ACE_HEADER>() - 4usize];
  ["Alignment of _ACE_HEADER"][::std::mem::align_of::<_ACE_HEADER>() - 2usize];
  ["Offset of field: _ACE_HEADER::AceType"][::std::mem::offset_of!(_ACE_HEADER, AceType) - 0usize];
  ["Offset of field: _ACE_HEADER::AceFlags"]
    [::std::mem::offset_of!(_ACE_HEADER, AceFlags) - 1usize];
  ["Offset of field: _ACE_HEADER::AceSize"][::std::mem::offset_of!(_ACE_HEADER, AceSize) - 2usize];
};
pub type ACE_HEADER = _ACE_HEADER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_AUDIT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_AUDIT_ACE"][::std::mem::size_of::<_SYSTEM_AUDIT_ACE>() - 12usize];
  ["Alignment of _SYSTEM_AUDIT_ACE"][::std::mem::align_of::<_SYSTEM_AUDIT_ACE>() - 4usize];
  ["Offset of field: _SYSTEM_AUDIT_ACE::Header"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_ACE, Header) - 0usize];
  ["Offset of field: _SYSTEM_AUDIT_ACE::Mask"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_ACE, Mask) - 4usize];
  ["Offset of field: _SYSTEM_AUDIT_ACE::SidStart"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_ACE, SidStart) - 8usize];
};
pub type SYSTEM_AUDIT_ACE = _SYSTEM_AUDIT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ALARM_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_ALARM_ACE"][::std::mem::size_of::<_SYSTEM_ALARM_ACE>() - 12usize];
  ["Alignment of _SYSTEM_ALARM_ACE"][::std::mem::align_of::<_SYSTEM_ALARM_ACE>() - 4usize];
  ["Offset of field: _SYSTEM_ALARM_ACE::Header"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_ACE, Header) - 0usize];
  ["Offset of field: _SYSTEM_ALARM_ACE::Mask"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_ACE, Mask) - 4usize];
  ["Offset of field: _SYSTEM_ALARM_ACE::SidStart"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_ACE, SidStart) - 8usize];
};
pub type SYSTEM_ALARM_ACE = _SYSTEM_ALARM_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_RESOURCE_ATTRIBUTE_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_RESOURCE_ATTRIBUTE_ACE"]
    [::std::mem::size_of::<_SYSTEM_RESOURCE_ATTRIBUTE_ACE>() - 12usize];
  ["Alignment of _SYSTEM_RESOURCE_ATTRIBUTE_ACE"]
    [::std::mem::align_of::<_SYSTEM_RESOURCE_ATTRIBUTE_ACE>() - 4usize];
  ["Offset of field: _SYSTEM_RESOURCE_ATTRIBUTE_ACE::Header"]
    [::std::mem::offset_of!(_SYSTEM_RESOURCE_ATTRIBUTE_ACE, Header) - 0usize];
  ["Offset of field: _SYSTEM_RESOURCE_ATTRIBUTE_ACE::Mask"]
    [::std::mem::offset_of!(_SYSTEM_RESOURCE_ATTRIBUTE_ACE, Mask) - 4usize];
  ["Offset of field: _SYSTEM_RESOURCE_ATTRIBUTE_ACE::SidStart"]
    [::std::mem::offset_of!(_SYSTEM_RESOURCE_ATTRIBUTE_ACE, SidStart) - 8usize];
};
pub type SYSTEM_RESOURCE_ATTRIBUTE_ACE = _SYSTEM_RESOURCE_ATTRIBUTE_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_SCOPED_POLICY_ID_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_SCOPED_POLICY_ID_ACE"]
    [::std::mem::size_of::<_SYSTEM_SCOPED_POLICY_ID_ACE>() - 12usize];
  ["Alignment of _SYSTEM_SCOPED_POLICY_ID_ACE"]
    [::std::mem::align_of::<_SYSTEM_SCOPED_POLICY_ID_ACE>() - 4usize];
  ["Offset of field: _SYSTEM_SCOPED_POLICY_ID_ACE::Header"]
    [::std::mem::offset_of!(_SYSTEM_SCOPED_POLICY_ID_ACE, Header) - 0usize];
  ["Offset of field: _SYSTEM_SCOPED_POLICY_ID_ACE::Mask"]
    [::std::mem::offset_of!(_SYSTEM_SCOPED_POLICY_ID_ACE, Mask) - 4usize];
  ["Offset of field: _SYSTEM_SCOPED_POLICY_ID_ACE::SidStart"]
    [::std::mem::offset_of!(_SYSTEM_SCOPED_POLICY_ID_ACE, SidStart) - 8usize];
};
pub type SYSTEM_SCOPED_POLICY_ID_ACE = _SYSTEM_SCOPED_POLICY_ID_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_MANDATORY_LABEL_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_MANDATORY_LABEL_ACE"]
    [::std::mem::size_of::<_SYSTEM_MANDATORY_LABEL_ACE>() - 12usize];
  ["Alignment of _SYSTEM_MANDATORY_LABEL_ACE"]
    [::std::mem::align_of::<_SYSTEM_MANDATORY_LABEL_ACE>() - 4usize];
  ["Offset of field: _SYSTEM_MANDATORY_LABEL_ACE::Header"]
    [::std::mem::offset_of!(_SYSTEM_MANDATORY_LABEL_ACE, Header) - 0usize];
  ["Offset of field: _SYSTEM_MANDATORY_LABEL_ACE::Mask"]
    [::std::mem::offset_of!(_SYSTEM_MANDATORY_LABEL_ACE, Mask) - 4usize];
  ["Offset of field: _SYSTEM_MANDATORY_LABEL_ACE::SidStart"]
    [::std::mem::offset_of!(_SYSTEM_MANDATORY_LABEL_ACE, SidStart) - 8usize];
};
pub type SYSTEM_MANDATORY_LABEL_ACE = _SYSTEM_MANDATORY_LABEL_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_PROCESS_TRUST_LABEL_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_PROCESS_TRUST_LABEL_ACE"]
    [::std::mem::size_of::<_SYSTEM_PROCESS_TRUST_LABEL_ACE>() - 12usize];
  ["Alignment of _SYSTEM_PROCESS_TRUST_LABEL_ACE"]
    [::std::mem::align_of::<_SYSTEM_PROCESS_TRUST_LABEL_ACE>() - 4usize];
  ["Offset of field: _SYSTEM_PROCESS_TRUST_LABEL_ACE::Header"]
    [::std::mem::offset_of!(_SYSTEM_PROCESS_TRUST_LABEL_ACE, Header) - 0usize];
  ["Offset of field: _SYSTEM_PROCESS_TRUST_LABEL_ACE::Mask"]
    [::std::mem::offset_of!(_SYSTEM_PROCESS_TRUST_LABEL_ACE, Mask) - 4usize];
  ["Offset of field: _SYSTEM_PROCESS_TRUST_LABEL_ACE::SidStart"]
    [::std::mem::offset_of!(_SYSTEM_PROCESS_TRUST_LABEL_ACE, SidStart) - 8usize];
};
pub type SYSTEM_PROCESS_TRUST_LABEL_ACE = _SYSTEM_PROCESS_TRUST_LABEL_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ACCESS_FILTER_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_ACCESS_FILTER_ACE"]
    [::std::mem::size_of::<_SYSTEM_ACCESS_FILTER_ACE>() - 12usize];
  ["Alignment of _SYSTEM_ACCESS_FILTER_ACE"]
    [::std::mem::align_of::<_SYSTEM_ACCESS_FILTER_ACE>() - 4usize];
  ["Offset of field: _SYSTEM_ACCESS_FILTER_ACE::Header"]
    [::std::mem::offset_of!(_SYSTEM_ACCESS_FILTER_ACE, Header) - 0usize];
  ["Offset of field: _SYSTEM_ACCESS_FILTER_ACE::Mask"]
    [::std::mem::offset_of!(_SYSTEM_ACCESS_FILTER_ACE, Mask) - 4usize];
  ["Offset of field: _SYSTEM_ACCESS_FILTER_ACE::SidStart"]
    [::std::mem::offset_of!(_SYSTEM_ACCESS_FILTER_ACE, SidStart) - 8usize];
};
pub type SYSTEM_ACCESS_FILTER_ACE = _SYSTEM_ACCESS_FILTER_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_AUDIT_OBJECT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub Flags: DWORD,
  pub ObjectType: GUID,
  pub InheritedObjectType: GUID,
  pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_AUDIT_OBJECT_ACE"][::std::mem::size_of::<_SYSTEM_AUDIT_OBJECT_ACE>() - 48usize];
  ["Alignment of _SYSTEM_AUDIT_OBJECT_ACE"]
    [::std::mem::align_of::<_SYSTEM_AUDIT_OBJECT_ACE>() - 4usize];
  ["Offset of field: _SYSTEM_AUDIT_OBJECT_ACE::Header"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_OBJECT_ACE, Header) - 0usize];
  ["Offset of field: _SYSTEM_AUDIT_OBJECT_ACE::Mask"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_OBJECT_ACE, Mask) - 4usize];
  ["Offset of field: _SYSTEM_AUDIT_OBJECT_ACE::Flags"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_OBJECT_ACE, Flags) - 8usize];
  ["Offset of field: _SYSTEM_AUDIT_OBJECT_ACE::ObjectType"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_OBJECT_ACE, ObjectType) - 12usize];
  ["Offset of field: _SYSTEM_AUDIT_OBJECT_ACE::InheritedObjectType"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_OBJECT_ACE, InheritedObjectType) - 28usize];
  ["Offset of field: _SYSTEM_AUDIT_OBJECT_ACE::SidStart"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_OBJECT_ACE, SidStart) - 44usize];
};
pub type SYSTEM_AUDIT_OBJECT_ACE = _SYSTEM_AUDIT_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ALARM_OBJECT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub Flags: DWORD,
  pub ObjectType: GUID,
  pub InheritedObjectType: GUID,
  pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_ALARM_OBJECT_ACE"][::std::mem::size_of::<_SYSTEM_ALARM_OBJECT_ACE>() - 48usize];
  ["Alignment of _SYSTEM_ALARM_OBJECT_ACE"]
    [::std::mem::align_of::<_SYSTEM_ALARM_OBJECT_ACE>() - 4usize];
  ["Offset of field: _SYSTEM_ALARM_OBJECT_ACE::Header"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_OBJECT_ACE, Header) - 0usize];
  ["Offset of field: _SYSTEM_ALARM_OBJECT_ACE::Mask"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_OBJECT_ACE, Mask) - 4usize];
  ["Offset of field: _SYSTEM_ALARM_OBJECT_ACE::Flags"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_OBJECT_ACE, Flags) - 8usize];
  ["Offset of field: _SYSTEM_ALARM_OBJECT_ACE::ObjectType"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_OBJECT_ACE, ObjectType) - 12usize];
  ["Offset of field: _SYSTEM_ALARM_OBJECT_ACE::InheritedObjectType"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_OBJECT_ACE, InheritedObjectType) - 28usize];
  ["Offset of field: _SYSTEM_ALARM_OBJECT_ACE::SidStart"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_OBJECT_ACE, SidStart) - 44usize];
};
pub type SYSTEM_ALARM_OBJECT_ACE = _SYSTEM_ALARM_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_AUDIT_CALLBACK_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_AUDIT_CALLBACK_ACE"]
    [::std::mem::size_of::<_SYSTEM_AUDIT_CALLBACK_ACE>() - 12usize];
  ["Alignment of _SYSTEM_AUDIT_CALLBACK_ACE"]
    [::std::mem::align_of::<_SYSTEM_AUDIT_CALLBACK_ACE>() - 4usize];
  ["Offset of field: _SYSTEM_AUDIT_CALLBACK_ACE::Header"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_ACE, Header) - 0usize];
  ["Offset of field: _SYSTEM_AUDIT_CALLBACK_ACE::Mask"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_ACE, Mask) - 4usize];
  ["Offset of field: _SYSTEM_AUDIT_CALLBACK_ACE::SidStart"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_ACE, SidStart) - 8usize];
};
pub type SYSTEM_AUDIT_CALLBACK_ACE = _SYSTEM_AUDIT_CALLBACK_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ALARM_CALLBACK_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_ALARM_CALLBACK_ACE"]
    [::std::mem::size_of::<_SYSTEM_ALARM_CALLBACK_ACE>() - 12usize];
  ["Alignment of _SYSTEM_ALARM_CALLBACK_ACE"]
    [::std::mem::align_of::<_SYSTEM_ALARM_CALLBACK_ACE>() - 4usize];
  ["Offset of field: _SYSTEM_ALARM_CALLBACK_ACE::Header"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_ACE, Header) - 0usize];
  ["Offset of field: _SYSTEM_ALARM_CALLBACK_ACE::Mask"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_ACE, Mask) - 4usize];
  ["Offset of field: _SYSTEM_ALARM_CALLBACK_ACE::SidStart"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_ACE, SidStart) - 8usize];
};
pub type SYSTEM_ALARM_CALLBACK_ACE = _SYSTEM_ALARM_CALLBACK_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub Flags: DWORD,
  pub ObjectType: GUID,
  pub InheritedObjectType: GUID,
  pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE"]
    [::std::mem::size_of::<_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE>() - 48usize];
  ["Alignment of _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE"]
    [::std::mem::align_of::<_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE>() - 4usize];
  ["Offset of field: _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE::Header"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE, Header) - 0usize];
  ["Offset of field: _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE::Mask"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE, Mask) - 4usize];
  ["Offset of field: _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE::Flags"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE, Flags) - 8usize];
  ["Offset of field: _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE::ObjectType"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE, ObjectType) - 12usize];
  ["Offset of field: _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE::InheritedObjectType"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE, InheritedObjectType) - 28usize];
  ["Offset of field: _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE::SidStart"]
    [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE, SidStart) - 44usize];
};
pub type SYSTEM_AUDIT_CALLBACK_OBJECT_ACE = _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ALARM_CALLBACK_OBJECT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub Flags: DWORD,
  pub ObjectType: GUID,
  pub InheritedObjectType: GUID,
  pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_ALARM_CALLBACK_OBJECT_ACE"]
    [::std::mem::size_of::<_SYSTEM_ALARM_CALLBACK_OBJECT_ACE>() - 48usize];
  ["Alignment of _SYSTEM_ALARM_CALLBACK_OBJECT_ACE"]
    [::std::mem::align_of::<_SYSTEM_ALARM_CALLBACK_OBJECT_ACE>() - 4usize];
  ["Offset of field: _SYSTEM_ALARM_CALLBACK_OBJECT_ACE::Header"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE, Header) - 0usize];
  ["Offset of field: _SYSTEM_ALARM_CALLBACK_OBJECT_ACE::Mask"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE, Mask) - 4usize];
  ["Offset of field: _SYSTEM_ALARM_CALLBACK_OBJECT_ACE::Flags"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE, Flags) - 8usize];
  ["Offset of field: _SYSTEM_ALARM_CALLBACK_OBJECT_ACE::ObjectType"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE, ObjectType) - 12usize];
  ["Offset of field: _SYSTEM_ALARM_CALLBACK_OBJECT_ACE::InheritedObjectType"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE, InheritedObjectType) - 28usize];
  ["Offset of field: _SYSTEM_ALARM_CALLBACK_OBJECT_ACE::SidStart"]
    [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE, SidStart) - 44usize];
};
pub type SYSTEM_ALARM_CALLBACK_OBJECT_ACE = _SYSTEM_ALARM_CALLBACK_OBJECT_ACE;
pub type SECURITY_DESCRIPTOR_CONTROL = WORD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_DESCRIPTOR_RELATIVE {
  pub Revision: BYTE,
  pub Sbz1: BYTE,
  pub Control: SECURITY_DESCRIPTOR_CONTROL,
  pub Owner: DWORD,
  pub Group: DWORD,
  pub Sacl: DWORD,
  pub Dacl: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SECURITY_DESCRIPTOR_RELATIVE"]
    [::std::mem::size_of::<_SECURITY_DESCRIPTOR_RELATIVE>() - 20usize];
  ["Alignment of _SECURITY_DESCRIPTOR_RELATIVE"]
    [::std::mem::align_of::<_SECURITY_DESCRIPTOR_RELATIVE>() - 4usize];
  ["Offset of field: _SECURITY_DESCRIPTOR_RELATIVE::Revision"]
    [::std::mem::offset_of!(_SECURITY_DESCRIPTOR_RELATIVE, Revision) - 0usize];
  ["Offset of field: _SECURITY_DESCRIPTOR_RELATIVE::Sbz1"]
    [::std::mem::offset_of!(_SECURITY_DESCRIPTOR_RELATIVE, Sbz1) - 1usize];
  ["Offset of field: _SECURITY_DESCRIPTOR_RELATIVE::Control"]
    [::std::mem::offset_of!(_SECURITY_DESCRIPTOR_RELATIVE, Control) - 2usize];
  ["Offset of field: _SECURITY_DESCRIPTOR_RELATIVE::Owner"]
    [::std::mem::offset_of!(_SECURITY_DESCRIPTOR_RELATIVE, Owner) - 4usize];
  ["Offset of field: _SECURITY_DESCRIPTOR_RELATIVE::Group"]
    [::std::mem::offset_of!(_SECURITY_DESCRIPTOR_RELATIVE, Group) - 8usize];
  ["Offset of field: _SECURITY_DESCRIPTOR_RELATIVE::Sacl"]
    [::std::mem::offset_of!(_SECURITY_DESCRIPTOR_RELATIVE, Sacl) - 12usize];
  ["Offset of field: _SECURITY_DESCRIPTOR_RELATIVE::Dacl"]
    [::std::mem::offset_of!(_SECURITY_DESCRIPTOR_RELATIVE, Dacl) - 16usize];
};
pub type SECURITY_DESCRIPTOR_RELATIVE = _SECURITY_DESCRIPTOR_RELATIVE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_DESCRIPTOR {
  pub Revision: BYTE,
  pub Sbz1: BYTE,
  pub Control: SECURITY_DESCRIPTOR_CONTROL,
  pub Owner: PSID,
  pub Group: PSID,
  pub Sacl: PACL,
  pub Dacl: PACL,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SECURITY_DESCRIPTOR"][::std::mem::size_of::<_SECURITY_DESCRIPTOR>() - 40usize];
  ["Alignment of _SECURITY_DESCRIPTOR"][::std::mem::align_of::<_SECURITY_DESCRIPTOR>() - 8usize];
  ["Offset of field: _SECURITY_DESCRIPTOR::Revision"]
    [::std::mem::offset_of!(_SECURITY_DESCRIPTOR, Revision) - 0usize];
  ["Offset of field: _SECURITY_DESCRIPTOR::Sbz1"]
    [::std::mem::offset_of!(_SECURITY_DESCRIPTOR, Sbz1) - 1usize];
  ["Offset of field: _SECURITY_DESCRIPTOR::Control"]
    [::std::mem::offset_of!(_SECURITY_DESCRIPTOR, Control) - 2usize];
  ["Offset of field: _SECURITY_DESCRIPTOR::Owner"]
    [::std::mem::offset_of!(_SECURITY_DESCRIPTOR, Owner) - 8usize];
  ["Offset of field: _SECURITY_DESCRIPTOR::Group"]
    [::std::mem::offset_of!(_SECURITY_DESCRIPTOR, Group) - 16usize];
  ["Offset of field: _SECURITY_DESCRIPTOR::Sacl"]
    [::std::mem::offset_of!(_SECURITY_DESCRIPTOR, Sacl) - 24usize];
  ["Offset of field: _SECURITY_DESCRIPTOR::Dacl"]
    [::std::mem::offset_of!(_SECURITY_DESCRIPTOR, Dacl) - 32usize];
};
pub type SECURITY_DESCRIPTOR = _SECURITY_DESCRIPTOR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_OBJECT_AI_PARAMS {
  pub Size: DWORD,
  pub ConstraintMask: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SECURITY_OBJECT_AI_PARAMS"]
    [::std::mem::size_of::<_SECURITY_OBJECT_AI_PARAMS>() - 8usize];
  ["Alignment of _SECURITY_OBJECT_AI_PARAMS"]
    [::std::mem::align_of::<_SECURITY_OBJECT_AI_PARAMS>() - 4usize];
  ["Offset of field: _SECURITY_OBJECT_AI_PARAMS::Size"]
    [::std::mem::offset_of!(_SECURITY_OBJECT_AI_PARAMS, Size) - 0usize];
  ["Offset of field: _SECURITY_OBJECT_AI_PARAMS::ConstraintMask"]
    [::std::mem::offset_of!(_SECURITY_OBJECT_AI_PARAMS, ConstraintMask) - 4usize];
};
pub type SECURITY_OBJECT_AI_PARAMS = _SECURITY_OBJECT_AI_PARAMS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _OBJECT_TYPE_LIST {
  pub Level: WORD,
  pub Sbz: WORD,
  pub ObjectType: *mut GUID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _OBJECT_TYPE_LIST"][::std::mem::size_of::<_OBJECT_TYPE_LIST>() - 16usize];
  ["Alignment of _OBJECT_TYPE_LIST"][::std::mem::align_of::<_OBJECT_TYPE_LIST>() - 8usize];
  ["Offset of field: _OBJECT_TYPE_LIST::Level"]
    [::std::mem::offset_of!(_OBJECT_TYPE_LIST, Level) - 0usize];
  ["Offset of field: _OBJECT_TYPE_LIST::Sbz"]
    [::std::mem::offset_of!(_OBJECT_TYPE_LIST, Sbz) - 2usize];
  ["Offset of field: _OBJECT_TYPE_LIST::ObjectType"]
    [::std::mem::offset_of!(_OBJECT_TYPE_LIST, ObjectType) - 8usize];
};
pub type POBJECT_TYPE_LIST = *mut _OBJECT_TYPE_LIST;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PRIVILEGE_SET {
  pub PrivilegeCount: DWORD,
  pub Control: DWORD,
  pub Privilege: [LUID_AND_ATTRIBUTES; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _PRIVILEGE_SET"][::std::mem::size_of::<_PRIVILEGE_SET>() - 20usize];
  ["Alignment of _PRIVILEGE_SET"][::std::mem::align_of::<_PRIVILEGE_SET>() - 4usize];
  ["Offset of field: _PRIVILEGE_SET::PrivilegeCount"]
    [::std::mem::offset_of!(_PRIVILEGE_SET, PrivilegeCount) - 0usize];
  ["Offset of field: _PRIVILEGE_SET::Control"]
    [::std::mem::offset_of!(_PRIVILEGE_SET, Control) - 4usize];
  ["Offset of field: _PRIVILEGE_SET::Privilege"]
    [::std::mem::offset_of!(_PRIVILEGE_SET, Privilege) - 8usize];
};
pub type PPRIVILEGE_SET = *mut _PRIVILEGE_SET;
pub type ACCESS_REASON = DWORD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_REASONS {
  pub Data: [ACCESS_REASON; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _ACCESS_REASONS"][::std::mem::size_of::<_ACCESS_REASONS>() - 128usize];
  ["Alignment of _ACCESS_REASONS"][::std::mem::align_of::<_ACCESS_REASONS>() - 4usize];
  ["Offset of field: _ACCESS_REASONS::Data"]
    [::std::mem::offset_of!(_ACCESS_REASONS, Data) - 0usize];
};
pub type PACCESS_REASONS = *mut _ACCESS_REASONS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SE_SECURITY_DESCRIPTOR {
  pub Size: DWORD,
  pub Flags: DWORD,
  pub SecurityDescriptor: PSECURITY_DESCRIPTOR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SE_SECURITY_DESCRIPTOR"][::std::mem::size_of::<_SE_SECURITY_DESCRIPTOR>() - 16usize];
  ["Alignment of _SE_SECURITY_DESCRIPTOR"]
    [::std::mem::align_of::<_SE_SECURITY_DESCRIPTOR>() - 8usize];
  ["Offset of field: _SE_SECURITY_DESCRIPTOR::Size"]
    [::std::mem::offset_of!(_SE_SECURITY_DESCRIPTOR, Size) - 0usize];
  ["Offset of field: _SE_SECURITY_DESCRIPTOR::Flags"]
    [::std::mem::offset_of!(_SE_SECURITY_DESCRIPTOR, Flags) - 4usize];
  ["Offset of field: _SE_SECURITY_DESCRIPTOR::SecurityDescriptor"]
    [::std::mem::offset_of!(_SE_SECURITY_DESCRIPTOR, SecurityDescriptor) - 8usize];
};
pub type SE_SECURITY_DESCRIPTOR = _SE_SECURITY_DESCRIPTOR;
pub type PSE_SECURITY_DESCRIPTOR = *mut _SE_SECURITY_DESCRIPTOR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SE_ACCESS_REQUEST {
  pub Size: DWORD,
  pub SeSecurityDescriptor: PSE_SECURITY_DESCRIPTOR,
  pub DesiredAccess: ACCESS_MASK,
  pub PreviouslyGrantedAccess: ACCESS_MASK,
  pub PrincipalSelfSid: PSID,
  pub GenericMapping: PGENERIC_MAPPING,
  pub ObjectTypeListCount: DWORD,
  pub ObjectTypeList: POBJECT_TYPE_LIST,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SE_ACCESS_REQUEST"][::std::mem::size_of::<_SE_ACCESS_REQUEST>() - 56usize];
  ["Alignment of _SE_ACCESS_REQUEST"][::std::mem::align_of::<_SE_ACCESS_REQUEST>() - 8usize];
  ["Offset of field: _SE_ACCESS_REQUEST::Size"]
    [::std::mem::offset_of!(_SE_ACCESS_REQUEST, Size) - 0usize];
  ["Offset of field: _SE_ACCESS_REQUEST::SeSecurityDescriptor"]
    [::std::mem::offset_of!(_SE_ACCESS_REQUEST, SeSecurityDescriptor) - 8usize];
  ["Offset of field: _SE_ACCESS_REQUEST::DesiredAccess"]
    [::std::mem::offset_of!(_SE_ACCESS_REQUEST, DesiredAccess) - 16usize];
  ["Offset of field: _SE_ACCESS_REQUEST::PreviouslyGrantedAccess"]
    [::std::mem::offset_of!(_SE_ACCESS_REQUEST, PreviouslyGrantedAccess) - 20usize];
  ["Offset of field: _SE_ACCESS_REQUEST::PrincipalSelfSid"]
    [::std::mem::offset_of!(_SE_ACCESS_REQUEST, PrincipalSelfSid) - 24usize];
  ["Offset of field: _SE_ACCESS_REQUEST::GenericMapping"]
    [::std::mem::offset_of!(_SE_ACCESS_REQUEST, GenericMapping) - 32usize];
  ["Offset of field: _SE_ACCESS_REQUEST::ObjectTypeListCount"]
    [::std::mem::offset_of!(_SE_ACCESS_REQUEST, ObjectTypeListCount) - 40usize];
  ["Offset of field: _SE_ACCESS_REQUEST::ObjectTypeList"]
    [::std::mem::offset_of!(_SE_ACCESS_REQUEST, ObjectTypeList) - 48usize];
};
pub type SE_ACCESS_REQUEST = _SE_ACCESS_REQUEST;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SE_ACCESS_REPLY {
  pub Size: DWORD,
  pub ResultListCount: DWORD,
  pub GrantedAccess: PACCESS_MASK,
  pub AccessStatus: PDWORD,
  pub AccessReason: PACCESS_REASONS,
  pub Privileges: *mut PPRIVILEGE_SET,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SE_ACCESS_REPLY"][::std::mem::size_of::<_SE_ACCESS_REPLY>() - 40usize];
  ["Alignment of _SE_ACCESS_REPLY"][::std::mem::align_of::<_SE_ACCESS_REPLY>() - 8usize];
  ["Offset of field: _SE_ACCESS_REPLY::Size"]
    [::std::mem::offset_of!(_SE_ACCESS_REPLY, Size) - 0usize];
  ["Offset of field: _SE_ACCESS_REPLY::ResultListCount"]
    [::std::mem::offset_of!(_SE_ACCESS_REPLY, ResultListCount) - 4usize];
  ["Offset of field: _SE_ACCESS_REPLY::GrantedAccess"]
    [::std::mem::offset_of!(_SE_ACCESS_REPLY, GrantedAccess) - 8usize];
  ["Offset of field: _SE_ACCESS_REPLY::AccessStatus"]
    [::std::mem::offset_of!(_SE_ACCESS_REPLY, AccessStatus) - 16usize];
  ["Offset of field: _SE_ACCESS_REPLY::AccessReason"]
    [::std::mem::offset_of!(_SE_ACCESS_REPLY, AccessReason) - 24usize];
  ["Offset of field: _SE_ACCESS_REPLY::Privileges"]
    [::std::mem::offset_of!(_SE_ACCESS_REPLY, Privileges) - 32usize];
};
pub type SE_ACCESS_REPLY = _SE_ACCESS_REPLY;
pub const _SECURITY_IMPERSONATION_LEVEL_SecurityAnonymous: _SECURITY_IMPERSONATION_LEVEL = 0;
pub const _SECURITY_IMPERSONATION_LEVEL_SecurityIdentification: _SECURITY_IMPERSONATION_LEVEL = 1;
pub const _SECURITY_IMPERSONATION_LEVEL_SecurityImpersonation: _SECURITY_IMPERSONATION_LEVEL = 2;
pub const _SECURITY_IMPERSONATION_LEVEL_SecurityDelegation: _SECURITY_IMPERSONATION_LEVEL = 3;
pub type _SECURITY_IMPERSONATION_LEVEL = ::std::os::raw::c_int;
pub use self::_SECURITY_IMPERSONATION_LEVEL as SECURITY_IMPERSONATION_LEVEL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_USER {
  pub User: SID_AND_ATTRIBUTES,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _TOKEN_USER"][::std::mem::size_of::<_TOKEN_USER>() - 16usize];
  ["Alignment of _TOKEN_USER"][::std::mem::align_of::<_TOKEN_USER>() - 8usize];
  ["Offset of field: _TOKEN_USER::User"][::std::mem::offset_of!(_TOKEN_USER, User) - 0usize];
};
pub type TOKEN_USER = _TOKEN_USER;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SE_TOKEN_USER {
  pub __bindgen_anon_1: _SE_TOKEN_USER__bindgen_ty_1,
  pub __bindgen_anon_2: _SE_TOKEN_USER__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SE_TOKEN_USER__bindgen_ty_1 {
  pub TokenUser: TOKEN_USER,
  pub User: SID_AND_ATTRIBUTES,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SE_TOKEN_USER__bindgen_ty_1"]
    [::std::mem::size_of::<_SE_TOKEN_USER__bindgen_ty_1>() - 16usize];
  ["Alignment of _SE_TOKEN_USER__bindgen_ty_1"]
    [::std::mem::align_of::<_SE_TOKEN_USER__bindgen_ty_1>() - 8usize];
  ["Offset of field: _SE_TOKEN_USER__bindgen_ty_1::TokenUser"]
    [::std::mem::offset_of!(_SE_TOKEN_USER__bindgen_ty_1, TokenUser) - 0usize];
  ["Offset of field: _SE_TOKEN_USER__bindgen_ty_1::User"]
    [::std::mem::offset_of!(_SE_TOKEN_USER__bindgen_ty_1, User) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SE_TOKEN_USER__bindgen_ty_2 {
  pub Sid: SID,
  pub Buffer: [BYTE; 68usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SE_TOKEN_USER__bindgen_ty_2"]
    [::std::mem::size_of::<_SE_TOKEN_USER__bindgen_ty_2>() - 68usize];
  ["Alignment of _SE_TOKEN_USER__bindgen_ty_2"]
    [::std::mem::align_of::<_SE_TOKEN_USER__bindgen_ty_2>() - 4usize];
  ["Offset of field: _SE_TOKEN_USER__bindgen_ty_2::Sid"]
    [::std::mem::offset_of!(_SE_TOKEN_USER__bindgen_ty_2, Sid) - 0usize];
  ["Offset of field: _SE_TOKEN_USER__bindgen_ty_2::Buffer"]
    [::std::mem::offset_of!(_SE_TOKEN_USER__bindgen_ty_2, Buffer) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SE_TOKEN_USER"][::std::mem::size_of::<_SE_TOKEN_USER>() - 88usize];
  ["Alignment of _SE_TOKEN_USER"][::std::mem::align_of::<_SE_TOKEN_USER>() - 8usize];
};
pub type SE_TOKEN_USER = _SE_TOKEN_USER;
pub type SECURITY_CONTEXT_TRACKING_MODE = BOOLEAN;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_QUALITY_OF_SERVICE {
  pub Length: DWORD,
  pub ImpersonationLevel: SECURITY_IMPERSONATION_LEVEL,
  pub ContextTrackingMode: SECURITY_CONTEXT_TRACKING_MODE,
  pub EffectiveOnly: BOOLEAN,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SECURITY_QUALITY_OF_SERVICE"]
    [::std::mem::size_of::<_SECURITY_QUALITY_OF_SERVICE>() - 12usize];
  ["Alignment of _SECURITY_QUALITY_OF_SERVICE"]
    [::std::mem::align_of::<_SECURITY_QUALITY_OF_SERVICE>() - 4usize];
  ["Offset of field: _SECURITY_QUALITY_OF_SERVICE::Length"]
    [::std::mem::offset_of!(_SECURITY_QUALITY_OF_SERVICE, Length) - 0usize];
  ["Offset of field: _SECURITY_QUALITY_OF_SERVICE::ImpersonationLevel"]
    [::std::mem::offset_of!(_SECURITY_QUALITY_OF_SERVICE, ImpersonationLevel) - 4usize];
  ["Offset of field: _SECURITY_QUALITY_OF_SERVICE::ContextTrackingMode"]
    [::std::mem::offset_of!(_SECURITY_QUALITY_OF_SERVICE, ContextTrackingMode) - 8usize];
  ["Offset of field: _SECURITY_QUALITY_OF_SERVICE::EffectiveOnly"]
    [::std::mem::offset_of!(_SECURITY_QUALITY_OF_SERVICE, EffectiveOnly) - 9usize];
};
pub type SECURITY_QUALITY_OF_SERVICE = _SECURITY_QUALITY_OF_SERVICE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SE_IMPERSONATION_STATE {
  pub Token: PACCESS_TOKEN,
  pub CopyOnOpen: BOOLEAN,
  pub EffectiveOnly: BOOLEAN,
  pub Level: SECURITY_IMPERSONATION_LEVEL,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SE_IMPERSONATION_STATE"][::std::mem::size_of::<_SE_IMPERSONATION_STATE>() - 16usize];
  ["Alignment of _SE_IMPERSONATION_STATE"]
    [::std::mem::align_of::<_SE_IMPERSONATION_STATE>() - 8usize];
  ["Offset of field: _SE_IMPERSONATION_STATE::Token"]
    [::std::mem::offset_of!(_SE_IMPERSONATION_STATE, Token) - 0usize];
  ["Offset of field: _SE_IMPERSONATION_STATE::CopyOnOpen"]
    [::std::mem::offset_of!(_SE_IMPERSONATION_STATE, CopyOnOpen) - 8usize];
  ["Offset of field: _SE_IMPERSONATION_STATE::EffectiveOnly"]
    [::std::mem::offset_of!(_SE_IMPERSONATION_STATE, EffectiveOnly) - 9usize];
  ["Offset of field: _SE_IMPERSONATION_STATE::Level"]
    [::std::mem::offset_of!(_SE_IMPERSONATION_STATE, Level) - 12usize];
};
pub type SE_IMPERSONATION_STATE = _SE_IMPERSONATION_STATE;
pub type SECURITY_INFORMATION = DWORD;
pub type SE_SIGNING_LEVEL = BYTE;
pub const _SE_IMAGE_SIGNATURE_TYPE_SeImageSignatureNone: _SE_IMAGE_SIGNATURE_TYPE = 0;
pub const _SE_IMAGE_SIGNATURE_TYPE_SeImageSignatureEmbedded: _SE_IMAGE_SIGNATURE_TYPE = 1;
pub const _SE_IMAGE_SIGNATURE_TYPE_SeImageSignatureCache: _SE_IMAGE_SIGNATURE_TYPE = 2;
pub const _SE_IMAGE_SIGNATURE_TYPE_SeImageSignatureCatalogCached: _SE_IMAGE_SIGNATURE_TYPE = 3;
pub const _SE_IMAGE_SIGNATURE_TYPE_SeImageSignatureCatalogNotCached: _SE_IMAGE_SIGNATURE_TYPE = 4;
pub const _SE_IMAGE_SIGNATURE_TYPE_SeImageSignatureCatalogHint: _SE_IMAGE_SIGNATURE_TYPE = 5;
pub const _SE_IMAGE_SIGNATURE_TYPE_SeImageSignaturePackageCatalog: _SE_IMAGE_SIGNATURE_TYPE = 6;
pub const _SE_IMAGE_SIGNATURE_TYPE_SeImageSignaturePplMitigated: _SE_IMAGE_SIGNATURE_TYPE = 7;
pub type _SE_IMAGE_SIGNATURE_TYPE = ::std::os::raw::c_int;
pub use self::_SE_IMAGE_SIGNATURE_TYPE as SE_IMAGE_SIGNATURE_TYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_CAPABILITIES {
  pub AppContainerSid: PSID,
  pub Capabilities: PSID_AND_ATTRIBUTES,
  pub CapabilityCount: DWORD,
  pub Reserved: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SECURITY_CAPABILITIES"][::std::mem::size_of::<_SECURITY_CAPABILITIES>() - 24usize];
  ["Alignment of _SECURITY_CAPABILITIES"]
    [::std::mem::align_of::<_SECURITY_CAPABILITIES>() - 8usize];
  ["Offset of field: _SECURITY_CAPABILITIES::AppContainerSid"]
    [::std::mem::offset_of!(_SECURITY_CAPABILITIES, AppContainerSid) - 0usize];
  ["Offset of field: _SECURITY_CAPABILITIES::Capabilities"]
    [::std::mem::offset_of!(_SECURITY_CAPABILITIES, Capabilities) - 8usize];
  ["Offset of field: _SECURITY_CAPABILITIES::CapabilityCount"]
    [::std::mem::offset_of!(_SECURITY_CAPABILITIES, CapabilityCount) - 16usize];
  ["Offset of field: _SECURITY_CAPABILITIES::Reserved"]
    [::std::mem::offset_of!(_SECURITY_CAPABILITIES, Reserved) - 20usize];
};
pub type SECURITY_CAPABILITIES = _SECURITY_CAPABILITIES;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SILOOBJECT_BASIC_INFORMATION {
  pub SiloId: DWORD,
  pub SiloParentId: DWORD,
  pub NumberOfProcesses: DWORD,
  pub IsInServerSilo: BOOLEAN,
  pub Reserved: [BYTE; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SILOOBJECT_BASIC_INFORMATION"]
    [::std::mem::size_of::<_SILOOBJECT_BASIC_INFORMATION>() - 16usize];
  ["Alignment of _SILOOBJECT_BASIC_INFORMATION"]
    [::std::mem::align_of::<_SILOOBJECT_BASIC_INFORMATION>() - 4usize];
  ["Offset of field: _SILOOBJECT_BASIC_INFORMATION::SiloId"]
    [::std::mem::offset_of!(_SILOOBJECT_BASIC_INFORMATION, SiloId) - 0usize];
  ["Offset of field: _SILOOBJECT_BASIC_INFORMATION::SiloParentId"]
    [::std::mem::offset_of!(_SILOOBJECT_BASIC_INFORMATION, SiloParentId) - 4usize];
  ["Offset of field: _SILOOBJECT_BASIC_INFORMATION::NumberOfProcesses"]
    [::std::mem::offset_of!(_SILOOBJECT_BASIC_INFORMATION, NumberOfProcesses) - 8usize];
  ["Offset of field: _SILOOBJECT_BASIC_INFORMATION::IsInServerSilo"]
    [::std::mem::offset_of!(_SILOOBJECT_BASIC_INFORMATION, IsInServerSilo) - 12usize];
  ["Offset of field: _SILOOBJECT_BASIC_INFORMATION::Reserved"]
    [::std::mem::offset_of!(_SILOOBJECT_BASIC_INFORMATION, Reserved) - 13usize];
};
pub type SILOOBJECT_BASIC_INFORMATION = _SILOOBJECT_BASIC_INFORMATION;
pub const _SERVERSILO_STATE_SERVERSILO_INITING: _SERVERSILO_STATE = 0;
pub const _SERVERSILO_STATE_SERVERSILO_STARTED: _SERVERSILO_STATE = 1;
pub const _SERVERSILO_STATE_SERVERSILO_SHUTTING_DOWN: _SERVERSILO_STATE = 2;
pub const _SERVERSILO_STATE_SERVERSILO_TERMINATING: _SERVERSILO_STATE = 3;
pub const _SERVERSILO_STATE_SERVERSILO_TERMINATED: _SERVERSILO_STATE = 4;
pub type _SERVERSILO_STATE = ::std::os::raw::c_int;
pub use self::_SERVERSILO_STATE as SERVERSILO_STATE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SERVERSILO_BASIC_INFORMATION {
  pub ServiceSessionId: DWORD,
  pub State: SERVERSILO_STATE,
  pub ExitStatus: DWORD,
  pub Reserved: BOOLEAN,
  pub ApiSetSchema: PVOID,
  pub HostApiSetSchema: PVOID,
  pub ContainerBuildNumber: DWORD,
  pub HostBuildNumber: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SERVERSILO_BASIC_INFORMATION"]
    [::std::mem::size_of::<_SERVERSILO_BASIC_INFORMATION>() - 40usize];
  ["Alignment of _SERVERSILO_BASIC_INFORMATION"]
    [::std::mem::align_of::<_SERVERSILO_BASIC_INFORMATION>() - 8usize];
  ["Offset of field: _SERVERSILO_BASIC_INFORMATION::ServiceSessionId"]
    [::std::mem::offset_of!(_SERVERSILO_BASIC_INFORMATION, ServiceSessionId) - 0usize];
  ["Offset of field: _SERVERSILO_BASIC_INFORMATION::State"]
    [::std::mem::offset_of!(_SERVERSILO_BASIC_INFORMATION, State) - 4usize];
  ["Offset of field: _SERVERSILO_BASIC_INFORMATION::ExitStatus"]
    [::std::mem::offset_of!(_SERVERSILO_BASIC_INFORMATION, ExitStatus) - 8usize];
  ["Offset of field: _SERVERSILO_BASIC_INFORMATION::Reserved"]
    [::std::mem::offset_of!(_SERVERSILO_BASIC_INFORMATION, Reserved) - 12usize];
  ["Offset of field: _SERVERSILO_BASIC_INFORMATION::ApiSetSchema"]
    [::std::mem::offset_of!(_SERVERSILO_BASIC_INFORMATION, ApiSetSchema) - 16usize];
  ["Offset of field: _SERVERSILO_BASIC_INFORMATION::HostApiSetSchema"]
    [::std::mem::offset_of!(_SERVERSILO_BASIC_INFORMATION, HostApiSetSchema) - 24usize];
  ["Offset of field: _SERVERSILO_BASIC_INFORMATION::ContainerBuildNumber"]
    [::std::mem::offset_of!(_SERVERSILO_BASIC_INFORMATION, ContainerBuildNumber) - 32usize];
  ["Offset of field: _SERVERSILO_BASIC_INFORMATION::HostBuildNumber"]
    [::std::mem::offset_of!(_SERVERSILO_BASIC_INFORMATION, HostBuildNumber) - 36usize];
};
pub type SERVERSILO_BASIC_INFORMATION = _SERVERSILO_BASIC_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SERVERSILO_DIAGNOSTIC_INFORMATION {
  pub ReportId: GUID,
  pub ExitStatus: DWORD,
  pub CriticalProcessName: [WCHAR; 15usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SERVERSILO_DIAGNOSTIC_INFORMATION"]
    [::std::mem::size_of::<_SERVERSILO_DIAGNOSTIC_INFORMATION>() - 52usize];
  ["Alignment of _SERVERSILO_DIAGNOSTIC_INFORMATION"]
    [::std::mem::align_of::<_SERVERSILO_DIAGNOSTIC_INFORMATION>() - 4usize];
  ["Offset of field: _SERVERSILO_DIAGNOSTIC_INFORMATION::ReportId"]
    [::std::mem::offset_of!(_SERVERSILO_DIAGNOSTIC_INFORMATION, ReportId) - 0usize];
  ["Offset of field: _SERVERSILO_DIAGNOSTIC_INFORMATION::ExitStatus"]
    [::std::mem::offset_of!(_SERVERSILO_DIAGNOSTIC_INFORMATION, ExitStatus) - 16usize];
  ["Offset of field: _SERVERSILO_DIAGNOSTIC_INFORMATION::CriticalProcessName"]
    [::std::mem::offset_of!(_SERVERSILO_DIAGNOSTIC_INFORMATION, CriticalProcessName) - 20usize];
};
pub type SERVERSILO_DIAGNOSTIC_INFORMATION = _SERVERSILO_DIAGNOSTIC_INFORMATION;
pub const _LOGICAL_PROCESSOR_RELATIONSHIP_RelationProcessorCore: _LOGICAL_PROCESSOR_RELATIONSHIP =
  0;
pub const _LOGICAL_PROCESSOR_RELATIONSHIP_RelationNumaNode: _LOGICAL_PROCESSOR_RELATIONSHIP = 1;
pub const _LOGICAL_PROCESSOR_RELATIONSHIP_RelationCache: _LOGICAL_PROCESSOR_RELATIONSHIP = 2;
pub const _LOGICAL_PROCESSOR_RELATIONSHIP_RelationProcessorPackage:
  _LOGICAL_PROCESSOR_RELATIONSHIP = 3;
pub const _LOGICAL_PROCESSOR_RELATIONSHIP_RelationGroup: _LOGICAL_PROCESSOR_RELATIONSHIP = 4;
pub const _LOGICAL_PROCESSOR_RELATIONSHIP_RelationProcessorDie: _LOGICAL_PROCESSOR_RELATIONSHIP = 5;
pub const _LOGICAL_PROCESSOR_RELATIONSHIP_RelationNumaNodeEx: _LOGICAL_PROCESSOR_RELATIONSHIP = 6;
pub const _LOGICAL_PROCESSOR_RELATIONSHIP_RelationProcessorModule: _LOGICAL_PROCESSOR_RELATIONSHIP =
  7;
pub const _LOGICAL_PROCESSOR_RELATIONSHIP_RelationAll: _LOGICAL_PROCESSOR_RELATIONSHIP = 65535;
pub type _LOGICAL_PROCESSOR_RELATIONSHIP = ::std::os::raw::c_int;
pub use self::_LOGICAL_PROCESSOR_RELATIONSHIP as LOGICAL_PROCESSOR_RELATIONSHIP;
pub const _PROCESSOR_CACHE_TYPE_CacheUnified: _PROCESSOR_CACHE_TYPE = 0;
pub const _PROCESSOR_CACHE_TYPE_CacheInstruction: _PROCESSOR_CACHE_TYPE = 1;
pub const _PROCESSOR_CACHE_TYPE_CacheData: _PROCESSOR_CACHE_TYPE = 2;
pub const _PROCESSOR_CACHE_TYPE_CacheTrace: _PROCESSOR_CACHE_TYPE = 3;
pub const _PROCESSOR_CACHE_TYPE_CacheUnknown: _PROCESSOR_CACHE_TYPE = 4;
pub type _PROCESSOR_CACHE_TYPE = ::std::os::raw::c_int;
pub use self::_PROCESSOR_CACHE_TYPE as PROCESSOR_CACHE_TYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CACHE_DESCRIPTOR {
  pub Level: BYTE,
  pub Associativity: BYTE,
  pub LineSize: WORD,
  pub Size: DWORD,
  pub Type: PROCESSOR_CACHE_TYPE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _CACHE_DESCRIPTOR"][::std::mem::size_of::<_CACHE_DESCRIPTOR>() - 12usize];
  ["Alignment of _CACHE_DESCRIPTOR"][::std::mem::align_of::<_CACHE_DESCRIPTOR>() - 4usize];
  ["Offset of field: _CACHE_DESCRIPTOR::Level"]
    [::std::mem::offset_of!(_CACHE_DESCRIPTOR, Level) - 0usize];
  ["Offset of field: _CACHE_DESCRIPTOR::Associativity"]
    [::std::mem::offset_of!(_CACHE_DESCRIPTOR, Associativity) - 1usize];
  ["Offset of field: _CACHE_DESCRIPTOR::LineSize"]
    [::std::mem::offset_of!(_CACHE_DESCRIPTOR, LineSize) - 2usize];
  ["Offset of field: _CACHE_DESCRIPTOR::Size"]
    [::std::mem::offset_of!(_CACHE_DESCRIPTOR, Size) - 4usize];
  ["Offset of field: _CACHE_DESCRIPTOR::Type"]
    [::std::mem::offset_of!(_CACHE_DESCRIPTOR, Type) - 8usize];
};
pub type CACHE_DESCRIPTOR = _CACHE_DESCRIPTOR;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SYSTEM_LOGICAL_PROCESSOR_INFORMATION {
  pub ProcessorMask: ULONG_PTR,
  pub Relationship: LOGICAL_PROCESSOR_RELATIONSHIP,
  pub __bindgen_anon_1: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1 {
  pub ProcessorCore: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1,
  pub NumaNode: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2,
  pub Cache: CACHE_DESCRIPTOR,
  pub Reserved: [ULONGLONG; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1 {
  pub Flags: BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
    _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1,
  >() - 1usize];
  ["Alignment of _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1"]
    [::std::mem::align_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1>()
      - 1usize];
  ["Offset of field: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1::Flags"][::std::mem::offset_of!(
    _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1,
    Flags
  )
    - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2 {
  pub NodeNumber: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2"][::std::mem::size_of::<
    _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2,
  >() - 4usize];
  ["Alignment of _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2"]
    [::std::mem::align_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2>()
      - 4usize];
  ["Offset of field: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2::NodeNumber"] [:: std :: mem :: offset_of ! (_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2 , NodeNumber) - 0usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1"]
    [::std::mem::size_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1>() - 16usize];
  ["Alignment of _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1"]
    [::std::mem::align_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1>() - 8usize];
  ["Offset of field: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1::ProcessorCore"][::std::mem::offset_of!(
    _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1,
    ProcessorCore
  )
    - 0usize];
  ["Offset of field: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1::NumaNode"][::std::mem::offset_of!(
    _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1,
    NumaNode
  ) - 0usize];
  ["Offset of field: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1::Cache"]
    [::std::mem::offset_of!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1, Cache) - 0usize];
  ["Offset of field: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1::Reserved"][::std::mem::offset_of!(
    _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1,
    Reserved
  ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_LOGICAL_PROCESSOR_INFORMATION"]
    [::std::mem::size_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION>() - 32usize];
  ["Alignment of _SYSTEM_LOGICAL_PROCESSOR_INFORMATION"]
    [::std::mem::align_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION>() - 8usize];
  ["Offset of field: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION::ProcessorMask"]
    [::std::mem::offset_of!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION, ProcessorMask) - 0usize];
  ["Offset of field: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION::Relationship"]
    [::std::mem::offset_of!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION, Relationship) - 8usize];
};
pub type SYSTEM_LOGICAL_PROCESSOR_INFORMATION = _SYSTEM_LOGICAL_PROCESSOR_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PROCESSOR_RELATIONSHIP {
  pub Flags: BYTE,
  pub EfficiencyClass: BYTE,
  pub Reserved: [BYTE; 20usize],
  pub GroupCount: WORD,
  pub GroupMask: [GROUP_AFFINITY; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _PROCESSOR_RELATIONSHIP"][::std::mem::size_of::<_PROCESSOR_RELATIONSHIP>() - 40usize];
  ["Alignment of _PROCESSOR_RELATIONSHIP"]
    [::std::mem::align_of::<_PROCESSOR_RELATIONSHIP>() - 8usize];
  ["Offset of field: _PROCESSOR_RELATIONSHIP::Flags"]
    [::std::mem::offset_of!(_PROCESSOR_RELATIONSHIP, Flags) - 0usize];
  ["Offset of field: _PROCESSOR_RELATIONSHIP::EfficiencyClass"]
    [::std::mem::offset_of!(_PROCESSOR_RELATIONSHIP, EfficiencyClass) - 1usize];
  ["Offset of field: _PROCESSOR_RELATIONSHIP::Reserved"]
    [::std::mem::offset_of!(_PROCESSOR_RELATIONSHIP, Reserved) - 2usize];
  ["Offset of field: _PROCESSOR_RELATIONSHIP::GroupCount"]
    [::std::mem::offset_of!(_PROCESSOR_RELATIONSHIP, GroupCount) - 22usize];
  ["Offset of field: _PROCESSOR_RELATIONSHIP::GroupMask"]
    [::std::mem::offset_of!(_PROCESSOR_RELATIONSHIP, GroupMask) - 24usize];
};
pub type PROCESSOR_RELATIONSHIP = _PROCESSOR_RELATIONSHIP;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _NUMA_NODE_RELATIONSHIP {
  pub NodeNumber: DWORD,
  pub Reserved: [BYTE; 18usize],
  pub GroupCount: WORD,
  pub __bindgen_anon_1: _NUMA_NODE_RELATIONSHIP__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _NUMA_NODE_RELATIONSHIP__bindgen_ty_1 {
  pub GroupMask: GROUP_AFFINITY,
  pub GroupMasks: [GROUP_AFFINITY; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _NUMA_NODE_RELATIONSHIP__bindgen_ty_1"]
    [::std::mem::size_of::<_NUMA_NODE_RELATIONSHIP__bindgen_ty_1>() - 16usize];
  ["Alignment of _NUMA_NODE_RELATIONSHIP__bindgen_ty_1"]
    [::std::mem::align_of::<_NUMA_NODE_RELATIONSHIP__bindgen_ty_1>() - 8usize];
  ["Offset of field: _NUMA_NODE_RELATIONSHIP__bindgen_ty_1::GroupMask"]
    [::std::mem::offset_of!(_NUMA_NODE_RELATIONSHIP__bindgen_ty_1, GroupMask) - 0usize];
  ["Offset of field: _NUMA_NODE_RELATIONSHIP__bindgen_ty_1::GroupMasks"]
    [::std::mem::offset_of!(_NUMA_NODE_RELATIONSHIP__bindgen_ty_1, GroupMasks) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _NUMA_NODE_RELATIONSHIP"][::std::mem::size_of::<_NUMA_NODE_RELATIONSHIP>() - 40usize];
  ["Alignment of _NUMA_NODE_RELATIONSHIP"]
    [::std::mem::align_of::<_NUMA_NODE_RELATIONSHIP>() - 8usize];
  ["Offset of field: _NUMA_NODE_RELATIONSHIP::NodeNumber"]
    [::std::mem::offset_of!(_NUMA_NODE_RELATIONSHIP, NodeNumber) - 0usize];
  ["Offset of field: _NUMA_NODE_RELATIONSHIP::Reserved"]
    [::std::mem::offset_of!(_NUMA_NODE_RELATIONSHIP, Reserved) - 4usize];
  ["Offset of field: _NUMA_NODE_RELATIONSHIP::GroupCount"]
    [::std::mem::offset_of!(_NUMA_NODE_RELATIONSHIP, GroupCount) - 22usize];
};
pub type NUMA_NODE_RELATIONSHIP = _NUMA_NODE_RELATIONSHIP;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _CACHE_RELATIONSHIP {
  pub Level: BYTE,
  pub Associativity: BYTE,
  pub LineSize: WORD,
  pub CacheSize: DWORD,
  pub Type: PROCESSOR_CACHE_TYPE,
  pub Reserved: [BYTE; 18usize],
  pub GroupCount: WORD,
  pub __bindgen_anon_1: _CACHE_RELATIONSHIP__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _CACHE_RELATIONSHIP__bindgen_ty_1 {
  pub GroupMask: GROUP_AFFINITY,
  pub GroupMasks: [GROUP_AFFINITY; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _CACHE_RELATIONSHIP__bindgen_ty_1"]
    [::std::mem::size_of::<_CACHE_RELATIONSHIP__bindgen_ty_1>() - 16usize];
  ["Alignment of _CACHE_RELATIONSHIP__bindgen_ty_1"]
    [::std::mem::align_of::<_CACHE_RELATIONSHIP__bindgen_ty_1>() - 8usize];
  ["Offset of field: _CACHE_RELATIONSHIP__bindgen_ty_1::GroupMask"]
    [::std::mem::offset_of!(_CACHE_RELATIONSHIP__bindgen_ty_1, GroupMask) - 0usize];
  ["Offset of field: _CACHE_RELATIONSHIP__bindgen_ty_1::GroupMasks"]
    [::std::mem::offset_of!(_CACHE_RELATIONSHIP__bindgen_ty_1, GroupMasks) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _CACHE_RELATIONSHIP"][::std::mem::size_of::<_CACHE_RELATIONSHIP>() - 48usize];
  ["Alignment of _CACHE_RELATIONSHIP"][::std::mem::align_of::<_CACHE_RELATIONSHIP>() - 8usize];
  ["Offset of field: _CACHE_RELATIONSHIP::Level"]
    [::std::mem::offset_of!(_CACHE_RELATIONSHIP, Level) - 0usize];
  ["Offset of field: _CACHE_RELATIONSHIP::Associativity"]
    [::std::mem::offset_of!(_CACHE_RELATIONSHIP, Associativity) - 1usize];
  ["Offset of field: _CACHE_RELATIONSHIP::LineSize"]
    [::std::mem::offset_of!(_CACHE_RELATIONSHIP, LineSize) - 2usize];
  ["Offset of field: _CACHE_RELATIONSHIP::CacheSize"]
    [::std::mem::offset_of!(_CACHE_RELATIONSHIP, CacheSize) - 4usize];
  ["Offset of field: _CACHE_RELATIONSHIP::Type"]
    [::std::mem::offset_of!(_CACHE_RELATIONSHIP, Type) - 8usize];
  ["Offset of field: _CACHE_RELATIONSHIP::Reserved"]
    [::std::mem::offset_of!(_CACHE_RELATIONSHIP, Reserved) - 12usize];
  ["Offset of field: _CACHE_RELATIONSHIP::GroupCount"]
    [::std::mem::offset_of!(_CACHE_RELATIONSHIP, GroupCount) - 30usize];
};
pub type CACHE_RELATIONSHIP = _CACHE_RELATIONSHIP;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PROCESSOR_GROUP_INFO {
  pub MaximumProcessorCount: BYTE,
  pub ActiveProcessorCount: BYTE,
  pub Reserved: [BYTE; 38usize],
  pub ActiveProcessorMask: KAFFINITY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _PROCESSOR_GROUP_INFO"][::std::mem::size_of::<_PROCESSOR_GROUP_INFO>() - 48usize];
  ["Alignment of _PROCESSOR_GROUP_INFO"][::std::mem::align_of::<_PROCESSOR_GROUP_INFO>() - 8usize];
  ["Offset of field: _PROCESSOR_GROUP_INFO::MaximumProcessorCount"]
    [::std::mem::offset_of!(_PROCESSOR_GROUP_INFO, MaximumProcessorCount) - 0usize];
  ["Offset of field: _PROCESSOR_GROUP_INFO::ActiveProcessorCount"]
    [::std::mem::offset_of!(_PROCESSOR_GROUP_INFO, ActiveProcessorCount) - 1usize];
  ["Offset of field: _PROCESSOR_GROUP_INFO::Reserved"]
    [::std::mem::offset_of!(_PROCESSOR_GROUP_INFO, Reserved) - 2usize];
  ["Offset of field: _PROCESSOR_GROUP_INFO::ActiveProcessorMask"]
    [::std::mem::offset_of!(_PROCESSOR_GROUP_INFO, ActiveProcessorMask) - 40usize];
};
pub type PROCESSOR_GROUP_INFO = _PROCESSOR_GROUP_INFO;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GROUP_RELATIONSHIP {
  pub MaximumGroupCount: WORD,
  pub ActiveGroupCount: WORD,
  pub Reserved: [BYTE; 20usize],
  pub GroupInfo: [PROCESSOR_GROUP_INFO; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _GROUP_RELATIONSHIP"][::std::mem::size_of::<_GROUP_RELATIONSHIP>() - 72usize];
  ["Alignment of _GROUP_RELATIONSHIP"][::std::mem::align_of::<_GROUP_RELATIONSHIP>() - 8usize];
  ["Offset of field: _GROUP_RELATIONSHIP::MaximumGroupCount"]
    [::std::mem::offset_of!(_GROUP_RELATIONSHIP, MaximumGroupCount) - 0usize];
  ["Offset of field: _GROUP_RELATIONSHIP::ActiveGroupCount"]
    [::std::mem::offset_of!(_GROUP_RELATIONSHIP, ActiveGroupCount) - 2usize];
  ["Offset of field: _GROUP_RELATIONSHIP::Reserved"]
    [::std::mem::offset_of!(_GROUP_RELATIONSHIP, Reserved) - 4usize];
  ["Offset of field: _GROUP_RELATIONSHIP::GroupInfo"]
    [::std::mem::offset_of!(_GROUP_RELATIONSHIP, GroupInfo) - 24usize];
};
pub type GROUP_RELATIONSHIP = _GROUP_RELATIONSHIP;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX {
  pub Relationship: LOGICAL_PROCESSOR_RELATIONSHIP,
  pub Size: DWORD,
  pub __bindgen_anon_1: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1 {
  pub Processor: PROCESSOR_RELATIONSHIP,
  pub NumaNode: NUMA_NODE_RELATIONSHIP,
  pub Cache: CACHE_RELATIONSHIP,
  pub Group: GROUP_RELATIONSHIP,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1"]
    [::std::mem::size_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1>() - 72usize];
  ["Alignment of _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1"]
    [::std::mem::align_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1>() - 8usize];
  ["Offset of field: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1::Processor"][::std::mem::offset_of!(
    _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1,
    Processor
  )
    - 0usize];
  ["Offset of field: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1::NumaNode"][::std::mem::offset_of!(
    _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1,
    NumaNode
  ) - 0usize];
  ["Offset of field: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1::Cache"][::std::mem::offset_of!(
    _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1,
    Cache
  ) - 0usize];
  ["Offset of field: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1::Group"][::std::mem::offset_of!(
    _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1,
    Group
  ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX"]
    [::std::mem::size_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX>() - 80usize];
  ["Alignment of _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX"]
    [::std::mem::align_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX>() - 8usize];
  ["Offset of field: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX::Relationship"]
    [::std::mem::offset_of!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX, Relationship) - 0usize];
  ["Offset of field: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX::Size"]
    [::std::mem::offset_of!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX, Size) - 4usize];
};
pub type SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX = _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX;
pub const _CPU_SET_INFORMATION_TYPE_CpuSetInformation: _CPU_SET_INFORMATION_TYPE = 0;
pub type _CPU_SET_INFORMATION_TYPE = ::std::os::raw::c_int;
pub use self::_CPU_SET_INFORMATION_TYPE as CPU_SET_INFORMATION_TYPE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SYSTEM_CPU_SET_INFORMATION {
  pub Size: DWORD,
  pub Type: CPU_SET_INFORMATION_TYPE,
  pub __bindgen_anon_1: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1 {
  pub CpuSet: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1 {
  pub Id: DWORD,
  pub Group: WORD,
  pub LogicalProcessorIndex: BYTE,
  pub CoreIndex: BYTE,
  pub LastLevelCacheIndex: BYTE,
  pub NumaNodeIndex: BYTE,
  pub EfficiencyClass: BYTE,
  pub __bindgen_anon_1: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
  pub __bindgen_anon_2: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
  pub AllocationTag: DWORD64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
  pub AllFlags: BYTE,
  pub __bindgen_anon_1:
    _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
  pub _bitfield_align_1: [u8; 0],
  pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
    [::std::mem::size_of::<
      _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    >()
      - 1usize];
  ["Alignment of _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"] [:: std :: mem :: align_of :: < _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 > () - 1usize] ;
};
impl _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
  #[inline]
  pub fn Parked(&self) -> BYTE {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
  }
  #[inline]
  pub fn set_Parked(&mut self, val: BYTE) {
    unsafe {
      let val: u8 = ::std::mem::transmute(val);
      self._bitfield_1.set(0usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn Parked_raw(this: *const Self) -> BYTE {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        0usize,
        1u8,
      ) as u8)
    }
  }
  #[inline]
  pub unsafe fn set_Parked_raw(this: *mut Self, val: BYTE) {
    unsafe {
      let val: u8 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        0usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn Allocated(&self) -> BYTE {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
  }
  #[inline]
  pub fn set_Allocated(&mut self, val: BYTE) {
    unsafe {
      let val: u8 = ::std::mem::transmute(val);
      self._bitfield_1.set(1usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn Allocated_raw(this: *const Self) -> BYTE {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        1usize,
        1u8,
      ) as u8)
    }
  }
  #[inline]
  pub unsafe fn set_Allocated_raw(this: *mut Self, val: BYTE) {
    unsafe {
      let val: u8 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        1usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn AllocatedToTargetProcess(&self) -> BYTE {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
  }
  #[inline]
  pub fn set_AllocatedToTargetProcess(&mut self, val: BYTE) {
    unsafe {
      let val: u8 = ::std::mem::transmute(val);
      self._bitfield_1.set(2usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn AllocatedToTargetProcess_raw(this: *const Self) -> BYTE {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        2usize,
        1u8,
      ) as u8)
    }
  }
  #[inline]
  pub unsafe fn set_AllocatedToTargetProcess_raw(this: *mut Self, val: BYTE) {
    unsafe {
      let val: u8 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        2usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn RealTime(&self) -> BYTE {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
  }
  #[inline]
  pub fn set_RealTime(&mut self, val: BYTE) {
    unsafe {
      let val: u8 = ::std::mem::transmute(val);
      self._bitfield_1.set(3usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn RealTime_raw(this: *const Self) -> BYTE {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        3usize,
        1u8,
      ) as u8)
    }
  }
  #[inline]
  pub unsafe fn set_RealTime_raw(this: *mut Self, val: BYTE) {
    unsafe {
      let val: u8 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        3usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn ReservedFlags(&self) -> BYTE {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
  }
  #[inline]
  pub fn set_ReservedFlags(&mut self, val: BYTE) {
    unsafe {
      let val: u8 = ::std::mem::transmute(val);
      self._bitfield_1.set(4usize, 4u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn ReservedFlags_raw(this: *const Self) -> BYTE {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        4usize,
        4u8,
      ) as u8)
    }
  }
  #[inline]
  pub unsafe fn set_ReservedFlags_raw(this: *mut Self, val: BYTE) {
    unsafe {
      let val: u8 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        4usize,
        4u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn new_bitfield_1(
    Parked: BYTE,
    Allocated: BYTE,
    AllocatedToTargetProcess: BYTE,
    RealTime: BYTE,
    ReservedFlags: BYTE,
  ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
    let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
    __bindgen_bitfield_unit.set(0usize, 1u8, {
      let Parked: u8 = unsafe { ::std::mem::transmute(Parked) };
      Parked as u64
    });
    __bindgen_bitfield_unit.set(1usize, 1u8, {
      let Allocated: u8 = unsafe { ::std::mem::transmute(Allocated) };
      Allocated as u64
    });
    __bindgen_bitfield_unit.set(2usize, 1u8, {
      let AllocatedToTargetProcess: u8 = unsafe { ::std::mem::transmute(AllocatedToTargetProcess) };
      AllocatedToTargetProcess as u64
    });
    __bindgen_bitfield_unit.set(3usize, 1u8, {
      let RealTime: u8 = unsafe { ::std::mem::transmute(RealTime) };
      RealTime as u64
    });
    __bindgen_bitfield_unit.set(4usize, 4u8, {
      let ReservedFlags: u8 = unsafe { ::std::mem::transmute(ReservedFlags) };
      ReservedFlags as u64
    });
    __bindgen_bitfield_unit
  }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
    [::std::mem::size_of::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(
    ) - 1usize];
  ["Alignment of _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
    [::std::mem::align_of::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(
    ) - 1usize];
  ["Offset of field: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AllFlags"] [:: std :: mem :: offset_of ! (_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 , AllFlags) - 0usize] ;
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 {
  pub Reserved: DWORD,
  pub SchedulingClass: BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2"]
    [::std::mem::size_of::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2>(
    ) - 4usize];
  ["Alignment of _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2"]
    [::std::mem::align_of::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2>(
    ) - 4usize];
  ["Offset of field: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::Reserved"] [:: std :: mem :: offset_of ! (_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 , Reserved) - 0usize] ;
  ["Offset of field: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::SchedulingClass"] [:: std :: mem :: offset_of ! (_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 , SchedulingClass) - 0usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1"]
    [::std::mem::size_of::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1>() - 24usize];
  ["Alignment of _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1"]
    [::std::mem::align_of::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1>() - 8usize];
  ["Offset of field: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1::Id"]
    [::std::mem::offset_of!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1, Id) - 0usize];
  ["Offset of field: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1::Group"][::std::mem::offset_of!(
    _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1,
    Group
  ) - 4usize];
  ["Offset of field: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1::LogicalProcessorIndex"] [:: std :: mem :: offset_of ! (_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1 , LogicalProcessorIndex) - 6usize] ;
  ["Offset of field: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1::CoreIndex"][::std::mem::offset_of!(
    _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1,
    CoreIndex
  )
    - 7usize];
  ["Offset of field: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1::LastLevelCacheIndex"]
    [::std::mem::offset_of!(
      _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1,
      LastLevelCacheIndex
    ) - 8usize];
  ["Offset of field: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1::NumaNodeIndex"][::std::mem::offset_of!(
    _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1,
    NumaNodeIndex
  )
    - 9usize];
  ["Offset of field: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1::EfficiencyClass"][::std::mem::offset_of!(
    _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1,
    EfficiencyClass
  )
    - 10usize];
  ["Offset of field: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1::AllocationTag"][::std::mem::offset_of!(
    _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1,
    AllocationTag
  )
    - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1"]
    [::std::mem::size_of::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1>() - 24usize];
  ["Alignment of _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1"]
    [::std::mem::align_of::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1>() - 8usize];
  ["Offset of field: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1::CpuSet"]
    [::std::mem::offset_of!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1, CpuSet) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_CPU_SET_INFORMATION"]
    [::std::mem::size_of::<_SYSTEM_CPU_SET_INFORMATION>() - 32usize];
  ["Alignment of _SYSTEM_CPU_SET_INFORMATION"]
    [::std::mem::align_of::<_SYSTEM_CPU_SET_INFORMATION>() - 8usize];
  ["Offset of field: _SYSTEM_CPU_SET_INFORMATION::Size"]
    [::std::mem::offset_of!(_SYSTEM_CPU_SET_INFORMATION, Size) - 0usize];
  ["Offset of field: _SYSTEM_CPU_SET_INFORMATION::Type"]
    [::std::mem::offset_of!(_SYSTEM_CPU_SET_INFORMATION, Type) - 4usize];
};
pub type SYSTEM_CPU_SET_INFORMATION = _SYSTEM_CPU_SET_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_POOL_ZEROING_INFORMATION {
  pub PoolZeroingSupportPresent: BOOLEAN,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_POOL_ZEROING_INFORMATION"]
    [::std::mem::size_of::<_SYSTEM_POOL_ZEROING_INFORMATION>() - 1usize];
  ["Alignment of _SYSTEM_POOL_ZEROING_INFORMATION"]
    [::std::mem::align_of::<_SYSTEM_POOL_ZEROING_INFORMATION>() - 1usize];
  ["Offset of field: _SYSTEM_POOL_ZEROING_INFORMATION::PoolZeroingSupportPresent"]
    [::std::mem::offset_of!(_SYSTEM_POOL_ZEROING_INFORMATION, PoolZeroingSupportPresent) - 0usize];
};
pub type SYSTEM_POOL_ZEROING_INFORMATION = _SYSTEM_POOL_ZEROING_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION {
  pub CycleTime: DWORD64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION"]
    [::std::mem::size_of::<_SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION>() - 8usize];
  ["Alignment of _SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION"]
    [::std::mem::align_of::<_SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION>() - 8usize];
  ["Offset of field: _SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION::CycleTime"]
    [::std::mem::offset_of!(_SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION, CycleTime) - 0usize];
};
pub type SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION = _SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION;
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_SUPPORTED_PROCESSOR_ARCHITECTURES_INFORMATION {
  pub _bitfield_align_1: [u16; 0],
  pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_SUPPORTED_PROCESSOR_ARCHITECTURES_INFORMATION"]
    [::std::mem::size_of::<_SYSTEM_SUPPORTED_PROCESSOR_ARCHITECTURES_INFORMATION>() - 4usize];
  ["Alignment of _SYSTEM_SUPPORTED_PROCESSOR_ARCHITECTURES_INFORMATION"]
    [::std::mem::align_of::<_SYSTEM_SUPPORTED_PROCESSOR_ARCHITECTURES_INFORMATION>() - 4usize];
};
impl _SYSTEM_SUPPORTED_PROCESSOR_ARCHITECTURES_INFORMATION {
  #[inline]
  pub fn Machine(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
  }
  #[inline]
  pub fn set_Machine(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(0usize, 16u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn Machine_raw(this: *const Self) -> DWORD {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        0usize,
        16u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_Machine_raw(this: *mut Self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        0usize,
        16u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn KernelMode(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_KernelMode(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(16usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn KernelMode_raw(this: *const Self) -> DWORD {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        16usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_KernelMode_raw(this: *mut Self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        16usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn UserMode(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_UserMode(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(17usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn UserMode_raw(this: *const Self) -> DWORD {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        17usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_UserMode_raw(this: *mut Self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        17usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn Native(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_Native(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(18usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn Native_raw(this: *const Self) -> DWORD {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        18usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_Native_raw(this: *mut Self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        18usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn Process(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_Process(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(19usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn Process_raw(this: *const Self) -> DWORD {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        19usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_Process_raw(this: *mut Self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        19usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn WoW64Container(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_WoW64Container(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(20usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn WoW64Container_raw(this: *const Self) -> DWORD {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        20usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_WoW64Container_raw(this: *mut Self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        20usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn ReservedZero0(&self) -> DWORD {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(21usize, 11u8) as u32) }
  }
  #[inline]
  pub fn set_ReservedZero0(&mut self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(21usize, 11u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn ReservedZero0_raw(this: *const Self) -> DWORD {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        21usize,
        11u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_ReservedZero0_raw(this: *mut Self, val: DWORD) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        21usize,
        11u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn new_bitfield_1(
    Machine: DWORD,
    KernelMode: DWORD,
    UserMode: DWORD,
    Native: DWORD,
    Process: DWORD,
    WoW64Container: DWORD,
    ReservedZero0: DWORD,
  ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
    let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
    __bindgen_bitfield_unit.set(0usize, 16u8, {
      let Machine: u32 = unsafe { ::std::mem::transmute(Machine) };
      Machine as u64
    });
    __bindgen_bitfield_unit.set(16usize, 1u8, {
      let KernelMode: u32 = unsafe { ::std::mem::transmute(KernelMode) };
      KernelMode as u64
    });
    __bindgen_bitfield_unit.set(17usize, 1u8, {
      let UserMode: u32 = unsafe { ::std::mem::transmute(UserMode) };
      UserMode as u64
    });
    __bindgen_bitfield_unit.set(18usize, 1u8, {
      let Native: u32 = unsafe { ::std::mem::transmute(Native) };
      Native as u64
    });
    __bindgen_bitfield_unit.set(19usize, 1u8, {
      let Process: u32 = unsafe { ::std::mem::transmute(Process) };
      Process as u64
    });
    __bindgen_bitfield_unit.set(20usize, 1u8, {
      let WoW64Container: u32 = unsafe { ::std::mem::transmute(WoW64Container) };
      WoW64Container as u64
    });
    __bindgen_bitfield_unit.set(21usize, 11u8, {
      let ReservedZero0: u32 = unsafe { ::std::mem::transmute(ReservedZero0) };
      ReservedZero0 as u64
    });
    __bindgen_bitfield_unit
  }
}
pub type SYSTEM_SUPPORTED_PROCESSOR_ARCHITECTURES_INFORMATION =
  _SYSTEM_SUPPORTED_PROCESSOR_ARCHITECTURES_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCRUB_DATA_INPUT {
  pub Size: DWORD,
  pub Flags: DWORD,
  pub MaximumIos: DWORD,
  pub ObjectId: [DWORD; 4usize],
  pub StartingByteOffset: ULONGLONG,
  pub ByteCount: ULONGLONG,
  pub Reserved: [DWORD; 36usize],
  pub ResumeContext: [BYTE; 1040usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SCRUB_DATA_INPUT"][::std::mem::size_of::<_SCRUB_DATA_INPUT>() - 1232usize];
  ["Alignment of _SCRUB_DATA_INPUT"][::std::mem::align_of::<_SCRUB_DATA_INPUT>() - 8usize];
  ["Offset of field: _SCRUB_DATA_INPUT::Size"]
    [::std::mem::offset_of!(_SCRUB_DATA_INPUT, Size) - 0usize];
  ["Offset of field: _SCRUB_DATA_INPUT::Flags"]
    [::std::mem::offset_of!(_SCRUB_DATA_INPUT, Flags) - 4usize];
  ["Offset of field: _SCRUB_DATA_INPUT::MaximumIos"]
    [::std::mem::offset_of!(_SCRUB_DATA_INPUT, MaximumIos) - 8usize];
  ["Offset of field: _SCRUB_DATA_INPUT::ObjectId"]
    [::std::mem::offset_of!(_SCRUB_DATA_INPUT, ObjectId) - 12usize];
  ["Offset of field: _SCRUB_DATA_INPUT::StartingByteOffset"]
    [::std::mem::offset_of!(_SCRUB_DATA_INPUT, StartingByteOffset) - 32usize];
  ["Offset of field: _SCRUB_DATA_INPUT::ByteCount"]
    [::std::mem::offset_of!(_SCRUB_DATA_INPUT, ByteCount) - 40usize];
  ["Offset of field: _SCRUB_DATA_INPUT::Reserved"]
    [::std::mem::offset_of!(_SCRUB_DATA_INPUT, Reserved) - 48usize];
  ["Offset of field: _SCRUB_DATA_INPUT::ResumeContext"]
    [::std::mem::offset_of!(_SCRUB_DATA_INPUT, ResumeContext) - 192usize];
};
pub type SCRUB_DATA_INPUT = _SCRUB_DATA_INPUT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCRUB_PARITY_EXTENT {
  pub Offset: LONGLONG,
  pub Length: ULONGLONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SCRUB_PARITY_EXTENT"][::std::mem::size_of::<_SCRUB_PARITY_EXTENT>() - 16usize];
  ["Alignment of _SCRUB_PARITY_EXTENT"][::std::mem::align_of::<_SCRUB_PARITY_EXTENT>() - 8usize];
  ["Offset of field: _SCRUB_PARITY_EXTENT::Offset"]
    [::std::mem::offset_of!(_SCRUB_PARITY_EXTENT, Offset) - 0usize];
  ["Offset of field: _SCRUB_PARITY_EXTENT::Length"]
    [::std::mem::offset_of!(_SCRUB_PARITY_EXTENT, Length) - 8usize];
};
pub type SCRUB_PARITY_EXTENT = _SCRUB_PARITY_EXTENT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCRUB_PARITY_EXTENT_DATA {
  pub Size: WORD,
  pub Flags: WORD,
  pub NumberOfParityExtents: WORD,
  pub MaximumNumberOfParityExtents: WORD,
  pub ParityExtents: [SCRUB_PARITY_EXTENT; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SCRUB_PARITY_EXTENT_DATA"]
    [::std::mem::size_of::<_SCRUB_PARITY_EXTENT_DATA>() - 24usize];
  ["Alignment of _SCRUB_PARITY_EXTENT_DATA"]
    [::std::mem::align_of::<_SCRUB_PARITY_EXTENT_DATA>() - 8usize];
  ["Offset of field: _SCRUB_PARITY_EXTENT_DATA::Size"]
    [::std::mem::offset_of!(_SCRUB_PARITY_EXTENT_DATA, Size) - 0usize];
  ["Offset of field: _SCRUB_PARITY_EXTENT_DATA::Flags"]
    [::std::mem::offset_of!(_SCRUB_PARITY_EXTENT_DATA, Flags) - 2usize];
  ["Offset of field: _SCRUB_PARITY_EXTENT_DATA::NumberOfParityExtents"]
    [::std::mem::offset_of!(_SCRUB_PARITY_EXTENT_DATA, NumberOfParityExtents) - 4usize];
  ["Offset of field: _SCRUB_PARITY_EXTENT_DATA::MaximumNumberOfParityExtents"]
    [::std::mem::offset_of!(_SCRUB_PARITY_EXTENT_DATA, MaximumNumberOfParityExtents) - 6usize];
  ["Offset of field: _SCRUB_PARITY_EXTENT_DATA::ParityExtents"]
    [::std::mem::offset_of!(_SCRUB_PARITY_EXTENT_DATA, ParityExtents) - 8usize];
};
pub type SCRUB_PARITY_EXTENT_DATA = _SCRUB_PARITY_EXTENT_DATA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCRUB_DATA_OUTPUT {
  pub Size: DWORD,
  pub Flags: DWORD,
  pub Status: DWORD,
  pub ErrorFileOffset: ULONGLONG,
  pub ErrorLength: ULONGLONG,
  pub NumberOfBytesRepaired: ULONGLONG,
  pub NumberOfBytesFailed: ULONGLONG,
  pub InternalFileReference: ULONGLONG,
  pub ResumeContextLength: WORD,
  pub ParityExtentDataOffset: WORD,
  pub NextStartingByteOffset: ULONGLONG,
  pub ValidDataLength: ULONGLONG,
  pub Reserved: [DWORD; 4usize],
  pub NumberOfMetadataBytesProcessed: ULONGLONG,
  pub NumberOfDataBytesProcessed: ULONGLONG,
  pub TotalNumberOfMetadataBytesInUse: ULONGLONG,
  pub TotalNumberOfDataBytesInUse: ULONGLONG,
  pub DataBytesSkippedDueToNoAllocation: ULONGLONG,
  pub DataBytesSkippedDueToInvalidRun: ULONGLONG,
  pub DataBytesSkippedDueToIntegrityStream: ULONGLONG,
  pub DataBytesSkippedDueToRegionBeingClean: ULONGLONG,
  pub DataBytesSkippedDueToLockConflict: ULONGLONG,
  pub DataBytesSkippedDueToNoScrubDataFlag: ULONGLONG,
  pub DataBytesSkippedDueToNoScrubNonIntegrityStreamFlag: ULONGLONG,
  pub DataBytesScrubbed: ULONGLONG,
  pub ResumeContext: [BYTE; 1040usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SCRUB_DATA_OUTPUT"][::std::mem::size_of::<_SCRUB_DATA_OUTPUT>() - 1232usize];
  ["Alignment of _SCRUB_DATA_OUTPUT"][::std::mem::align_of::<_SCRUB_DATA_OUTPUT>() - 8usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::Size"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, Size) - 0usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::Flags"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, Flags) - 4usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::Status"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, Status) - 8usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::ErrorFileOffset"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, ErrorFileOffset) - 16usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::ErrorLength"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, ErrorLength) - 24usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::NumberOfBytesRepaired"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, NumberOfBytesRepaired) - 32usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::NumberOfBytesFailed"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, NumberOfBytesFailed) - 40usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::InternalFileReference"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, InternalFileReference) - 48usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::ResumeContextLength"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, ResumeContextLength) - 56usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::ParityExtentDataOffset"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, ParityExtentDataOffset) - 58usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::NextStartingByteOffset"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, NextStartingByteOffset) - 64usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::ValidDataLength"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, ValidDataLength) - 72usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::Reserved"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, Reserved) - 80usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::NumberOfMetadataBytesProcessed"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, NumberOfMetadataBytesProcessed) - 96usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::NumberOfDataBytesProcessed"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, NumberOfDataBytesProcessed) - 104usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::TotalNumberOfMetadataBytesInUse"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, TotalNumberOfMetadataBytesInUse) - 112usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::TotalNumberOfDataBytesInUse"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, TotalNumberOfDataBytesInUse) - 120usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::DataBytesSkippedDueToNoAllocation"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, DataBytesSkippedDueToNoAllocation) - 128usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::DataBytesSkippedDueToInvalidRun"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, DataBytesSkippedDueToInvalidRun) - 136usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::DataBytesSkippedDueToIntegrityStream"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, DataBytesSkippedDueToIntegrityStream) - 144usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::DataBytesSkippedDueToRegionBeingClean"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, DataBytesSkippedDueToRegionBeingClean) - 152usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::DataBytesSkippedDueToLockConflict"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, DataBytesSkippedDueToLockConflict) - 160usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::DataBytesSkippedDueToNoScrubDataFlag"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, DataBytesSkippedDueToNoScrubDataFlag) - 168usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::DataBytesSkippedDueToNoScrubNonIntegrityStreamFlag"][::std::mem::offset_of!(
    _SCRUB_DATA_OUTPUT,
    DataBytesSkippedDueToNoScrubNonIntegrityStreamFlag
  )
    - 176usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::DataBytesScrubbed"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, DataBytesScrubbed) - 184usize];
  ["Offset of field: _SCRUB_DATA_OUTPUT::ResumeContext"]
    [::std::mem::offset_of!(_SCRUB_DATA_OUTPUT, ResumeContext) - 192usize];
};
pub type SCRUB_DATA_OUTPUT = _SCRUB_DATA_OUTPUT;
pub const _SharedVirtualDiskSupportType_SharedVirtualDisksUnsupported:
  _SharedVirtualDiskSupportType = 0;
pub const _SharedVirtualDiskSupportType_SharedVirtualDisksSupported: _SharedVirtualDiskSupportType =
  1;
pub const _SharedVirtualDiskSupportType_SharedVirtualDiskSnapshotsSupported:
  _SharedVirtualDiskSupportType = 3;
pub const _SharedVirtualDiskSupportType_SharedVirtualDiskCDPSnapshotsSupported:
  _SharedVirtualDiskSupportType = 7;
pub type _SharedVirtualDiskSupportType = ::std::os::raw::c_int;
pub use self::_SharedVirtualDiskSupportType as SharedVirtualDiskSupportType;
pub const _SharedVirtualDiskHandleState_SharedVirtualDiskHandleStateNone:
  _SharedVirtualDiskHandleState = 0;
pub const _SharedVirtualDiskHandleState_SharedVirtualDiskHandleStateFileShared:
  _SharedVirtualDiskHandleState = 1;
pub const _SharedVirtualDiskHandleState_SharedVirtualDiskHandleStateHandleShared:
  _SharedVirtualDiskHandleState = 3;
pub type _SharedVirtualDiskHandleState = ::std::os::raw::c_int;
pub use self::_SharedVirtualDiskHandleState as SharedVirtualDiskHandleState;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHARED_VIRTUAL_DISK_SUPPORT {
  pub SharedVirtualDiskSupport: SharedVirtualDiskSupportType,
  pub HandleState: SharedVirtualDiskHandleState,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SHARED_VIRTUAL_DISK_SUPPORT"]
    [::std::mem::size_of::<_SHARED_VIRTUAL_DISK_SUPPORT>() - 8usize];
  ["Alignment of _SHARED_VIRTUAL_DISK_SUPPORT"]
    [::std::mem::align_of::<_SHARED_VIRTUAL_DISK_SUPPORT>() - 4usize];
  ["Offset of field: _SHARED_VIRTUAL_DISK_SUPPORT::SharedVirtualDiskSupport"]
    [::std::mem::offset_of!(_SHARED_VIRTUAL_DISK_SUPPORT, SharedVirtualDiskSupport) - 0usize];
  ["Offset of field: _SHARED_VIRTUAL_DISK_SUPPORT::HandleState"]
    [::std::mem::offset_of!(_SHARED_VIRTUAL_DISK_SUPPORT, HandleState) - 4usize];
};
pub type SHARED_VIRTUAL_DISK_SUPPORT = _SHARED_VIRTUAL_DISK_SUPPORT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHUFFLE_FILE_DATA {
  pub StartingOffset: LONGLONG,
  pub Length: LONGLONG,
  pub Flags: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SHUFFLE_FILE_DATA"][::std::mem::size_of::<_SHUFFLE_FILE_DATA>() - 24usize];
  ["Alignment of _SHUFFLE_FILE_DATA"][::std::mem::align_of::<_SHUFFLE_FILE_DATA>() - 8usize];
  ["Offset of field: _SHUFFLE_FILE_DATA::StartingOffset"]
    [::std::mem::offset_of!(_SHUFFLE_FILE_DATA, StartingOffset) - 0usize];
  ["Offset of field: _SHUFFLE_FILE_DATA::Length"]
    [::std::mem::offset_of!(_SHUFFLE_FILE_DATA, Length) - 8usize];
  ["Offset of field: _SHUFFLE_FILE_DATA::Flags"]
    [::std::mem::offset_of!(_SHUFFLE_FILE_DATA, Flags) - 16usize];
};
pub type SHUFFLE_FILE_DATA = _SHUFFLE_FILE_DATA;
pub const _SYSTEM_POWER_STATE_PowerSystemUnspecified: _SYSTEM_POWER_STATE = 0;
pub const _SYSTEM_POWER_STATE_PowerSystemWorking: _SYSTEM_POWER_STATE = 1;
pub const _SYSTEM_POWER_STATE_PowerSystemSleeping1: _SYSTEM_POWER_STATE = 2;
pub const _SYSTEM_POWER_STATE_PowerSystemSleeping2: _SYSTEM_POWER_STATE = 3;
pub const _SYSTEM_POWER_STATE_PowerSystemSleeping3: _SYSTEM_POWER_STATE = 4;
pub const _SYSTEM_POWER_STATE_PowerSystemHibernate: _SYSTEM_POWER_STATE = 5;
pub const _SYSTEM_POWER_STATE_PowerSystemShutdown: _SYSTEM_POWER_STATE = 6;
pub const _SYSTEM_POWER_STATE_PowerSystemMaximum: _SYSTEM_POWER_STATE = 7;
pub type _SYSTEM_POWER_STATE = ::std::os::raw::c_int;
pub use self::_SYSTEM_POWER_STATE as SYSTEM_POWER_STATE;
pub const POWER_ACTION_PowerActionNone: POWER_ACTION = 0;
pub const POWER_ACTION_PowerActionReserved: POWER_ACTION = 1;
pub const POWER_ACTION_PowerActionSleep: POWER_ACTION = 2;
pub const POWER_ACTION_PowerActionHibernate: POWER_ACTION = 3;
pub const POWER_ACTION_PowerActionShutdown: POWER_ACTION = 4;
pub const POWER_ACTION_PowerActionShutdownReset: POWER_ACTION = 5;
pub const POWER_ACTION_PowerActionShutdownOff: POWER_ACTION = 6;
pub const POWER_ACTION_PowerActionWarmEject: POWER_ACTION = 7;
pub const POWER_ACTION_PowerActionDisplayOff: POWER_ACTION = 8;
pub type POWER_ACTION = ::std::os::raw::c_int;
pub const SYSTEM_POWER_CONDITION_PoAc: SYSTEM_POWER_CONDITION = 0;
pub const SYSTEM_POWER_CONDITION_PoDc: SYSTEM_POWER_CONDITION = 1;
pub const SYSTEM_POWER_CONDITION_PoHot: SYSTEM_POWER_CONDITION = 2;
pub const SYSTEM_POWER_CONDITION_PoConditionMaximum: SYSTEM_POWER_CONDITION = 3;
pub type SYSTEM_POWER_CONDITION = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SET_POWER_SETTING_VALUE {
  pub Version: DWORD,
  pub Guid: GUID,
  pub PowerCondition: SYSTEM_POWER_CONDITION,
  pub DataLength: DWORD,
  pub Data: [BYTE; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of SET_POWER_SETTING_VALUE"][::std::mem::size_of::<SET_POWER_SETTING_VALUE>() - 32usize];
  ["Alignment of SET_POWER_SETTING_VALUE"]
    [::std::mem::align_of::<SET_POWER_SETTING_VALUE>() - 4usize];
  ["Offset of field: SET_POWER_SETTING_VALUE::Version"]
    [::std::mem::offset_of!(SET_POWER_SETTING_VALUE, Version) - 0usize];
  ["Offset of field: SET_POWER_SETTING_VALUE::Guid"]
    [::std::mem::offset_of!(SET_POWER_SETTING_VALUE, Guid) - 4usize];
  ["Offset of field: SET_POWER_SETTING_VALUE::PowerCondition"]
    [::std::mem::offset_of!(SET_POWER_SETTING_VALUE, PowerCondition) - 20usize];
  ["Offset of field: SET_POWER_SETTING_VALUE::DataLength"]
    [::std::mem::offset_of!(SET_POWER_SETTING_VALUE, DataLength) - 24usize];
  ["Offset of field: SET_POWER_SETTING_VALUE::Data"]
    [::std::mem::offset_of!(SET_POWER_SETTING_VALUE, Data) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BATTERY_REPORTING_SCALE {
  pub Granularity: DWORD,
  pub Capacity: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of BATTERY_REPORTING_SCALE"][::std::mem::size_of::<BATTERY_REPORTING_SCALE>() - 8usize];
  ["Alignment of BATTERY_REPORTING_SCALE"]
    [::std::mem::align_of::<BATTERY_REPORTING_SCALE>() - 4usize];
  ["Offset of field: BATTERY_REPORTING_SCALE::Granularity"]
    [::std::mem::offset_of!(BATTERY_REPORTING_SCALE, Granularity) - 0usize];
  ["Offset of field: BATTERY_REPORTING_SCALE::Capacity"]
    [::std::mem::offset_of!(BATTERY_REPORTING_SCALE, Capacity) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct POWER_ACTION_POLICY {
  pub Action: POWER_ACTION,
  pub Flags: DWORD,
  pub EventCode: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of POWER_ACTION_POLICY"][::std::mem::size_of::<POWER_ACTION_POLICY>() - 12usize];
  ["Alignment of POWER_ACTION_POLICY"][::std::mem::align_of::<POWER_ACTION_POLICY>() - 4usize];
  ["Offset of field: POWER_ACTION_POLICY::Action"]
    [::std::mem::offset_of!(POWER_ACTION_POLICY, Action) - 0usize];
  ["Offset of field: POWER_ACTION_POLICY::Flags"]
    [::std::mem::offset_of!(POWER_ACTION_POLICY, Flags) - 4usize];
  ["Offset of field: POWER_ACTION_POLICY::EventCode"]
    [::std::mem::offset_of!(POWER_ACTION_POLICY, EventCode) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SYSTEM_POWER_LEVEL {
  pub Enable: BOOLEAN,
  pub Spare: [BYTE; 3usize],
  pub BatteryLevel: DWORD,
  pub PowerPolicy: POWER_ACTION_POLICY,
  pub MinSystemState: SYSTEM_POWER_STATE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of SYSTEM_POWER_LEVEL"][::std::mem::size_of::<SYSTEM_POWER_LEVEL>() - 24usize];
  ["Alignment of SYSTEM_POWER_LEVEL"][::std::mem::align_of::<SYSTEM_POWER_LEVEL>() - 4usize];
  ["Offset of field: SYSTEM_POWER_LEVEL::Enable"]
    [::std::mem::offset_of!(SYSTEM_POWER_LEVEL, Enable) - 0usize];
  ["Offset of field: SYSTEM_POWER_LEVEL::Spare"]
    [::std::mem::offset_of!(SYSTEM_POWER_LEVEL, Spare) - 1usize];
  ["Offset of field: SYSTEM_POWER_LEVEL::BatteryLevel"]
    [::std::mem::offset_of!(SYSTEM_POWER_LEVEL, BatteryLevel) - 4usize];
  ["Offset of field: SYSTEM_POWER_LEVEL::PowerPolicy"]
    [::std::mem::offset_of!(SYSTEM_POWER_LEVEL, PowerPolicy) - 8usize];
  ["Offset of field: SYSTEM_POWER_LEVEL::MinSystemState"]
    [::std::mem::offset_of!(SYSTEM_POWER_LEVEL, MinSystemState) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_POWER_POLICY {
  pub Revision: DWORD,
  pub PowerButton: POWER_ACTION_POLICY,
  pub SleepButton: POWER_ACTION_POLICY,
  pub LidClose: POWER_ACTION_POLICY,
  pub LidOpenWake: SYSTEM_POWER_STATE,
  pub Reserved: DWORD,
  pub Idle: POWER_ACTION_POLICY,
  pub IdleTimeout: DWORD,
  pub IdleSensitivity: BYTE,
  pub DynamicThrottle: BYTE,
  pub Spare2: [BYTE; 2usize],
  pub MinSleep: SYSTEM_POWER_STATE,
  pub MaxSleep: SYSTEM_POWER_STATE,
  pub ReducedLatencySleep: SYSTEM_POWER_STATE,
  pub WinLogonFlags: DWORD,
  pub Spare3: DWORD,
  pub DozeS4Timeout: DWORD,
  pub BroadcastCapacityResolution: DWORD,
  pub DischargePolicy: [SYSTEM_POWER_LEVEL; 4usize],
  pub VideoTimeout: DWORD,
  pub VideoDimDisplay: BOOLEAN,
  pub VideoReserved: [DWORD; 3usize],
  pub SpindownTimeout: DWORD,
  pub OptimizeForPower: BOOLEAN,
  pub FanThrottleTolerance: BYTE,
  pub ForcedThrottle: BYTE,
  pub MinThrottle: BYTE,
  pub OverThrottled: POWER_ACTION_POLICY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_POWER_POLICY"][::std::mem::size_of::<_SYSTEM_POWER_POLICY>() - 232usize];
  ["Alignment of _SYSTEM_POWER_POLICY"][::std::mem::align_of::<_SYSTEM_POWER_POLICY>() - 4usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::Revision"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, Revision) - 0usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::PowerButton"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, PowerButton) - 4usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::SleepButton"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, SleepButton) - 16usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::LidClose"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, LidClose) - 28usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::LidOpenWake"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, LidOpenWake) - 40usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::Reserved"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, Reserved) - 44usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::Idle"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, Idle) - 48usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::IdleTimeout"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, IdleTimeout) - 60usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::IdleSensitivity"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, IdleSensitivity) - 64usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::DynamicThrottle"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, DynamicThrottle) - 65usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::Spare2"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, Spare2) - 66usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::MinSleep"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, MinSleep) - 68usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::MaxSleep"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, MaxSleep) - 72usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::ReducedLatencySleep"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, ReducedLatencySleep) - 76usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::WinLogonFlags"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, WinLogonFlags) - 80usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::Spare3"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, Spare3) - 84usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::DozeS4Timeout"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, DozeS4Timeout) - 88usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::BroadcastCapacityResolution"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, BroadcastCapacityResolution) - 92usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::DischargePolicy"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, DischargePolicy) - 96usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::VideoTimeout"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, VideoTimeout) - 192usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::VideoDimDisplay"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, VideoDimDisplay) - 196usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::VideoReserved"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, VideoReserved) - 200usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::SpindownTimeout"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, SpindownTimeout) - 212usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::OptimizeForPower"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, OptimizeForPower) - 216usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::FanThrottleTolerance"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, FanThrottleTolerance) - 217usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::ForcedThrottle"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, ForcedThrottle) - 218usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::MinThrottle"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, MinThrottle) - 219usize];
  ["Offset of field: _SYSTEM_POWER_POLICY::OverThrottled"]
    [::std::mem::offset_of!(_SYSTEM_POWER_POLICY, OverThrottled) - 220usize];
};
pub type SYSTEM_POWER_POLICY = _SYSTEM_POWER_POLICY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SYSTEM_POWER_CAPABILITIES {
  pub PowerButtonPresent: BOOLEAN,
  pub SleepButtonPresent: BOOLEAN,
  pub LidPresent: BOOLEAN,
  pub SystemS1: BOOLEAN,
  pub SystemS2: BOOLEAN,
  pub SystemS3: BOOLEAN,
  pub SystemS4: BOOLEAN,
  pub SystemS5: BOOLEAN,
  pub HiberFilePresent: BOOLEAN,
  pub FullWake: BOOLEAN,
  pub VideoDimPresent: BOOLEAN,
  pub ApmPresent: BOOLEAN,
  pub UpsPresent: BOOLEAN,
  pub ThermalControl: BOOLEAN,
  pub ProcessorThrottle: BOOLEAN,
  pub ProcessorMinThrottle: BYTE,
  pub ProcessorMaxThrottle: BYTE,
  pub FastSystemS4: BOOLEAN,
  pub Hiberboot: BOOLEAN,
  pub WakeAlarmPresent: BOOLEAN,
  pub AoAc: BOOLEAN,
  pub DiskSpinDown: BOOLEAN,
  pub HiberFileType: BYTE,
  pub AoAcConnectivitySupported: BOOLEAN,
  pub spare3: [BYTE; 6usize],
  pub SystemBatteriesPresent: BOOLEAN,
  pub BatteriesAreShortTerm: BOOLEAN,
  pub BatteryScale: [BATTERY_REPORTING_SCALE; 3usize],
  pub AcOnLineWake: SYSTEM_POWER_STATE,
  pub SoftLidWake: SYSTEM_POWER_STATE,
  pub RtcWake: SYSTEM_POWER_STATE,
  pub MinDeviceWakeState: SYSTEM_POWER_STATE,
  pub DefaultLowLatencyWake: SYSTEM_POWER_STATE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of SYSTEM_POWER_CAPABILITIES"]
    [::std::mem::size_of::<SYSTEM_POWER_CAPABILITIES>() - 76usize];
  ["Alignment of SYSTEM_POWER_CAPABILITIES"]
    [::std::mem::align_of::<SYSTEM_POWER_CAPABILITIES>() - 4usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::PowerButtonPresent"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, PowerButtonPresent) - 0usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::SleepButtonPresent"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, SleepButtonPresent) - 1usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::LidPresent"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, LidPresent) - 2usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::SystemS1"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, SystemS1) - 3usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::SystemS2"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, SystemS2) - 4usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::SystemS3"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, SystemS3) - 5usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::SystemS4"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, SystemS4) - 6usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::SystemS5"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, SystemS5) - 7usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::HiberFilePresent"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, HiberFilePresent) - 8usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::FullWake"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, FullWake) - 9usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::VideoDimPresent"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, VideoDimPresent) - 10usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::ApmPresent"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, ApmPresent) - 11usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::UpsPresent"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, UpsPresent) - 12usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::ThermalControl"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, ThermalControl) - 13usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::ProcessorThrottle"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, ProcessorThrottle) - 14usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::ProcessorMinThrottle"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, ProcessorMinThrottle) - 15usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::ProcessorMaxThrottle"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, ProcessorMaxThrottle) - 16usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::FastSystemS4"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, FastSystemS4) - 17usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::Hiberboot"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, Hiberboot) - 18usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::WakeAlarmPresent"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, WakeAlarmPresent) - 19usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::AoAc"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, AoAc) - 20usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::DiskSpinDown"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, DiskSpinDown) - 21usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::HiberFileType"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, HiberFileType) - 22usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::AoAcConnectivitySupported"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, AoAcConnectivitySupported) - 23usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::spare3"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, spare3) - 24usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::SystemBatteriesPresent"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, SystemBatteriesPresent) - 30usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::BatteriesAreShortTerm"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, BatteriesAreShortTerm) - 31usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::BatteryScale"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, BatteryScale) - 32usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::AcOnLineWake"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, AcOnLineWake) - 56usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::SoftLidWake"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, SoftLidWake) - 60usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::RtcWake"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, RtcWake) - 64usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::MinDeviceWakeState"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, MinDeviceWakeState) - 68usize];
  ["Offset of field: SYSTEM_POWER_CAPABILITIES::DefaultLowLatencyWake"]
    [::std::mem::offset_of!(SYSTEM_POWER_CAPABILITIES, DefaultLowLatencyWake) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SYSTEM_BATTERY_STATE {
  pub AcOnLine: BOOLEAN,
  pub BatteryPresent: BOOLEAN,
  pub Charging: BOOLEAN,
  pub Discharging: BOOLEAN,
  pub Spare1: [BOOLEAN; 3usize],
  pub Tag: BYTE,
  pub MaxCapacity: DWORD,
  pub RemainingCapacity: DWORD,
  pub Rate: DWORD,
  pub EstimatedTime: DWORD,
  pub DefaultAlert1: DWORD,
  pub DefaultAlert2: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of SYSTEM_BATTERY_STATE"][::std::mem::size_of::<SYSTEM_BATTERY_STATE>() - 32usize];
  ["Alignment of SYSTEM_BATTERY_STATE"][::std::mem::align_of::<SYSTEM_BATTERY_STATE>() - 4usize];
  ["Offset of field: SYSTEM_BATTERY_STATE::AcOnLine"]
    [::std::mem::offset_of!(SYSTEM_BATTERY_STATE, AcOnLine) - 0usize];
  ["Offset of field: SYSTEM_BATTERY_STATE::BatteryPresent"]
    [::std::mem::offset_of!(SYSTEM_BATTERY_STATE, BatteryPresent) - 1usize];
  ["Offset of field: SYSTEM_BATTERY_STATE::Charging"]
    [::std::mem::offset_of!(SYSTEM_BATTERY_STATE, Charging) - 2usize];
  ["Offset of field: SYSTEM_BATTERY_STATE::Discharging"]
    [::std::mem::offset_of!(SYSTEM_BATTERY_STATE, Discharging) - 3usize];
  ["Offset of field: SYSTEM_BATTERY_STATE::Spare1"]
    [::std::mem::offset_of!(SYSTEM_BATTERY_STATE, Spare1) - 4usize];
  ["Offset of field: SYSTEM_BATTERY_STATE::Tag"]
    [::std::mem::offset_of!(SYSTEM_BATTERY_STATE, Tag) - 7usize];
  ["Offset of field: SYSTEM_BATTERY_STATE::MaxCapacity"]
    [::std::mem::offset_of!(SYSTEM_BATTERY_STATE, MaxCapacity) - 8usize];
  ["Offset of field: SYSTEM_BATTERY_STATE::RemainingCapacity"]
    [::std::mem::offset_of!(SYSTEM_BATTERY_STATE, RemainingCapacity) - 12usize];
  ["Offset of field: SYSTEM_BATTERY_STATE::Rate"]
    [::std::mem::offset_of!(SYSTEM_BATTERY_STATE, Rate) - 16usize];
  ["Offset of field: SYSTEM_BATTERY_STATE::EstimatedTime"]
    [::std::mem::offset_of!(SYSTEM_BATTERY_STATE, EstimatedTime) - 20usize];
  ["Offset of field: SYSTEM_BATTERY_STATE::DefaultAlert1"]
    [::std::mem::offset_of!(SYSTEM_BATTERY_STATE, DefaultAlert1) - 24usize];
  ["Offset of field: SYSTEM_BATTERY_STATE::DefaultAlert2"]
    [::std::mem::offset_of!(SYSTEM_BATTERY_STATE, DefaultAlert2) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_POWER_SOURCE_STATE {
  pub BatteryState: SYSTEM_BATTERY_STATE,
  pub InstantaneousPeakPower: DWORD,
  pub InstantaneousPeakPeriod: DWORD,
  pub SustainablePeakPower: DWORD,
  pub SustainablePeakPeriod: DWORD,
  pub PeakPower: DWORD,
  pub MaxOutputPower: DWORD,
  pub MaxInputPower: DWORD,
  pub BatteryRateInCurrent: LONG,
  pub BatteryVoltage: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_POWER_SOURCE_STATE"]
    [::std::mem::size_of::<_SYSTEM_POWER_SOURCE_STATE>() - 68usize];
  ["Alignment of _SYSTEM_POWER_SOURCE_STATE"]
    [::std::mem::align_of::<_SYSTEM_POWER_SOURCE_STATE>() - 4usize];
  ["Offset of field: _SYSTEM_POWER_SOURCE_STATE::BatteryState"]
    [::std::mem::offset_of!(_SYSTEM_POWER_SOURCE_STATE, BatteryState) - 0usize];
  ["Offset of field: _SYSTEM_POWER_SOURCE_STATE::InstantaneousPeakPower"]
    [::std::mem::offset_of!(_SYSTEM_POWER_SOURCE_STATE, InstantaneousPeakPower) - 32usize];
  ["Offset of field: _SYSTEM_POWER_SOURCE_STATE::InstantaneousPeakPeriod"]
    [::std::mem::offset_of!(_SYSTEM_POWER_SOURCE_STATE, InstantaneousPeakPeriod) - 36usize];
  ["Offset of field: _SYSTEM_POWER_SOURCE_STATE::SustainablePeakPower"]
    [::std::mem::offset_of!(_SYSTEM_POWER_SOURCE_STATE, SustainablePeakPower) - 40usize];
  ["Offset of field: _SYSTEM_POWER_SOURCE_STATE::SustainablePeakPeriod"]
    [::std::mem::offset_of!(_SYSTEM_POWER_SOURCE_STATE, SustainablePeakPeriod) - 44usize];
  ["Offset of field: _SYSTEM_POWER_SOURCE_STATE::PeakPower"]
    [::std::mem::offset_of!(_SYSTEM_POWER_SOURCE_STATE, PeakPower) - 48usize];
  ["Offset of field: _SYSTEM_POWER_SOURCE_STATE::MaxOutputPower"]
    [::std::mem::offset_of!(_SYSTEM_POWER_SOURCE_STATE, MaxOutputPower) - 52usize];
  ["Offset of field: _SYSTEM_POWER_SOURCE_STATE::MaxInputPower"]
    [::std::mem::offset_of!(_SYSTEM_POWER_SOURCE_STATE, MaxInputPower) - 56usize];
  ["Offset of field: _SYSTEM_POWER_SOURCE_STATE::BatteryRateInCurrent"]
    [::std::mem::offset_of!(_SYSTEM_POWER_SOURCE_STATE, BatteryRateInCurrent) - 60usize];
  ["Offset of field: _SYSTEM_POWER_SOURCE_STATE::BatteryVoltage"]
    [::std::mem::offset_of!(_SYSTEM_POWER_SOURCE_STATE, BatteryVoltage) - 64usize];
};
pub type SYSTEM_POWER_SOURCE_STATE = _SYSTEM_POWER_SOURCE_STATE;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct _SLIST_ENTRY {
  pub Next: *mut _SLIST_ENTRY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SLIST_ENTRY"][::std::mem::size_of::<_SLIST_ENTRY>() - 16usize];
  ["Alignment of _SLIST_ENTRY"][::std::mem::align_of::<_SLIST_ENTRY>() - 16usize];
  ["Offset of field: _SLIST_ENTRY::Next"][::std::mem::offset_of!(_SLIST_ENTRY, Next) - 0usize];
};
pub type SLIST_ENTRY = _SLIST_ENTRY;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union _SLIST_HEADER {
  pub __bindgen_anon_1: _SLIST_HEADER__bindgen_ty_1,
  pub HeaderX64: _SLIST_HEADER__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SLIST_HEADER__bindgen_ty_1 {
  pub Alignment: ULONGLONG,
  pub Region: ULONGLONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SLIST_HEADER__bindgen_ty_1"]
    [::std::mem::size_of::<_SLIST_HEADER__bindgen_ty_1>() - 16usize];
  ["Alignment of _SLIST_HEADER__bindgen_ty_1"]
    [::std::mem::align_of::<_SLIST_HEADER__bindgen_ty_1>() - 8usize];
  ["Offset of field: _SLIST_HEADER__bindgen_ty_1::Alignment"]
    [::std::mem::offset_of!(_SLIST_HEADER__bindgen_ty_1, Alignment) - 0usize];
  ["Offset of field: _SLIST_HEADER__bindgen_ty_1::Region"]
    [::std::mem::offset_of!(_SLIST_HEADER__bindgen_ty_1, Region) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SLIST_HEADER__bindgen_ty_2 {
  pub _bitfield_align_1: [u64; 0],
  pub _bitfield_1: __BindgenBitfieldUnit<[u8; 16usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SLIST_HEADER__bindgen_ty_2"]
    [::std::mem::size_of::<_SLIST_HEADER__bindgen_ty_2>() - 16usize];
  ["Alignment of _SLIST_HEADER__bindgen_ty_2"]
    [::std::mem::align_of::<_SLIST_HEADER__bindgen_ty_2>() - 8usize];
};
impl _SLIST_HEADER__bindgen_ty_2 {
  #[inline]
  pub fn Depth(&self) -> ULONGLONG {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u64) }
  }
  #[inline]
  pub fn set_Depth(&mut self, val: ULONGLONG) {
    unsafe {
      let val: u64 = ::std::mem::transmute(val);
      self._bitfield_1.set(0usize, 16u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn Depth_raw(this: *const Self) -> ULONGLONG {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        0usize,
        16u8,
      ) as u64)
    }
  }
  #[inline]
  pub unsafe fn set_Depth_raw(this: *mut Self, val: ULONGLONG) {
    unsafe {
      let val: u64 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        0usize,
        16u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn Sequence(&self) -> ULONGLONG {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 48u8) as u64) }
  }
  #[inline]
  pub fn set_Sequence(&mut self, val: ULONGLONG) {
    unsafe {
      let val: u64 = ::std::mem::transmute(val);
      self._bitfield_1.set(16usize, 48u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn Sequence_raw(this: *const Self) -> ULONGLONG {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        16usize,
        48u8,
      ) as u64)
    }
  }
  #[inline]
  pub unsafe fn set_Sequence_raw(this: *mut Self, val: ULONGLONG) {
    unsafe {
      let val: u64 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        16usize,
        48u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn Reserved(&self) -> ULONGLONG {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(64usize, 4u8) as u64) }
  }
  #[inline]
  pub fn set_Reserved(&mut self, val: ULONGLONG) {
    unsafe {
      let val: u64 = ::std::mem::transmute(val);
      self._bitfield_1.set(64usize, 4u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn Reserved_raw(this: *const Self) -> ULONGLONG {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        64usize,
        4u8,
      ) as u64)
    }
  }
  #[inline]
  pub unsafe fn set_Reserved_raw(this: *mut Self, val: ULONGLONG) {
    unsafe {
      let val: u64 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        64usize,
        4u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn NextEntry(&self) -> ULONGLONG {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(68usize, 60u8) as u64) }
  }
  #[inline]
  pub fn set_NextEntry(&mut self, val: ULONGLONG) {
    unsafe {
      let val: u64 = ::std::mem::transmute(val);
      self._bitfield_1.set(68usize, 60u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn NextEntry_raw(this: *const Self) -> ULONGLONG {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 16usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        68usize,
        60u8,
      ) as u64)
    }
  }
  #[inline]
  pub unsafe fn set_NextEntry_raw(this: *mut Self, val: ULONGLONG) {
    unsafe {
      let val: u64 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 16usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        68usize,
        60u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn new_bitfield_1(
    Depth: ULONGLONG,
    Sequence: ULONGLONG,
    Reserved: ULONGLONG,
    NextEntry: ULONGLONG,
  ) -> __BindgenBitfieldUnit<[u8; 16usize]> {
    let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 16usize]> = Default::default();
    __bindgen_bitfield_unit.set(0usize, 16u8, {
      let Depth: u64 = unsafe { ::std::mem::transmute(Depth) };
      Depth as u64
    });
    __bindgen_bitfield_unit.set(16usize, 48u8, {
      let Sequence: u64 = unsafe { ::std::mem::transmute(Sequence) };
      Sequence as u64
    });
    __bindgen_bitfield_unit.set(64usize, 4u8, {
      let Reserved: u64 = unsafe { ::std::mem::transmute(Reserved) };
      Reserved as u64
    });
    __bindgen_bitfield_unit.set(68usize, 60u8, {
      let NextEntry: u64 = unsafe { ::std::mem::transmute(NextEntry) };
      NextEntry as u64
    });
    __bindgen_bitfield_unit
  }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SLIST_HEADER"][::std::mem::size_of::<_SLIST_HEADER>() - 16usize];
  ["Alignment of _SLIST_HEADER"][::std::mem::align_of::<_SLIST_HEADER>() - 16usize];
  ["Offset of field: _SLIST_HEADER::HeaderX64"]
    [::std::mem::offset_of!(_SLIST_HEADER, HeaderX64) - 0usize];
};
pub type SLIST_HEADER = _SLIST_HEADER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RTL_BARRIER {
  pub Reserved1: DWORD,
  pub Reserved2: DWORD,
  pub Reserved3: [ULONG_PTR; 2usize],
  pub Reserved4: DWORD,
  pub Reserved5: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _RTL_BARRIER"][::std::mem::size_of::<_RTL_BARRIER>() - 32usize];
  ["Alignment of _RTL_BARRIER"][::std::mem::align_of::<_RTL_BARRIER>() - 8usize];
  ["Offset of field: _RTL_BARRIER::Reserved1"]
    [::std::mem::offset_of!(_RTL_BARRIER, Reserved1) - 0usize];
  ["Offset of field: _RTL_BARRIER::Reserved2"]
    [::std::mem::offset_of!(_RTL_BARRIER, Reserved2) - 4usize];
  ["Offset of field: _RTL_BARRIER::Reserved3"]
    [::std::mem::offset_of!(_RTL_BARRIER, Reserved3) - 8usize];
  ["Offset of field: _RTL_BARRIER::Reserved4"]
    [::std::mem::offset_of!(_RTL_BARRIER, Reserved4) - 24usize];
  ["Offset of field: _RTL_BARRIER::Reserved5"]
    [::std::mem::offset_of!(_RTL_BARRIER, Reserved5) - 28usize];
};
pub type RTL_BARRIER = _RTL_BARRIER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RTL_SRWLOCK {
  pub Ptr: PVOID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _RTL_SRWLOCK"][::std::mem::size_of::<_RTL_SRWLOCK>() - 8usize];
  ["Alignment of _RTL_SRWLOCK"][::std::mem::align_of::<_RTL_SRWLOCK>() - 8usize];
  ["Offset of field: _RTL_SRWLOCK::Ptr"][::std::mem::offset_of!(_RTL_SRWLOCK, Ptr) - 0usize];
};
pub type RTL_SRWLOCK = _RTL_SRWLOCK;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SUPPORTED_OS_INFO {
  pub MajorVersion: WORD,
  pub MinorVersion: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SUPPORTED_OS_INFO"][::std::mem::size_of::<_SUPPORTED_OS_INFO>() - 4usize];
  ["Alignment of _SUPPORTED_OS_INFO"][::std::mem::align_of::<_SUPPORTED_OS_INFO>() - 2usize];
  ["Offset of field: _SUPPORTED_OS_INFO::MajorVersion"]
    [::std::mem::offset_of!(_SUPPORTED_OS_INFO, MajorVersion) - 0usize];
  ["Offset of field: _SUPPORTED_OS_INFO::MinorVersion"]
    [::std::mem::offset_of!(_SUPPORTED_OS_INFO, MinorVersion) - 2usize];
};
pub type SUPPORTED_OS_INFO = _SUPPORTED_OS_INFO;
pub const _CM_SERVICE_NODE_TYPE_DriverType: _CM_SERVICE_NODE_TYPE = 1;
pub const _CM_SERVICE_NODE_TYPE_FileSystemType: _CM_SERVICE_NODE_TYPE = 2;
pub const _CM_SERVICE_NODE_TYPE_Win32ServiceOwnProcess: _CM_SERVICE_NODE_TYPE = 16;
pub const _CM_SERVICE_NODE_TYPE_Win32ServiceShareProcess: _CM_SERVICE_NODE_TYPE = 32;
pub const _CM_SERVICE_NODE_TYPE_AdapterType: _CM_SERVICE_NODE_TYPE = 4;
pub const _CM_SERVICE_NODE_TYPE_RecognizerType: _CM_SERVICE_NODE_TYPE = 8;
pub type _CM_SERVICE_NODE_TYPE = ::std::os::raw::c_int;
pub use self::_CM_SERVICE_NODE_TYPE as SERVICE_NODE_TYPE;
pub const _CM_SERVICE_LOAD_TYPE_BootLoad: _CM_SERVICE_LOAD_TYPE = 0;
pub const _CM_SERVICE_LOAD_TYPE_SystemLoad: _CM_SERVICE_LOAD_TYPE = 1;
pub const _CM_SERVICE_LOAD_TYPE_AutoLoad: _CM_SERVICE_LOAD_TYPE = 2;
pub const _CM_SERVICE_LOAD_TYPE_DemandLoad: _CM_SERVICE_LOAD_TYPE = 3;
pub const _CM_SERVICE_LOAD_TYPE_DisableLoad: _CM_SERVICE_LOAD_TYPE = 4;
pub type _CM_SERVICE_LOAD_TYPE = ::std::os::raw::c_int;
pub use self::_CM_SERVICE_LOAD_TYPE as SERVICE_LOAD_TYPE;
pub const _CM_ERROR_CONTROL_TYPE_IgnoreError: _CM_ERROR_CONTROL_TYPE = 0;
pub const _CM_ERROR_CONTROL_TYPE_NormalError: _CM_ERROR_CONTROL_TYPE = 1;
pub const _CM_ERROR_CONTROL_TYPE_SevereError: _CM_ERROR_CONTROL_TYPE = 2;
pub const _CM_ERROR_CONTROL_TYPE_CriticalError: _CM_ERROR_CONTROL_TYPE = 3;
pub type _CM_ERROR_CONTROL_TYPE = ::std::os::raw::c_int;
pub use self::_CM_ERROR_CONTROL_TYPE as SERVICE_ERROR_TYPE;
pub type SAVEPOINT_ID = ULONG;
pub type LPARAM = LONG_PTR;
pub type LRESULT = LONG_PTR;
pub type SPHANDLE = *mut HANDLE;
pub type HGLOBAL = HANDLE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HKEY__ {
  pub unused: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of HKEY__"][::std::mem::size_of::<HKEY__>() - 4usize];
  ["Alignment of HKEY__"][::std::mem::align_of::<HKEY__>() - 4usize];
  ["Offset of field: HKEY__::unused"][::std::mem::offset_of!(HKEY__, unused) - 0usize];
};
pub type HKEY = *mut HKEY__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HINSTANCE__ {
  pub unused: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of HINSTANCE__"][::std::mem::size_of::<HINSTANCE__>() - 4usize];
  ["Alignment of HINSTANCE__"][::std::mem::align_of::<HINSTANCE__>() - 4usize];
  ["Offset of field: HINSTANCE__::unused"][::std::mem::offset_of!(HINSTANCE__, unused) - 0usize];
};
pub type HINSTANCE = *mut HINSTANCE__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FILETIME {
  pub dwLowDateTime: DWORD,
  pub dwHighDateTime: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _FILETIME"][::std::mem::size_of::<_FILETIME>() - 8usize];
  ["Alignment of _FILETIME"][::std::mem::align_of::<_FILETIME>() - 4usize];
  ["Offset of field: _FILETIME::dwLowDateTime"]
    [::std::mem::offset_of!(_FILETIME, dwLowDateTime) - 0usize];
  ["Offset of field: _FILETIME::dwHighDateTime"]
    [::std::mem::offset_of!(_FILETIME, dwHighDateTime) - 4usize];
};
pub type FILETIME = _FILETIME;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HWND__ {
  pub unused: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of HWND__"][::std::mem::size_of::<HWND__>() - 4usize];
  ["Alignment of HWND__"][::std::mem::align_of::<HWND__>() - 4usize];
  ["Offset of field: HWND__::unused"][::std::mem::offset_of!(HWND__, unused) - 0usize];
};
pub type HWND = *mut HWND__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HBITMAP__ {
  pub unused: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of HBITMAP__"][::std::mem::size_of::<HBITMAP__>() - 4usize];
  ["Alignment of HBITMAP__"][::std::mem::align_of::<HBITMAP__>() - 4usize];
  ["Offset of field: HBITMAP__::unused"][::std::mem::offset_of!(HBITMAP__, unused) - 0usize];
};
pub type HBITMAP = *mut HBITMAP__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HENHMETAFILE__ {
  pub unused: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of HENHMETAFILE__"][::std::mem::size_of::<HENHMETAFILE__>() - 4usize];
  ["Alignment of HENHMETAFILE__"][::std::mem::align_of::<HENHMETAFILE__>() - 4usize];
  ["Offset of field: HENHMETAFILE__::unused"]
    [::std::mem::offset_of!(HENHMETAFILE__, unused) - 0usize];
};
pub type HENHMETAFILE = *mut HENHMETAFILE__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HICON__ {
  pub unused: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of HICON__"][::std::mem::size_of::<HICON__>() - 4usize];
  ["Alignment of HICON__"][::std::mem::align_of::<HICON__>() - 4usize];
  ["Offset of field: HICON__::unused"][::std::mem::offset_of!(HICON__, unused) - 0usize];
};
pub type HICON = *mut HICON__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagRECT {
  pub left: LONG,
  pub top: LONG,
  pub right: LONG,
  pub bottom: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagRECT"][::std::mem::size_of::<tagRECT>() - 16usize];
  ["Alignment of tagRECT"][::std::mem::align_of::<tagRECT>() - 4usize];
  ["Offset of field: tagRECT::left"][::std::mem::offset_of!(tagRECT, left) - 0usize];
  ["Offset of field: tagRECT::top"][::std::mem::offset_of!(tagRECT, top) - 4usize];
  ["Offset of field: tagRECT::right"][::std::mem::offset_of!(tagRECT, right) - 8usize];
  ["Offset of field: tagRECT::bottom"][::std::mem::offset_of!(tagRECT, bottom) - 12usize];
};
pub type RECT = tagRECT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSIZE {
  pub cx: LONG,
  pub cy: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagSIZE"][::std::mem::size_of::<tagSIZE>() - 8usize];
  ["Alignment of tagSIZE"][::std::mem::align_of::<tagSIZE>() - 4usize];
  ["Offset of field: tagSIZE::cx"][::std::mem::offset_of!(tagSIZE, cx) - 0usize];
  ["Offset of field: tagSIZE::cy"][::std::mem::offset_of!(tagSIZE, cy) - 4usize];
};
pub type SIZE = tagSIZE;
pub type SIZEL = SIZE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_ATTRIBUTES {
  pub nLength: DWORD,
  pub lpSecurityDescriptor: LPVOID,
  pub bInheritHandle: BOOL,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SECURITY_ATTRIBUTES"][::std::mem::size_of::<_SECURITY_ATTRIBUTES>() - 24usize];
  ["Alignment of _SECURITY_ATTRIBUTES"][::std::mem::align_of::<_SECURITY_ATTRIBUTES>() - 8usize];
  ["Offset of field: _SECURITY_ATTRIBUTES::nLength"]
    [::std::mem::offset_of!(_SECURITY_ATTRIBUTES, nLength) - 0usize];
  ["Offset of field: _SECURITY_ATTRIBUTES::lpSecurityDescriptor"]
    [::std::mem::offset_of!(_SECURITY_ATTRIBUTES, lpSecurityDescriptor) - 8usize];
  ["Offset of field: _SECURITY_ATTRIBUTES::bInheritHandle"]
    [::std::mem::offset_of!(_SECURITY_ATTRIBUTES, bInheritHandle) - 16usize];
};
pub type SECURITY_ATTRIBUTES = _SECURITY_ATTRIBUTES;
pub type LPSECURITY_ATTRIBUTES = *mut _SECURITY_ATTRIBUTES;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _OVERLAPPED {
  pub Internal: ULONG_PTR,
  pub InternalHigh: ULONG_PTR,
  pub __bindgen_anon_1: _OVERLAPPED__bindgen_ty_1,
  pub hEvent: HANDLE,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _OVERLAPPED__bindgen_ty_1 {
  pub __bindgen_anon_1: _OVERLAPPED__bindgen_ty_1__bindgen_ty_1,
  pub Pointer: PVOID,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _OVERLAPPED__bindgen_ty_1__bindgen_ty_1 {
  pub Offset: DWORD,
  pub OffsetHigh: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _OVERLAPPED__bindgen_ty_1__bindgen_ty_1"]
    [::std::mem::size_of::<_OVERLAPPED__bindgen_ty_1__bindgen_ty_1>() - 8usize];
  ["Alignment of _OVERLAPPED__bindgen_ty_1__bindgen_ty_1"]
    [::std::mem::align_of::<_OVERLAPPED__bindgen_ty_1__bindgen_ty_1>() - 4usize];
  ["Offset of field: _OVERLAPPED__bindgen_ty_1__bindgen_ty_1::Offset"]
    [::std::mem::offset_of!(_OVERLAPPED__bindgen_ty_1__bindgen_ty_1, Offset) - 0usize];
  ["Offset of field: _OVERLAPPED__bindgen_ty_1__bindgen_ty_1::OffsetHigh"]
    [::std::mem::offset_of!(_OVERLAPPED__bindgen_ty_1__bindgen_ty_1, OffsetHigh) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _OVERLAPPED__bindgen_ty_1"]
    [::std::mem::size_of::<_OVERLAPPED__bindgen_ty_1>() - 8usize];
  ["Alignment of _OVERLAPPED__bindgen_ty_1"]
    [::std::mem::align_of::<_OVERLAPPED__bindgen_ty_1>() - 8usize];
  ["Offset of field: _OVERLAPPED__bindgen_ty_1::Pointer"]
    [::std::mem::offset_of!(_OVERLAPPED__bindgen_ty_1, Pointer) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _OVERLAPPED"][::std::mem::size_of::<_OVERLAPPED>() - 32usize];
  ["Alignment of _OVERLAPPED"][::std::mem::align_of::<_OVERLAPPED>() - 8usize];
  ["Offset of field: _OVERLAPPED::Internal"]
    [::std::mem::offset_of!(_OVERLAPPED, Internal) - 0usize];
  ["Offset of field: _OVERLAPPED::InternalHigh"]
    [::std::mem::offset_of!(_OVERLAPPED, InternalHigh) - 8usize];
  ["Offset of field: _OVERLAPPED::hEvent"][::std::mem::offset_of!(_OVERLAPPED, hEvent) - 24usize];
};
pub type LPOVERLAPPED = *mut _OVERLAPPED;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEMTIME {
  pub wYear: WORD,
  pub wMonth: WORD,
  pub wDayOfWeek: WORD,
  pub wDay: WORD,
  pub wHour: WORD,
  pub wMinute: WORD,
  pub wSecond: WORD,
  pub wMilliseconds: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEMTIME"][::std::mem::size_of::<_SYSTEMTIME>() - 16usize];
  ["Alignment of _SYSTEMTIME"][::std::mem::align_of::<_SYSTEMTIME>() - 2usize];
  ["Offset of field: _SYSTEMTIME::wYear"][::std::mem::offset_of!(_SYSTEMTIME, wYear) - 0usize];
  ["Offset of field: _SYSTEMTIME::wMonth"][::std::mem::offset_of!(_SYSTEMTIME, wMonth) - 2usize];
  ["Offset of field: _SYSTEMTIME::wDayOfWeek"]
    [::std::mem::offset_of!(_SYSTEMTIME, wDayOfWeek) - 4usize];
  ["Offset of field: _SYSTEMTIME::wDay"][::std::mem::offset_of!(_SYSTEMTIME, wDay) - 6usize];
  ["Offset of field: _SYSTEMTIME::wHour"][::std::mem::offset_of!(_SYSTEMTIME, wHour) - 8usize];
  ["Offset of field: _SYSTEMTIME::wMinute"][::std::mem::offset_of!(_SYSTEMTIME, wMinute) - 10usize];
  ["Offset of field: _SYSTEMTIME::wSecond"][::std::mem::offset_of!(_SYSTEMTIME, wSecond) - 12usize];
  ["Offset of field: _SYSTEMTIME::wMilliseconds"]
    [::std::mem::offset_of!(_SYSTEMTIME, wMilliseconds) - 14usize];
};
pub type SYSTEMTIME = _SYSTEMTIME;
pub const _STREAM_INFO_LEVELS_FindStreamInfoStandard: _STREAM_INFO_LEVELS = 0;
pub const _STREAM_INFO_LEVELS_FindStreamInfoMaxInfoLevel: _STREAM_INFO_LEVELS = 1;
pub type _STREAM_INFO_LEVELS = ::std::os::raw::c_int;
pub use self::_STREAM_INFO_LEVELS as STREAM_INFO_LEVELS;
pub type SRWLOCK = RTL_SRWLOCK;
pub type SYNCHRONIZATION_BARRIER = RTL_BARRIER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PROCESS_INFORMATION {
  pub hProcess: HANDLE,
  pub hThread: HANDLE,
  pub dwProcessId: DWORD,
  pub dwThreadId: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _PROCESS_INFORMATION"][::std::mem::size_of::<_PROCESS_INFORMATION>() - 24usize];
  ["Alignment of _PROCESS_INFORMATION"][::std::mem::align_of::<_PROCESS_INFORMATION>() - 8usize];
  ["Offset of field: _PROCESS_INFORMATION::hProcess"]
    [::std::mem::offset_of!(_PROCESS_INFORMATION, hProcess) - 0usize];
  ["Offset of field: _PROCESS_INFORMATION::hThread"]
    [::std::mem::offset_of!(_PROCESS_INFORMATION, hThread) - 8usize];
  ["Offset of field: _PROCESS_INFORMATION::dwProcessId"]
    [::std::mem::offset_of!(_PROCESS_INFORMATION, dwProcessId) - 16usize];
  ["Offset of field: _PROCESS_INFORMATION::dwThreadId"]
    [::std::mem::offset_of!(_PROCESS_INFORMATION, dwThreadId) - 20usize];
};
pub type LPPROCESS_INFORMATION = *mut _PROCESS_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _STARTUPINFOA {
  pub cb: DWORD,
  pub lpReserved: LPSTR,
  pub lpDesktop: LPSTR,
  pub lpTitle: LPSTR,
  pub dwX: DWORD,
  pub dwY: DWORD,
  pub dwXSize: DWORD,
  pub dwYSize: DWORD,
  pub dwXCountChars: DWORD,
  pub dwYCountChars: DWORD,
  pub dwFillAttribute: DWORD,
  pub dwFlags: DWORD,
  pub wShowWindow: WORD,
  pub cbReserved2: WORD,
  pub lpReserved2: LPBYTE,
  pub hStdInput: HANDLE,
  pub hStdOutput: HANDLE,
  pub hStdError: HANDLE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _STARTUPINFOA"][::std::mem::size_of::<_STARTUPINFOA>() - 104usize];
  ["Alignment of _STARTUPINFOA"][::std::mem::align_of::<_STARTUPINFOA>() - 8usize];
  ["Offset of field: _STARTUPINFOA::cb"][::std::mem::offset_of!(_STARTUPINFOA, cb) - 0usize];
  ["Offset of field: _STARTUPINFOA::lpReserved"]
    [::std::mem::offset_of!(_STARTUPINFOA, lpReserved) - 8usize];
  ["Offset of field: _STARTUPINFOA::lpDesktop"]
    [::std::mem::offset_of!(_STARTUPINFOA, lpDesktop) - 16usize];
  ["Offset of field: _STARTUPINFOA::lpTitle"]
    [::std::mem::offset_of!(_STARTUPINFOA, lpTitle) - 24usize];
  ["Offset of field: _STARTUPINFOA::dwX"][::std::mem::offset_of!(_STARTUPINFOA, dwX) - 32usize];
  ["Offset of field: _STARTUPINFOA::dwY"][::std::mem::offset_of!(_STARTUPINFOA, dwY) - 36usize];
  ["Offset of field: _STARTUPINFOA::dwXSize"]
    [::std::mem::offset_of!(_STARTUPINFOA, dwXSize) - 40usize];
  ["Offset of field: _STARTUPINFOA::dwYSize"]
    [::std::mem::offset_of!(_STARTUPINFOA, dwYSize) - 44usize];
  ["Offset of field: _STARTUPINFOA::dwXCountChars"]
    [::std::mem::offset_of!(_STARTUPINFOA, dwXCountChars) - 48usize];
  ["Offset of field: _STARTUPINFOA::dwYCountChars"]
    [::std::mem::offset_of!(_STARTUPINFOA, dwYCountChars) - 52usize];
  ["Offset of field: _STARTUPINFOA::dwFillAttribute"]
    [::std::mem::offset_of!(_STARTUPINFOA, dwFillAttribute) - 56usize];
  ["Offset of field: _STARTUPINFOA::dwFlags"]
    [::std::mem::offset_of!(_STARTUPINFOA, dwFlags) - 60usize];
  ["Offset of field: _STARTUPINFOA::wShowWindow"]
    [::std::mem::offset_of!(_STARTUPINFOA, wShowWindow) - 64usize];
  ["Offset of field: _STARTUPINFOA::cbReserved2"]
    [::std::mem::offset_of!(_STARTUPINFOA, cbReserved2) - 66usize];
  ["Offset of field: _STARTUPINFOA::lpReserved2"]
    [::std::mem::offset_of!(_STARTUPINFOA, lpReserved2) - 72usize];
  ["Offset of field: _STARTUPINFOA::hStdInput"]
    [::std::mem::offset_of!(_STARTUPINFOA, hStdInput) - 80usize];
  ["Offset of field: _STARTUPINFOA::hStdOutput"]
    [::std::mem::offset_of!(_STARTUPINFOA, hStdOutput) - 88usize];
  ["Offset of field: _STARTUPINFOA::hStdError"]
    [::std::mem::offset_of!(_STARTUPINFOA, hStdError) - 96usize];
};
pub type STARTUPINFOA = _STARTUPINFOA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _STARTUPINFOW {
  pub cb: DWORD,
  pub lpReserved: LPWSTR,
  pub lpDesktop: LPWSTR,
  pub lpTitle: LPWSTR,
  pub dwX: DWORD,
  pub dwY: DWORD,
  pub dwXSize: DWORD,
  pub dwYSize: DWORD,
  pub dwXCountChars: DWORD,
  pub dwYCountChars: DWORD,
  pub dwFillAttribute: DWORD,
  pub dwFlags: DWORD,
  pub wShowWindow: WORD,
  pub cbReserved2: WORD,
  pub lpReserved2: LPBYTE,
  pub hStdInput: HANDLE,
  pub hStdOutput: HANDLE,
  pub hStdError: HANDLE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _STARTUPINFOW"][::std::mem::size_of::<_STARTUPINFOW>() - 104usize];
  ["Alignment of _STARTUPINFOW"][::std::mem::align_of::<_STARTUPINFOW>() - 8usize];
  ["Offset of field: _STARTUPINFOW::cb"][::std::mem::offset_of!(_STARTUPINFOW, cb) - 0usize];
  ["Offset of field: _STARTUPINFOW::lpReserved"]
    [::std::mem::offset_of!(_STARTUPINFOW, lpReserved) - 8usize];
  ["Offset of field: _STARTUPINFOW::lpDesktop"]
    [::std::mem::offset_of!(_STARTUPINFOW, lpDesktop) - 16usize];
  ["Offset of field: _STARTUPINFOW::lpTitle"]
    [::std::mem::offset_of!(_STARTUPINFOW, lpTitle) - 24usize];
  ["Offset of field: _STARTUPINFOW::dwX"][::std::mem::offset_of!(_STARTUPINFOW, dwX) - 32usize];
  ["Offset of field: _STARTUPINFOW::dwY"][::std::mem::offset_of!(_STARTUPINFOW, dwY) - 36usize];
  ["Offset of field: _STARTUPINFOW::dwXSize"]
    [::std::mem::offset_of!(_STARTUPINFOW, dwXSize) - 40usize];
  ["Offset of field: _STARTUPINFOW::dwYSize"]
    [::std::mem::offset_of!(_STARTUPINFOW, dwYSize) - 44usize];
  ["Offset of field: _STARTUPINFOW::dwXCountChars"]
    [::std::mem::offset_of!(_STARTUPINFOW, dwXCountChars) - 48usize];
  ["Offset of field: _STARTUPINFOW::dwYCountChars"]
    [::std::mem::offset_of!(_STARTUPINFOW, dwYCountChars) - 52usize];
  ["Offset of field: _STARTUPINFOW::dwFillAttribute"]
    [::std::mem::offset_of!(_STARTUPINFOW, dwFillAttribute) - 56usize];
  ["Offset of field: _STARTUPINFOW::dwFlags"]
    [::std::mem::offset_of!(_STARTUPINFOW, dwFlags) - 60usize];
  ["Offset of field: _STARTUPINFOW::wShowWindow"]
    [::std::mem::offset_of!(_STARTUPINFOW, wShowWindow) - 64usize];
  ["Offset of field: _STARTUPINFOW::cbReserved2"]
    [::std::mem::offset_of!(_STARTUPINFOW, cbReserved2) - 66usize];
  ["Offset of field: _STARTUPINFOW::lpReserved2"]
    [::std::mem::offset_of!(_STARTUPINFOW, lpReserved2) - 72usize];
  ["Offset of field: _STARTUPINFOW::hStdInput"]
    [::std::mem::offset_of!(_STARTUPINFOW, hStdInput) - 80usize];
  ["Offset of field: _STARTUPINFOW::hStdOutput"]
    [::std::mem::offset_of!(_STARTUPINFOW, hStdOutput) - 88usize];
  ["Offset of field: _STARTUPINFOW::hStdError"]
    [::std::mem::offset_of!(_STARTUPINFOW, hStdError) - 96usize];
};
pub type STARTUPINFOW = _STARTUPINFOW;
pub type LPSTARTUPINFOW = *mut _STARTUPINFOW;
pub type STARTUPINFO = STARTUPINFOW;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PROC_THREAD_ATTRIBUTE_LIST {
  _unused: [u8; 0],
}
pub type LPPROC_THREAD_ATTRIBUTE_LIST = *mut _PROC_THREAD_ATTRIBUTE_LIST;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SYSTEM_INFO {
  pub __bindgen_anon_1: _SYSTEM_INFO__bindgen_ty_1,
  pub dwPageSize: DWORD,
  pub lpMinimumApplicationAddress: LPVOID,
  pub lpMaximumApplicationAddress: LPVOID,
  pub dwActiveProcessorMask: DWORD_PTR,
  pub dwNumberOfProcessors: DWORD,
  pub dwProcessorType: DWORD,
  pub dwAllocationGranularity: DWORD,
  pub wProcessorLevel: WORD,
  pub wProcessorRevision: WORD,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SYSTEM_INFO__bindgen_ty_1 {
  pub dwOemId: DWORD,
  pub __bindgen_anon_1: _SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1 {
  pub wProcessorArchitecture: WORD,
  pub wReserved: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1"]
    [::std::mem::size_of::<_SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1>() - 4usize];
  ["Alignment of _SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1"]
    [::std::mem::align_of::<_SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1>() - 2usize];
  ["Offset of field: _SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1::wProcessorArchitecture"][::std::mem::offset_of!(
    _SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1,
    wProcessorArchitecture
  ) - 0usize];
  ["Offset of field: _SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1::wReserved"]
    [::std::mem::offset_of!(_SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1, wReserved) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_INFO__bindgen_ty_1"]
    [::std::mem::size_of::<_SYSTEM_INFO__bindgen_ty_1>() - 4usize];
  ["Alignment of _SYSTEM_INFO__bindgen_ty_1"]
    [::std::mem::align_of::<_SYSTEM_INFO__bindgen_ty_1>() - 4usize];
  ["Offset of field: _SYSTEM_INFO__bindgen_ty_1::dwOemId"]
    [::std::mem::offset_of!(_SYSTEM_INFO__bindgen_ty_1, dwOemId) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_INFO"][::std::mem::size_of::<_SYSTEM_INFO>() - 48usize];
  ["Alignment of _SYSTEM_INFO"][::std::mem::align_of::<_SYSTEM_INFO>() - 8usize];
  ["Offset of field: _SYSTEM_INFO::dwPageSize"]
    [::std::mem::offset_of!(_SYSTEM_INFO, dwPageSize) - 4usize];
  ["Offset of field: _SYSTEM_INFO::lpMinimumApplicationAddress"]
    [::std::mem::offset_of!(_SYSTEM_INFO, lpMinimumApplicationAddress) - 8usize];
  ["Offset of field: _SYSTEM_INFO::lpMaximumApplicationAddress"]
    [::std::mem::offset_of!(_SYSTEM_INFO, lpMaximumApplicationAddress) - 16usize];
  ["Offset of field: _SYSTEM_INFO::dwActiveProcessorMask"]
    [::std::mem::offset_of!(_SYSTEM_INFO, dwActiveProcessorMask) - 24usize];
  ["Offset of field: _SYSTEM_INFO::dwNumberOfProcessors"]
    [::std::mem::offset_of!(_SYSTEM_INFO, dwNumberOfProcessors) - 32usize];
  ["Offset of field: _SYSTEM_INFO::dwProcessorType"]
    [::std::mem::offset_of!(_SYSTEM_INFO, dwProcessorType) - 36usize];
  ["Offset of field: _SYSTEM_INFO::dwAllocationGranularity"]
    [::std::mem::offset_of!(_SYSTEM_INFO, dwAllocationGranularity) - 40usize];
  ["Offset of field: _SYSTEM_INFO::wProcessorLevel"]
    [::std::mem::offset_of!(_SYSTEM_INFO, wProcessorLevel) - 44usize];
  ["Offset of field: _SYSTEM_INFO::wProcessorRevision"]
    [::std::mem::offset_of!(_SYSTEM_INFO, wProcessorRevision) - 46usize];
};
pub type SYSTEM_INFO = _SYSTEM_INFO;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _STARTUPINFOEXA {
  pub StartupInfo: STARTUPINFOA,
  pub lpAttributeList: LPPROC_THREAD_ATTRIBUTE_LIST,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _STARTUPINFOEXA"][::std::mem::size_of::<_STARTUPINFOEXA>() - 112usize];
  ["Alignment of _STARTUPINFOEXA"][::std::mem::align_of::<_STARTUPINFOEXA>() - 8usize];
  ["Offset of field: _STARTUPINFOEXA::StartupInfo"]
    [::std::mem::offset_of!(_STARTUPINFOEXA, StartupInfo) - 0usize];
  ["Offset of field: _STARTUPINFOEXA::lpAttributeList"]
    [::std::mem::offset_of!(_STARTUPINFOEXA, lpAttributeList) - 104usize];
};
pub type STARTUPINFOEXA = _STARTUPINFOEXA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _STARTUPINFOEXW {
  pub StartupInfo: STARTUPINFOW,
  pub lpAttributeList: LPPROC_THREAD_ATTRIBUTE_LIST,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _STARTUPINFOEXW"][::std::mem::size_of::<_STARTUPINFOEXW>() - 112usize];
  ["Alignment of _STARTUPINFOEXW"][::std::mem::align_of::<_STARTUPINFOEXW>() - 8usize];
  ["Offset of field: _STARTUPINFOEXW::StartupInfo"]
    [::std::mem::offset_of!(_STARTUPINFOEXW, StartupInfo) - 0usize];
  ["Offset of field: _STARTUPINFOEXW::lpAttributeList"]
    [::std::mem::offset_of!(_STARTUPINFOEXW, lpAttributeList) - 104usize];
};
pub type STARTUPINFOEXW = _STARTUPINFOEXW;
pub type STARTUPINFOEX = STARTUPINFOEXW;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_POWER_STATUS {
  pub ACLineStatus: BYTE,
  pub BatteryFlag: BYTE,
  pub BatteryLifePercent: BYTE,
  pub SystemStatusFlag: BYTE,
  pub BatteryLifeTime: DWORD,
  pub BatteryFullLifeTime: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SYSTEM_POWER_STATUS"][::std::mem::size_of::<_SYSTEM_POWER_STATUS>() - 12usize];
  ["Alignment of _SYSTEM_POWER_STATUS"][::std::mem::align_of::<_SYSTEM_POWER_STATUS>() - 4usize];
  ["Offset of field: _SYSTEM_POWER_STATUS::ACLineStatus"]
    [::std::mem::offset_of!(_SYSTEM_POWER_STATUS, ACLineStatus) - 0usize];
  ["Offset of field: _SYSTEM_POWER_STATUS::BatteryFlag"]
    [::std::mem::offset_of!(_SYSTEM_POWER_STATUS, BatteryFlag) - 1usize];
  ["Offset of field: _SYSTEM_POWER_STATUS::BatteryLifePercent"]
    [::std::mem::offset_of!(_SYSTEM_POWER_STATUS, BatteryLifePercent) - 2usize];
  ["Offset of field: _SYSTEM_POWER_STATUS::SystemStatusFlag"]
    [::std::mem::offset_of!(_SYSTEM_POWER_STATUS, SystemStatusFlag) - 3usize];
  ["Offset of field: _SYSTEM_POWER_STATUS::BatteryLifeTime"]
    [::std::mem::offset_of!(_SYSTEM_POWER_STATUS, BatteryLifeTime) - 4usize];
  ["Offset of field: _SYSTEM_POWER_STATUS::BatteryFullLifeTime"]
    [::std::mem::offset_of!(_SYSTEM_POWER_STATUS, BatteryFullLifeTime) - 8usize];
};
pub type SYSTEM_POWER_STATUS = _SYSTEM_POWER_STATUS;
pub type SENDASYNCPROC = ::std::option::Option<
  unsafe extern "C" fn(arg1: HWND, arg2: UINT, arg3: ULONG_PTR, arg4: LRESULT),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SHELLHOOKINFO {
  pub hwnd: HWND,
  pub rc: RECT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of SHELLHOOKINFO"][::std::mem::size_of::<SHELLHOOKINFO>() - 24usize];
  ["Alignment of SHELLHOOKINFO"][::std::mem::align_of::<SHELLHOOKINFO>() - 8usize];
  ["Offset of field: SHELLHOOKINFO::hwnd"][::std::mem::offset_of!(SHELLHOOKINFO, hwnd) - 0usize];
  ["Offset of field: SHELLHOOKINFO::rc"][::std::mem::offset_of!(SHELLHOOKINFO, rc) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSTYLESTRUCT {
  pub styleOld: DWORD,
  pub styleNew: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagSTYLESTRUCT"][::std::mem::size_of::<tagSTYLESTRUCT>() - 8usize];
  ["Alignment of tagSTYLESTRUCT"][::std::mem::align_of::<tagSTYLESTRUCT>() - 4usize];
  ["Offset of field: tagSTYLESTRUCT::styleOld"]
    [::std::mem::offset_of!(tagSTYLESTRUCT, styleOld) - 0usize];
  ["Offset of field: tagSTYLESTRUCT::styleNew"]
    [::std::mem::offset_of!(tagSTYLESTRUCT, styleNew) - 4usize];
};
pub type STYLESTRUCT = tagSTYLESTRUCT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSCROLLINFO {
  pub cbSize: UINT,
  pub fMask: UINT,
  pub nMin: ::std::os::raw::c_int,
  pub nMax: ::std::os::raw::c_int,
  pub nPage: UINT,
  pub nPos: ::std::os::raw::c_int,
  pub nTrackPos: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagSCROLLINFO"][::std::mem::size_of::<tagSCROLLINFO>() - 28usize];
  ["Alignment of tagSCROLLINFO"][::std::mem::align_of::<tagSCROLLINFO>() - 4usize];
  ["Offset of field: tagSCROLLINFO::cbSize"]
    [::std::mem::offset_of!(tagSCROLLINFO, cbSize) - 0usize];
  ["Offset of field: tagSCROLLINFO::fMask"][::std::mem::offset_of!(tagSCROLLINFO, fMask) - 4usize];
  ["Offset of field: tagSCROLLINFO::nMin"][::std::mem::offset_of!(tagSCROLLINFO, nMin) - 8usize];
  ["Offset of field: tagSCROLLINFO::nMax"][::std::mem::offset_of!(tagSCROLLINFO, nMax) - 12usize];
  ["Offset of field: tagSCROLLINFO::nPage"][::std::mem::offset_of!(tagSCROLLINFO, nPage) - 16usize];
  ["Offset of field: tagSCROLLINFO::nPos"][::std::mem::offset_of!(tagSCROLLINFO, nPos) - 20usize];
  ["Offset of field: tagSCROLLINFO::nTrackPos"]
    [::std::mem::offset_of!(tagSCROLLINFO, nTrackPos) - 24usize];
};
pub type SCROLLINFO = tagSCROLLINFO;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSERIALKEYSA {
  pub cbSize: UINT,
  pub dwFlags: DWORD,
  pub lpszActivePort: LPSTR,
  pub lpszPort: LPSTR,
  pub iBaudRate: UINT,
  pub iPortState: UINT,
  pub iActive: UINT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagSERIALKEYSA"][::std::mem::size_of::<tagSERIALKEYSA>() - 40usize];
  ["Alignment of tagSERIALKEYSA"][::std::mem::align_of::<tagSERIALKEYSA>() - 8usize];
  ["Offset of field: tagSERIALKEYSA::cbSize"]
    [::std::mem::offset_of!(tagSERIALKEYSA, cbSize) - 0usize];
  ["Offset of field: tagSERIALKEYSA::dwFlags"]
    [::std::mem::offset_of!(tagSERIALKEYSA, dwFlags) - 4usize];
  ["Offset of field: tagSERIALKEYSA::lpszActivePort"]
    [::std::mem::offset_of!(tagSERIALKEYSA, lpszActivePort) - 8usize];
  ["Offset of field: tagSERIALKEYSA::lpszPort"]
    [::std::mem::offset_of!(tagSERIALKEYSA, lpszPort) - 16usize];
  ["Offset of field: tagSERIALKEYSA::iBaudRate"]
    [::std::mem::offset_of!(tagSERIALKEYSA, iBaudRate) - 24usize];
  ["Offset of field: tagSERIALKEYSA::iPortState"]
    [::std::mem::offset_of!(tagSERIALKEYSA, iPortState) - 28usize];
  ["Offset of field: tagSERIALKEYSA::iActive"]
    [::std::mem::offset_of!(tagSERIALKEYSA, iActive) - 32usize];
};
pub type SERIALKEYSA = tagSERIALKEYSA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSERIALKEYSW {
  pub cbSize: UINT,
  pub dwFlags: DWORD,
  pub lpszActivePort: LPWSTR,
  pub lpszPort: LPWSTR,
  pub iBaudRate: UINT,
  pub iPortState: UINT,
  pub iActive: UINT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagSERIALKEYSW"][::std::mem::size_of::<tagSERIALKEYSW>() - 40usize];
  ["Alignment of tagSERIALKEYSW"][::std::mem::align_of::<tagSERIALKEYSW>() - 8usize];
  ["Offset of field: tagSERIALKEYSW::cbSize"]
    [::std::mem::offset_of!(tagSERIALKEYSW, cbSize) - 0usize];
  ["Offset of field: tagSERIALKEYSW::dwFlags"]
    [::std::mem::offset_of!(tagSERIALKEYSW, dwFlags) - 4usize];
  ["Offset of field: tagSERIALKEYSW::lpszActivePort"]
    [::std::mem::offset_of!(tagSERIALKEYSW, lpszActivePort) - 8usize];
  ["Offset of field: tagSERIALKEYSW::lpszPort"]
    [::std::mem::offset_of!(tagSERIALKEYSW, lpszPort) - 16usize];
  ["Offset of field: tagSERIALKEYSW::iBaudRate"]
    [::std::mem::offset_of!(tagSERIALKEYSW, iBaudRate) - 24usize];
  ["Offset of field: tagSERIALKEYSW::iPortState"]
    [::std::mem::offset_of!(tagSERIALKEYSW, iPortState) - 28usize];
  ["Offset of field: tagSERIALKEYSW::iActive"]
    [::std::mem::offset_of!(tagSERIALKEYSW, iActive) - 32usize];
};
pub type SERIALKEYSW = tagSERIALKEYSW;
pub type SERIALKEYS = SERIALKEYSW;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSTICKYKEYS {
  pub cbSize: UINT,
  pub dwFlags: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagSTICKYKEYS"][::std::mem::size_of::<tagSTICKYKEYS>() - 8usize];
  ["Alignment of tagSTICKYKEYS"][::std::mem::align_of::<tagSTICKYKEYS>() - 4usize];
  ["Offset of field: tagSTICKYKEYS::cbSize"]
    [::std::mem::offset_of!(tagSTICKYKEYS, cbSize) - 0usize];
  ["Offset of field: tagSTICKYKEYS::dwFlags"]
    [::std::mem::offset_of!(tagSTICKYKEYS, dwFlags) - 4usize];
};
pub type STICKYKEYS = tagSTICKYKEYS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSOUNDSENTRYA {
  pub cbSize: UINT,
  pub dwFlags: DWORD,
  pub iFSTextEffect: DWORD,
  pub iFSTextEffectMSec: DWORD,
  pub iFSTextEffectColorBits: DWORD,
  pub iFSGrafEffect: DWORD,
  pub iFSGrafEffectMSec: DWORD,
  pub iFSGrafEffectColor: DWORD,
  pub iWindowsEffect: DWORD,
  pub iWindowsEffectMSec: DWORD,
  pub lpszWindowsEffectDLL: LPSTR,
  pub iWindowsEffectOrdinal: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagSOUNDSENTRYA"][::std::mem::size_of::<tagSOUNDSENTRYA>() - 56usize];
  ["Alignment of tagSOUNDSENTRYA"][::std::mem::align_of::<tagSOUNDSENTRYA>() - 8usize];
  ["Offset of field: tagSOUNDSENTRYA::cbSize"]
    [::std::mem::offset_of!(tagSOUNDSENTRYA, cbSize) - 0usize];
  ["Offset of field: tagSOUNDSENTRYA::dwFlags"]
    [::std::mem::offset_of!(tagSOUNDSENTRYA, dwFlags) - 4usize];
  ["Offset of field: tagSOUNDSENTRYA::iFSTextEffect"]
    [::std::mem::offset_of!(tagSOUNDSENTRYA, iFSTextEffect) - 8usize];
  ["Offset of field: tagSOUNDSENTRYA::iFSTextEffectMSec"]
    [::std::mem::offset_of!(tagSOUNDSENTRYA, iFSTextEffectMSec) - 12usize];
  ["Offset of field: tagSOUNDSENTRYA::iFSTextEffectColorBits"]
    [::std::mem::offset_of!(tagSOUNDSENTRYA, iFSTextEffectColorBits) - 16usize];
  ["Offset of field: tagSOUNDSENTRYA::iFSGrafEffect"]
    [::std::mem::offset_of!(tagSOUNDSENTRYA, iFSGrafEffect) - 20usize];
  ["Offset of field: tagSOUNDSENTRYA::iFSGrafEffectMSec"]
    [::std::mem::offset_of!(tagSOUNDSENTRYA, iFSGrafEffectMSec) - 24usize];
  ["Offset of field: tagSOUNDSENTRYA::iFSGrafEffectColor"]
    [::std::mem::offset_of!(tagSOUNDSENTRYA, iFSGrafEffectColor) - 28usize];
  ["Offset of field: tagSOUNDSENTRYA::iWindowsEffect"]
    [::std::mem::offset_of!(tagSOUNDSENTRYA, iWindowsEffect) - 32usize];
  ["Offset of field: tagSOUNDSENTRYA::iWindowsEffectMSec"]
    [::std::mem::offset_of!(tagSOUNDSENTRYA, iWindowsEffectMSec) - 36usize];
  ["Offset of field: tagSOUNDSENTRYA::lpszWindowsEffectDLL"]
    [::std::mem::offset_of!(tagSOUNDSENTRYA, lpszWindowsEffectDLL) - 40usize];
  ["Offset of field: tagSOUNDSENTRYA::iWindowsEffectOrdinal"]
    [::std::mem::offset_of!(tagSOUNDSENTRYA, iWindowsEffectOrdinal) - 48usize];
};
pub type SOUNDSENTRYA = tagSOUNDSENTRYA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSOUNDSENTRYW {
  pub cbSize: UINT,
  pub dwFlags: DWORD,
  pub iFSTextEffect: DWORD,
  pub iFSTextEffectMSec: DWORD,
  pub iFSTextEffectColorBits: DWORD,
  pub iFSGrafEffect: DWORD,
  pub iFSGrafEffectMSec: DWORD,
  pub iFSGrafEffectColor: DWORD,
  pub iWindowsEffect: DWORD,
  pub iWindowsEffectMSec: DWORD,
  pub lpszWindowsEffectDLL: LPWSTR,
  pub iWindowsEffectOrdinal: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagSOUNDSENTRYW"][::std::mem::size_of::<tagSOUNDSENTRYW>() - 56usize];
  ["Alignment of tagSOUNDSENTRYW"][::std::mem::align_of::<tagSOUNDSENTRYW>() - 8usize];
  ["Offset of field: tagSOUNDSENTRYW::cbSize"]
    [::std::mem::offset_of!(tagSOUNDSENTRYW, cbSize) - 0usize];
  ["Offset of field: tagSOUNDSENTRYW::dwFlags"]
    [::std::mem::offset_of!(tagSOUNDSENTRYW, dwFlags) - 4usize];
  ["Offset of field: tagSOUNDSENTRYW::iFSTextEffect"]
    [::std::mem::offset_of!(tagSOUNDSENTRYW, iFSTextEffect) - 8usize];
  ["Offset of field: tagSOUNDSENTRYW::iFSTextEffectMSec"]
    [::std::mem::offset_of!(tagSOUNDSENTRYW, iFSTextEffectMSec) - 12usize];
  ["Offset of field: tagSOUNDSENTRYW::iFSTextEffectColorBits"]
    [::std::mem::offset_of!(tagSOUNDSENTRYW, iFSTextEffectColorBits) - 16usize];
  ["Offset of field: tagSOUNDSENTRYW::iFSGrafEffect"]
    [::std::mem::offset_of!(tagSOUNDSENTRYW, iFSGrafEffect) - 20usize];
  ["Offset of field: tagSOUNDSENTRYW::iFSGrafEffectMSec"]
    [::std::mem::offset_of!(tagSOUNDSENTRYW, iFSGrafEffectMSec) - 24usize];
  ["Offset of field: tagSOUNDSENTRYW::iFSGrafEffectColor"]
    [::std::mem::offset_of!(tagSOUNDSENTRYW, iFSGrafEffectColor) - 28usize];
  ["Offset of field: tagSOUNDSENTRYW::iWindowsEffect"]
    [::std::mem::offset_of!(tagSOUNDSENTRYW, iWindowsEffect) - 32usize];
  ["Offset of field: tagSOUNDSENTRYW::iWindowsEffectMSec"]
    [::std::mem::offset_of!(tagSOUNDSENTRYW, iWindowsEffectMSec) - 36usize];
  ["Offset of field: tagSOUNDSENTRYW::lpszWindowsEffectDLL"]
    [::std::mem::offset_of!(tagSOUNDSENTRYW, lpszWindowsEffectDLL) - 40usize];
  ["Offset of field: tagSOUNDSENTRYW::iWindowsEffectOrdinal"]
    [::std::mem::offset_of!(tagSOUNDSENTRYW, iWindowsEffectOrdinal) - 48usize];
};
pub type SOUNDSENTRYW = tagSOUNDSENTRYW;
pub type SOUNDSENTRY = SOUNDSENTRYW;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSCROLLBARINFO {
  pub cbSize: DWORD,
  pub rcScrollBar: RECT,
  pub dxyLineButton: ::std::os::raw::c_int,
  pub xyThumbTop: ::std::os::raw::c_int,
  pub xyThumbBottom: ::std::os::raw::c_int,
  pub reserved: ::std::os::raw::c_int,
  pub rgstate: [DWORD; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagSCROLLBARINFO"][::std::mem::size_of::<tagSCROLLBARINFO>() - 60usize];
  ["Alignment of tagSCROLLBARINFO"][::std::mem::align_of::<tagSCROLLBARINFO>() - 4usize];
  ["Offset of field: tagSCROLLBARINFO::cbSize"]
    [::std::mem::offset_of!(tagSCROLLBARINFO, cbSize) - 0usize];
  ["Offset of field: tagSCROLLBARINFO::rcScrollBar"]
    [::std::mem::offset_of!(tagSCROLLBARINFO, rcScrollBar) - 4usize];
  ["Offset of field: tagSCROLLBARINFO::dxyLineButton"]
    [::std::mem::offset_of!(tagSCROLLBARINFO, dxyLineButton) - 20usize];
  ["Offset of field: tagSCROLLBARINFO::xyThumbTop"]
    [::std::mem::offset_of!(tagSCROLLBARINFO, xyThumbTop) - 24usize];
  ["Offset of field: tagSCROLLBARINFO::xyThumbBottom"]
    [::std::mem::offset_of!(tagSCROLLBARINFO, xyThumbBottom) - 28usize];
  ["Offset of field: tagSCROLLBARINFO::reserved"]
    [::std::mem::offset_of!(tagSCROLLBARINFO, reserved) - 32usize];
  ["Offset of field: tagSCROLLBARINFO::rgstate"]
    [::std::mem::offset_of!(tagSCROLLBARINFO, rgstate) - 36usize];
};
pub type SCROLLBARINFO = tagSCROLLBARINFO;
pub const SYSNLS_FUNCTION_COMPARE_STRING: SYSNLS_FUNCTION = 1;
pub type SYSNLS_FUNCTION = ::std::os::raw::c_int;
pub const SYSGEOTYPE_GEO_NATION: SYSGEOTYPE = 1;
pub const SYSGEOTYPE_GEO_LATITUDE: SYSGEOTYPE = 2;
pub const SYSGEOTYPE_GEO_LONGITUDE: SYSGEOTYPE = 3;
pub const SYSGEOTYPE_GEO_ISO2: SYSGEOTYPE = 4;
pub const SYSGEOTYPE_GEO_ISO3: SYSGEOTYPE = 5;
pub const SYSGEOTYPE_GEO_RFC1766: SYSGEOTYPE = 6;
pub const SYSGEOTYPE_GEO_LCID: SYSGEOTYPE = 7;
pub const SYSGEOTYPE_GEO_FRIENDLYNAME: SYSGEOTYPE = 8;
pub const SYSGEOTYPE_GEO_OFFICIALNAME: SYSGEOTYPE = 9;
pub const SYSGEOTYPE_GEO_TIMEZONES: SYSGEOTYPE = 10;
pub const SYSGEOTYPE_GEO_OFFICIALLANGUAGES: SYSGEOTYPE = 11;
pub const SYSGEOTYPE_GEO_ISO_UN_NUMBER: SYSGEOTYPE = 12;
pub const SYSGEOTYPE_GEO_PARENT: SYSGEOTYPE = 13;
pub const SYSGEOTYPE_GEO_DIALINGCODE: SYSGEOTYPE = 14;
pub const SYSGEOTYPE_GEO_CURRENCYCODE: SYSGEOTYPE = 15;
pub const SYSGEOTYPE_GEO_CURRENCYSYMBOL: SYSGEOTYPE = 16;
pub const SYSGEOTYPE_GEO_NAME: SYSGEOTYPE = 17;
pub const SYSGEOTYPE_GEO_ID: SYSGEOTYPE = 18;
pub type SYSGEOTYPE = ::std::os::raw::c_int;
pub const SYSGEOCLASS_GEOCLASS_NATION: SYSGEOCLASS = 16;
pub const SYSGEOCLASS_GEOCLASS_REGION: SYSGEOCLASS = 14;
pub const SYSGEOCLASS_GEOCLASS_ALL: SYSGEOCLASS = 0;
pub type SYSGEOCLASS = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SMALL_RECT {
  pub Left: SHORT,
  pub Top: SHORT,
  pub Right: SHORT,
  pub Bottom: SHORT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SMALL_RECT"][::std::mem::size_of::<_SMALL_RECT>() - 8usize];
  ["Alignment of _SMALL_RECT"][::std::mem::align_of::<_SMALL_RECT>() - 2usize];
  ["Offset of field: _SMALL_RECT::Left"][::std::mem::offset_of!(_SMALL_RECT, Left) - 0usize];
  ["Offset of field: _SMALL_RECT::Top"][::std::mem::offset_of!(_SMALL_RECT, Top) - 2usize];
  ["Offset of field: _SMALL_RECT::Right"][::std::mem::offset_of!(_SMALL_RECT, Right) - 4usize];
  ["Offset of field: _SMALL_RECT::Bottom"][::std::mem::offset_of!(_SMALL_RECT, Bottom) - 6usize];
};
pub type SMALL_RECT = _SMALL_RECT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SESSION_HEADER {
  pub sess_name: UCHAR,
  pub num_sess: UCHAR,
  pub rcv_dg_outstanding: UCHAR,
  pub rcv_any_outstanding: UCHAR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SESSION_HEADER"][::std::mem::size_of::<_SESSION_HEADER>() - 4usize];
  ["Alignment of _SESSION_HEADER"][::std::mem::align_of::<_SESSION_HEADER>() - 1usize];
  ["Offset of field: _SESSION_HEADER::sess_name"]
    [::std::mem::offset_of!(_SESSION_HEADER, sess_name) - 0usize];
  ["Offset of field: _SESSION_HEADER::num_sess"]
    [::std::mem::offset_of!(_SESSION_HEADER, num_sess) - 1usize];
  ["Offset of field: _SESSION_HEADER::rcv_dg_outstanding"]
    [::std::mem::offset_of!(_SESSION_HEADER, rcv_dg_outstanding) - 2usize];
  ["Offset of field: _SESSION_HEADER::rcv_any_outstanding"]
    [::std::mem::offset_of!(_SESSION_HEADER, rcv_any_outstanding) - 3usize];
};
pub type SESSION_HEADER = _SESSION_HEADER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SESSION_BUFFER {
  pub lsn: UCHAR,
  pub state: UCHAR,
  pub local_name: [UCHAR; 16usize],
  pub remote_name: [UCHAR; 16usize],
  pub rcvs_outstanding: UCHAR,
  pub sends_outstanding: UCHAR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SESSION_BUFFER"][::std::mem::size_of::<_SESSION_BUFFER>() - 36usize];
  ["Alignment of _SESSION_BUFFER"][::std::mem::align_of::<_SESSION_BUFFER>() - 1usize];
  ["Offset of field: _SESSION_BUFFER::lsn"][::std::mem::offset_of!(_SESSION_BUFFER, lsn) - 0usize];
  ["Offset of field: _SESSION_BUFFER::state"]
    [::std::mem::offset_of!(_SESSION_BUFFER, state) - 1usize];
  ["Offset of field: _SESSION_BUFFER::local_name"]
    [::std::mem::offset_of!(_SESSION_BUFFER, local_name) - 2usize];
  ["Offset of field: _SESSION_BUFFER::remote_name"]
    [::std::mem::offset_of!(_SESSION_BUFFER, remote_name) - 18usize];
  ["Offset of field: _SESSION_BUFFER::rcvs_outstanding"]
    [::std::mem::offset_of!(_SESSION_BUFFER, rcvs_outstanding) - 34usize];
  ["Offset of field: _SESSION_BUFFER::sends_outstanding"]
    [::std::mem::offset_of!(_SESSION_BUFFER, sends_outstanding) - 35usize];
};
pub type SESSION_BUFFER = _SESSION_BUFFER;
pub type I_RPC_HANDLE = *mut ::std::os::raw::c_void;
pub type RPC_BINDING_HANDLE = I_RPC_HANDLE;
pub type handle_t = RPC_BINDING_HANDLE;
pub type UUID = GUID;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SEC_WINNT_AUTH_IDENTITY_W {
  pub User: *mut ::std::os::raw::c_ushort,
  pub UserLength: ::std::os::raw::c_ulong,
  pub Domain: *mut ::std::os::raw::c_ushort,
  pub DomainLength: ::std::os::raw::c_ulong,
  pub Password: *mut ::std::os::raw::c_ushort,
  pub PasswordLength: ::std::os::raw::c_ulong,
  pub Flags: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SEC_WINNT_AUTH_IDENTITY_W"]
    [::std::mem::size_of::<_SEC_WINNT_AUTH_IDENTITY_W>() - 48usize];
  ["Alignment of _SEC_WINNT_AUTH_IDENTITY_W"]
    [::std::mem::align_of::<_SEC_WINNT_AUTH_IDENTITY_W>() - 8usize];
  ["Offset of field: _SEC_WINNT_AUTH_IDENTITY_W::User"]
    [::std::mem::offset_of!(_SEC_WINNT_AUTH_IDENTITY_W, User) - 0usize];
  ["Offset of field: _SEC_WINNT_AUTH_IDENTITY_W::UserLength"]
    [::std::mem::offset_of!(_SEC_WINNT_AUTH_IDENTITY_W, UserLength) - 8usize];
  ["Offset of field: _SEC_WINNT_AUTH_IDENTITY_W::Domain"]
    [::std::mem::offset_of!(_SEC_WINNT_AUTH_IDENTITY_W, Domain) - 16usize];
  ["Offset of field: _SEC_WINNT_AUTH_IDENTITY_W::DomainLength"]
    [::std::mem::offset_of!(_SEC_WINNT_AUTH_IDENTITY_W, DomainLength) - 24usize];
  ["Offset of field: _SEC_WINNT_AUTH_IDENTITY_W::Password"]
    [::std::mem::offset_of!(_SEC_WINNT_AUTH_IDENTITY_W, Password) - 32usize];
  ["Offset of field: _SEC_WINNT_AUTH_IDENTITY_W::PasswordLength"]
    [::std::mem::offset_of!(_SEC_WINNT_AUTH_IDENTITY_W, PasswordLength) - 40usize];
  ["Offset of field: _SEC_WINNT_AUTH_IDENTITY_W::Flags"]
    [::std::mem::offset_of!(_SEC_WINNT_AUTH_IDENTITY_W, Flags) - 44usize];
};
pub type SEC_WINNT_AUTH_IDENTITY_W = _SEC_WINNT_AUTH_IDENTITY_W;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SEC_WINNT_AUTH_IDENTITY_A {
  pub User: *mut ::std::os::raw::c_uchar,
  pub UserLength: ::std::os::raw::c_ulong,
  pub Domain: *mut ::std::os::raw::c_uchar,
  pub DomainLength: ::std::os::raw::c_ulong,
  pub Password: *mut ::std::os::raw::c_uchar,
  pub PasswordLength: ::std::os::raw::c_ulong,
  pub Flags: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SEC_WINNT_AUTH_IDENTITY_A"]
    [::std::mem::size_of::<_SEC_WINNT_AUTH_IDENTITY_A>() - 48usize];
  ["Alignment of _SEC_WINNT_AUTH_IDENTITY_A"]
    [::std::mem::align_of::<_SEC_WINNT_AUTH_IDENTITY_A>() - 8usize];
  ["Offset of field: _SEC_WINNT_AUTH_IDENTITY_A::User"]
    [::std::mem::offset_of!(_SEC_WINNT_AUTH_IDENTITY_A, User) - 0usize];
  ["Offset of field: _SEC_WINNT_AUTH_IDENTITY_A::UserLength"]
    [::std::mem::offset_of!(_SEC_WINNT_AUTH_IDENTITY_A, UserLength) - 8usize];
  ["Offset of field: _SEC_WINNT_AUTH_IDENTITY_A::Domain"]
    [::std::mem::offset_of!(_SEC_WINNT_AUTH_IDENTITY_A, Domain) - 16usize];
  ["Offset of field: _SEC_WINNT_AUTH_IDENTITY_A::DomainLength"]
    [::std::mem::offset_of!(_SEC_WINNT_AUTH_IDENTITY_A, DomainLength) - 24usize];
  ["Offset of field: _SEC_WINNT_AUTH_IDENTITY_A::Password"]
    [::std::mem::offset_of!(_SEC_WINNT_AUTH_IDENTITY_A, Password) - 32usize];
  ["Offset of field: _SEC_WINNT_AUTH_IDENTITY_A::PasswordLength"]
    [::std::mem::offset_of!(_SEC_WINNT_AUTH_IDENTITY_A, PasswordLength) - 40usize];
  ["Offset of field: _SEC_WINNT_AUTH_IDENTITY_A::Flags"]
    [::std::mem::offset_of!(_SEC_WINNT_AUTH_IDENTITY_A, Flags) - 44usize];
};
pub type SEC_WINNT_AUTH_IDENTITY_A = _SEC_WINNT_AUTH_IDENTITY_A;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RPC_VERSION {
  pub MajorVersion: ::std::os::raw::c_ushort,
  pub MinorVersion: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _RPC_VERSION"][::std::mem::size_of::<_RPC_VERSION>() - 4usize];
  ["Alignment of _RPC_VERSION"][::std::mem::align_of::<_RPC_VERSION>() - 2usize];
  ["Offset of field: _RPC_VERSION::MajorVersion"]
    [::std::mem::offset_of!(_RPC_VERSION, MajorVersion) - 0usize];
  ["Offset of field: _RPC_VERSION::MinorVersion"]
    [::std::mem::offset_of!(_RPC_VERSION, MinorVersion) - 2usize];
};
pub type RPC_VERSION = _RPC_VERSION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RPC_SYNTAX_IDENTIFIER {
  pub SyntaxGUID: GUID,
  pub SyntaxVersion: RPC_VERSION,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _RPC_SYNTAX_IDENTIFIER"][::std::mem::size_of::<_RPC_SYNTAX_IDENTIFIER>() - 20usize];
  ["Alignment of _RPC_SYNTAX_IDENTIFIER"]
    [::std::mem::align_of::<_RPC_SYNTAX_IDENTIFIER>() - 4usize];
  ["Offset of field: _RPC_SYNTAX_IDENTIFIER::SyntaxGUID"]
    [::std::mem::offset_of!(_RPC_SYNTAX_IDENTIFIER, SyntaxGUID) - 0usize];
  ["Offset of field: _RPC_SYNTAX_IDENTIFIER::SyntaxVersion"]
    [::std::mem::offset_of!(_RPC_SYNTAX_IDENTIFIER, SyntaxVersion) - 16usize];
};
pub type PRPC_SYNTAX_IDENTIFIER = *mut _RPC_SYNTAX_IDENTIFIER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RPC_MESSAGE {
  pub Handle: RPC_BINDING_HANDLE,
  pub DataRepresentation: ::std::os::raw::c_ulong,
  pub Buffer: *mut ::std::os::raw::c_void,
  pub BufferLength: ::std::os::raw::c_uint,
  pub ProcNum: ::std::os::raw::c_uint,
  pub TransferSyntax: PRPC_SYNTAX_IDENTIFIER,
  pub RpcInterfaceInformation: *mut ::std::os::raw::c_void,
  pub ReservedForRuntime: *mut ::std::os::raw::c_void,
  pub ManagerEpv: *mut ::std::os::raw::c_void,
  pub ImportContext: *mut ::std::os::raw::c_void,
  pub RpcFlags: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _RPC_MESSAGE"][::std::mem::size_of::<_RPC_MESSAGE>() - 80usize];
  ["Alignment of _RPC_MESSAGE"][::std::mem::align_of::<_RPC_MESSAGE>() - 8usize];
  ["Offset of field: _RPC_MESSAGE::Handle"][::std::mem::offset_of!(_RPC_MESSAGE, Handle) - 0usize];
  ["Offset of field: _RPC_MESSAGE::DataRepresentation"]
    [::std::mem::offset_of!(_RPC_MESSAGE, DataRepresentation) - 8usize];
  ["Offset of field: _RPC_MESSAGE::Buffer"][::std::mem::offset_of!(_RPC_MESSAGE, Buffer) - 16usize];
  ["Offset of field: _RPC_MESSAGE::BufferLength"]
    [::std::mem::offset_of!(_RPC_MESSAGE, BufferLength) - 24usize];
  ["Offset of field: _RPC_MESSAGE::ProcNum"]
    [::std::mem::offset_of!(_RPC_MESSAGE, ProcNum) - 28usize];
  ["Offset of field: _RPC_MESSAGE::TransferSyntax"]
    [::std::mem::offset_of!(_RPC_MESSAGE, TransferSyntax) - 32usize];
  ["Offset of field: _RPC_MESSAGE::RpcInterfaceInformation"]
    [::std::mem::offset_of!(_RPC_MESSAGE, RpcInterfaceInformation) - 40usize];
  ["Offset of field: _RPC_MESSAGE::ReservedForRuntime"]
    [::std::mem::offset_of!(_RPC_MESSAGE, ReservedForRuntime) - 48usize];
  ["Offset of field: _RPC_MESSAGE::ManagerEpv"]
    [::std::mem::offset_of!(_RPC_MESSAGE, ManagerEpv) - 56usize];
  ["Offset of field: _RPC_MESSAGE::ImportContext"]
    [::std::mem::offset_of!(_RPC_MESSAGE, ImportContext) - 64usize];
  ["Offset of field: _RPC_MESSAGE::RpcFlags"]
    [::std::mem::offset_of!(_RPC_MESSAGE, RpcFlags) - 72usize];
};
pub type PRPC_MESSAGE = *mut _RPC_MESSAGE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _AppBarData {
  pub cbSize: DWORD,
  pub hWnd: HWND,
  pub uCallbackMessage: UINT,
  pub uEdge: UINT,
  pub rc: RECT,
  pub lParam: LPARAM,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _AppBarData"][::std::mem::size_of::<_AppBarData>() - 48usize];
  ["Alignment of _AppBarData"][::std::mem::align_of::<_AppBarData>() - 8usize];
  ["Offset of field: _AppBarData::cbSize"][::std::mem::offset_of!(_AppBarData, cbSize) - 0usize];
  ["Offset of field: _AppBarData::hWnd"][::std::mem::offset_of!(_AppBarData, hWnd) - 8usize];
  ["Offset of field: _AppBarData::uCallbackMessage"]
    [::std::mem::offset_of!(_AppBarData, uCallbackMessage) - 16usize];
  ["Offset of field: _AppBarData::uEdge"][::std::mem::offset_of!(_AppBarData, uEdge) - 20usize];
  ["Offset of field: _AppBarData::rc"][::std::mem::offset_of!(_AppBarData, rc) - 24usize];
  ["Offset of field: _AppBarData::lParam"][::std::mem::offset_of!(_AppBarData, lParam) - 40usize];
};
pub type PAPPBARDATA = *mut _AppBarData;
unsafe extern "C" {
  pub fn SHAppBarMessage(dwMessage: DWORD, pData: PAPPBARDATA) -> UINT_PTR;
}
pub type FILEOP_FLAGS = WORD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHFILEOPSTRUCTA {
  pub hwnd: HWND,
  pub wFunc: UINT,
  pub pFrom: PCZZSTR,
  pub pTo: PCZZSTR,
  pub fFlags: FILEOP_FLAGS,
  pub fAnyOperationsAborted: BOOL,
  pub hNameMappings: LPVOID,
  pub lpszProgressTitle: PCSTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SHFILEOPSTRUCTA"][::std::mem::size_of::<_SHFILEOPSTRUCTA>() - 56usize];
  ["Alignment of _SHFILEOPSTRUCTA"][::std::mem::align_of::<_SHFILEOPSTRUCTA>() - 8usize];
  ["Offset of field: _SHFILEOPSTRUCTA::hwnd"]
    [::std::mem::offset_of!(_SHFILEOPSTRUCTA, hwnd) - 0usize];
  ["Offset of field: _SHFILEOPSTRUCTA::wFunc"]
    [::std::mem::offset_of!(_SHFILEOPSTRUCTA, wFunc) - 8usize];
  ["Offset of field: _SHFILEOPSTRUCTA::pFrom"]
    [::std::mem::offset_of!(_SHFILEOPSTRUCTA, pFrom) - 16usize];
  ["Offset of field: _SHFILEOPSTRUCTA::pTo"]
    [::std::mem::offset_of!(_SHFILEOPSTRUCTA, pTo) - 24usize];
  ["Offset of field: _SHFILEOPSTRUCTA::fFlags"]
    [::std::mem::offset_of!(_SHFILEOPSTRUCTA, fFlags) - 32usize];
  ["Offset of field: _SHFILEOPSTRUCTA::fAnyOperationsAborted"]
    [::std::mem::offset_of!(_SHFILEOPSTRUCTA, fAnyOperationsAborted) - 36usize];
  ["Offset of field: _SHFILEOPSTRUCTA::hNameMappings"]
    [::std::mem::offset_of!(_SHFILEOPSTRUCTA, hNameMappings) - 40usize];
  ["Offset of field: _SHFILEOPSTRUCTA::lpszProgressTitle"]
    [::std::mem::offset_of!(_SHFILEOPSTRUCTA, lpszProgressTitle) - 48usize];
};
pub type SHFILEOPSTRUCTA = _SHFILEOPSTRUCTA;
pub type LPSHFILEOPSTRUCTA = *mut _SHFILEOPSTRUCTA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHFILEOPSTRUCTW {
  pub hwnd: HWND,
  pub wFunc: UINT,
  pub pFrom: PCZZWSTR,
  pub pTo: PCZZWSTR,
  pub fFlags: FILEOP_FLAGS,
  pub fAnyOperationsAborted: BOOL,
  pub hNameMappings: LPVOID,
  pub lpszProgressTitle: PCWSTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SHFILEOPSTRUCTW"][::std::mem::size_of::<_SHFILEOPSTRUCTW>() - 56usize];
  ["Alignment of _SHFILEOPSTRUCTW"][::std::mem::align_of::<_SHFILEOPSTRUCTW>() - 8usize];
  ["Offset of field: _SHFILEOPSTRUCTW::hwnd"]
    [::std::mem::offset_of!(_SHFILEOPSTRUCTW, hwnd) - 0usize];
  ["Offset of field: _SHFILEOPSTRUCTW::wFunc"]
    [::std::mem::offset_of!(_SHFILEOPSTRUCTW, wFunc) - 8usize];
  ["Offset of field: _SHFILEOPSTRUCTW::pFrom"]
    [::std::mem::offset_of!(_SHFILEOPSTRUCTW, pFrom) - 16usize];
  ["Offset of field: _SHFILEOPSTRUCTW::pTo"]
    [::std::mem::offset_of!(_SHFILEOPSTRUCTW, pTo) - 24usize];
  ["Offset of field: _SHFILEOPSTRUCTW::fFlags"]
    [::std::mem::offset_of!(_SHFILEOPSTRUCTW, fFlags) - 32usize];
  ["Offset of field: _SHFILEOPSTRUCTW::fAnyOperationsAborted"]
    [::std::mem::offset_of!(_SHFILEOPSTRUCTW, fAnyOperationsAborted) - 36usize];
  ["Offset of field: _SHFILEOPSTRUCTW::hNameMappings"]
    [::std::mem::offset_of!(_SHFILEOPSTRUCTW, hNameMappings) - 40usize];
  ["Offset of field: _SHFILEOPSTRUCTW::lpszProgressTitle"]
    [::std::mem::offset_of!(_SHFILEOPSTRUCTW, lpszProgressTitle) - 48usize];
};
pub type SHFILEOPSTRUCTW = _SHFILEOPSTRUCTW;
pub type LPSHFILEOPSTRUCTW = *mut _SHFILEOPSTRUCTW;
pub type SHFILEOPSTRUCT = SHFILEOPSTRUCTW;
unsafe extern "C" {
  pub fn SHFileOperationA(lpFileOp: LPSHFILEOPSTRUCTA) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
  pub fn SHFileOperationW(lpFileOp: LPSHFILEOPSTRUCTW) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
  pub fn SHFreeNameMappings(hNameMappings: HANDLE);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHNAMEMAPPINGA {
  pub pszOldPath: LPSTR,
  pub pszNewPath: LPSTR,
  pub cchOldPath: ::std::os::raw::c_int,
  pub cchNewPath: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SHNAMEMAPPINGA"][::std::mem::size_of::<_SHNAMEMAPPINGA>() - 24usize];
  ["Alignment of _SHNAMEMAPPINGA"][::std::mem::align_of::<_SHNAMEMAPPINGA>() - 8usize];
  ["Offset of field: _SHNAMEMAPPINGA::pszOldPath"]
    [::std::mem::offset_of!(_SHNAMEMAPPINGA, pszOldPath) - 0usize];
  ["Offset of field: _SHNAMEMAPPINGA::pszNewPath"]
    [::std::mem::offset_of!(_SHNAMEMAPPINGA, pszNewPath) - 8usize];
  ["Offset of field: _SHNAMEMAPPINGA::cchOldPath"]
    [::std::mem::offset_of!(_SHNAMEMAPPINGA, cchOldPath) - 16usize];
  ["Offset of field: _SHNAMEMAPPINGA::cchNewPath"]
    [::std::mem::offset_of!(_SHNAMEMAPPINGA, cchNewPath) - 20usize];
};
pub type SHNAMEMAPPINGA = _SHNAMEMAPPINGA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHNAMEMAPPINGW {
  pub pszOldPath: LPWSTR,
  pub pszNewPath: LPWSTR,
  pub cchOldPath: ::std::os::raw::c_int,
  pub cchNewPath: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SHNAMEMAPPINGW"][::std::mem::size_of::<_SHNAMEMAPPINGW>() - 24usize];
  ["Alignment of _SHNAMEMAPPINGW"][::std::mem::align_of::<_SHNAMEMAPPINGW>() - 8usize];
  ["Offset of field: _SHNAMEMAPPINGW::pszOldPath"]
    [::std::mem::offset_of!(_SHNAMEMAPPINGW, pszOldPath) - 0usize];
  ["Offset of field: _SHNAMEMAPPINGW::pszNewPath"]
    [::std::mem::offset_of!(_SHNAMEMAPPINGW, pszNewPath) - 8usize];
  ["Offset of field: _SHNAMEMAPPINGW::cchOldPath"]
    [::std::mem::offset_of!(_SHNAMEMAPPINGW, cchOldPath) - 16usize];
  ["Offset of field: _SHNAMEMAPPINGW::cchNewPath"]
    [::std::mem::offset_of!(_SHNAMEMAPPINGW, cchNewPath) - 20usize];
};
pub type SHNAMEMAPPINGW = _SHNAMEMAPPINGW;
pub type SHNAMEMAPPING = SHNAMEMAPPINGW;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SHELLEXECUTEINFOA {
  pub cbSize: DWORD,
  pub fMask: ULONG,
  pub hwnd: HWND,
  pub lpVerb: LPCSTR,
  pub lpFile: LPCSTR,
  pub lpParameters: LPCSTR,
  pub lpDirectory: LPCSTR,
  pub nShow: ::std::os::raw::c_int,
  pub hInstApp: HINSTANCE,
  pub lpIDList: *mut ::std::os::raw::c_void,
  pub lpClass: LPCSTR,
  pub hkeyClass: HKEY,
  pub dwHotKey: DWORD,
  pub __bindgen_anon_1: _SHELLEXECUTEINFOA__bindgen_ty_1,
  pub hProcess: HANDLE,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SHELLEXECUTEINFOA__bindgen_ty_1 {
  pub hIcon: HANDLE,
  pub hMonitor: HANDLE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SHELLEXECUTEINFOA__bindgen_ty_1"]
    [::std::mem::size_of::<_SHELLEXECUTEINFOA__bindgen_ty_1>() - 8usize];
  ["Alignment of _SHELLEXECUTEINFOA__bindgen_ty_1"]
    [::std::mem::align_of::<_SHELLEXECUTEINFOA__bindgen_ty_1>() - 8usize];
  ["Offset of field: _SHELLEXECUTEINFOA__bindgen_ty_1::hIcon"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOA__bindgen_ty_1, hIcon) - 0usize];
  ["Offset of field: _SHELLEXECUTEINFOA__bindgen_ty_1::hMonitor"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOA__bindgen_ty_1, hMonitor) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SHELLEXECUTEINFOA"][::std::mem::size_of::<_SHELLEXECUTEINFOA>() - 112usize];
  ["Alignment of _SHELLEXECUTEINFOA"][::std::mem::align_of::<_SHELLEXECUTEINFOA>() - 8usize];
  ["Offset of field: _SHELLEXECUTEINFOA::cbSize"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOA, cbSize) - 0usize];
  ["Offset of field: _SHELLEXECUTEINFOA::fMask"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOA, fMask) - 4usize];
  ["Offset of field: _SHELLEXECUTEINFOA::hwnd"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOA, hwnd) - 8usize];
  ["Offset of field: _SHELLEXECUTEINFOA::lpVerb"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOA, lpVerb) - 16usize];
  ["Offset of field: _SHELLEXECUTEINFOA::lpFile"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOA, lpFile) - 24usize];
  ["Offset of field: _SHELLEXECUTEINFOA::lpParameters"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOA, lpParameters) - 32usize];
  ["Offset of field: _SHELLEXECUTEINFOA::lpDirectory"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOA, lpDirectory) - 40usize];
  ["Offset of field: _SHELLEXECUTEINFOA::nShow"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOA, nShow) - 48usize];
  ["Offset of field: _SHELLEXECUTEINFOA::hInstApp"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOA, hInstApp) - 56usize];
  ["Offset of field: _SHELLEXECUTEINFOA::lpIDList"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOA, lpIDList) - 64usize];
  ["Offset of field: _SHELLEXECUTEINFOA::lpClass"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOA, lpClass) - 72usize];
  ["Offset of field: _SHELLEXECUTEINFOA::hkeyClass"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOA, hkeyClass) - 80usize];
  ["Offset of field: _SHELLEXECUTEINFOA::dwHotKey"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOA, dwHotKey) - 88usize];
  ["Offset of field: _SHELLEXECUTEINFOA::hProcess"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOA, hProcess) - 104usize];
};
pub type SHELLEXECUTEINFOA = _SHELLEXECUTEINFOA;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SHELLEXECUTEINFOW {
  pub cbSize: DWORD,
  pub fMask: ULONG,
  pub hwnd: HWND,
  pub lpVerb: LPCWSTR,
  pub lpFile: LPCWSTR,
  pub lpParameters: LPCWSTR,
  pub lpDirectory: LPCWSTR,
  pub nShow: ::std::os::raw::c_int,
  pub hInstApp: HINSTANCE,
  pub lpIDList: *mut ::std::os::raw::c_void,
  pub lpClass: LPCWSTR,
  pub hkeyClass: HKEY,
  pub dwHotKey: DWORD,
  pub __bindgen_anon_1: _SHELLEXECUTEINFOW__bindgen_ty_1,
  pub hProcess: HANDLE,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SHELLEXECUTEINFOW__bindgen_ty_1 {
  pub hIcon: HANDLE,
  pub hMonitor: HANDLE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SHELLEXECUTEINFOW__bindgen_ty_1"]
    [::std::mem::size_of::<_SHELLEXECUTEINFOW__bindgen_ty_1>() - 8usize];
  ["Alignment of _SHELLEXECUTEINFOW__bindgen_ty_1"]
    [::std::mem::align_of::<_SHELLEXECUTEINFOW__bindgen_ty_1>() - 8usize];
  ["Offset of field: _SHELLEXECUTEINFOW__bindgen_ty_1::hIcon"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOW__bindgen_ty_1, hIcon) - 0usize];
  ["Offset of field: _SHELLEXECUTEINFOW__bindgen_ty_1::hMonitor"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOW__bindgen_ty_1, hMonitor) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SHELLEXECUTEINFOW"][::std::mem::size_of::<_SHELLEXECUTEINFOW>() - 112usize];
  ["Alignment of _SHELLEXECUTEINFOW"][::std::mem::align_of::<_SHELLEXECUTEINFOW>() - 8usize];
  ["Offset of field: _SHELLEXECUTEINFOW::cbSize"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOW, cbSize) - 0usize];
  ["Offset of field: _SHELLEXECUTEINFOW::fMask"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOW, fMask) - 4usize];
  ["Offset of field: _SHELLEXECUTEINFOW::hwnd"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOW, hwnd) - 8usize];
  ["Offset of field: _SHELLEXECUTEINFOW::lpVerb"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOW, lpVerb) - 16usize];
  ["Offset of field: _SHELLEXECUTEINFOW::lpFile"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOW, lpFile) - 24usize];
  ["Offset of field: _SHELLEXECUTEINFOW::lpParameters"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOW, lpParameters) - 32usize];
  ["Offset of field: _SHELLEXECUTEINFOW::lpDirectory"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOW, lpDirectory) - 40usize];
  ["Offset of field: _SHELLEXECUTEINFOW::nShow"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOW, nShow) - 48usize];
  ["Offset of field: _SHELLEXECUTEINFOW::hInstApp"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOW, hInstApp) - 56usize];
  ["Offset of field: _SHELLEXECUTEINFOW::lpIDList"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOW, lpIDList) - 64usize];
  ["Offset of field: _SHELLEXECUTEINFOW::lpClass"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOW, lpClass) - 72usize];
  ["Offset of field: _SHELLEXECUTEINFOW::hkeyClass"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOW, hkeyClass) - 80usize];
  ["Offset of field: _SHELLEXECUTEINFOW::dwHotKey"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOW, dwHotKey) - 88usize];
  ["Offset of field: _SHELLEXECUTEINFOW::hProcess"]
    [::std::mem::offset_of!(_SHELLEXECUTEINFOW, hProcess) - 104usize];
};
pub type SHELLEXECUTEINFOW = _SHELLEXECUTEINFOW;
pub type SHELLEXECUTEINFO = SHELLEXECUTEINFOW;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHCREATEPROCESSINFOW {
  pub cbSize: DWORD,
  pub fMask: ULONG,
  pub hwnd: HWND,
  pub pszFile: LPCWSTR,
  pub pszParameters: LPCWSTR,
  pub pszCurrentDirectory: LPCWSTR,
  pub hUserToken: HANDLE,
  pub lpProcessAttributes: LPSECURITY_ATTRIBUTES,
  pub lpThreadAttributes: LPSECURITY_ATTRIBUTES,
  pub bInheritHandles: BOOL,
  pub dwCreationFlags: DWORD,
  pub lpStartupInfo: LPSTARTUPINFOW,
  pub lpProcessInformation: LPPROCESS_INFORMATION,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SHCREATEPROCESSINFOW"][::std::mem::size_of::<_SHCREATEPROCESSINFOW>() - 88usize];
  ["Alignment of _SHCREATEPROCESSINFOW"][::std::mem::align_of::<_SHCREATEPROCESSINFOW>() - 8usize];
  ["Offset of field: _SHCREATEPROCESSINFOW::cbSize"]
    [::std::mem::offset_of!(_SHCREATEPROCESSINFOW, cbSize) - 0usize];
  ["Offset of field: _SHCREATEPROCESSINFOW::fMask"]
    [::std::mem::offset_of!(_SHCREATEPROCESSINFOW, fMask) - 4usize];
  ["Offset of field: _SHCREATEPROCESSINFOW::hwnd"]
    [::std::mem::offset_of!(_SHCREATEPROCESSINFOW, hwnd) - 8usize];
  ["Offset of field: _SHCREATEPROCESSINFOW::pszFile"]
    [::std::mem::offset_of!(_SHCREATEPROCESSINFOW, pszFile) - 16usize];
  ["Offset of field: _SHCREATEPROCESSINFOW::pszParameters"]
    [::std::mem::offset_of!(_SHCREATEPROCESSINFOW, pszParameters) - 24usize];
  ["Offset of field: _SHCREATEPROCESSINFOW::pszCurrentDirectory"]
    [::std::mem::offset_of!(_SHCREATEPROCESSINFOW, pszCurrentDirectory) - 32usize];
  ["Offset of field: _SHCREATEPROCESSINFOW::hUserToken"]
    [::std::mem::offset_of!(_SHCREATEPROCESSINFOW, hUserToken) - 40usize];
  ["Offset of field: _SHCREATEPROCESSINFOW::lpProcessAttributes"]
    [::std::mem::offset_of!(_SHCREATEPROCESSINFOW, lpProcessAttributes) - 48usize];
  ["Offset of field: _SHCREATEPROCESSINFOW::lpThreadAttributes"]
    [::std::mem::offset_of!(_SHCREATEPROCESSINFOW, lpThreadAttributes) - 56usize];
  ["Offset of field: _SHCREATEPROCESSINFOW::bInheritHandles"]
    [::std::mem::offset_of!(_SHCREATEPROCESSINFOW, bInheritHandles) - 64usize];
  ["Offset of field: _SHCREATEPROCESSINFOW::dwCreationFlags"]
    [::std::mem::offset_of!(_SHCREATEPROCESSINFOW, dwCreationFlags) - 68usize];
  ["Offset of field: _SHCREATEPROCESSINFOW::lpStartupInfo"]
    [::std::mem::offset_of!(_SHCREATEPROCESSINFOW, lpStartupInfo) - 72usize];
  ["Offset of field: _SHCREATEPROCESSINFOW::lpProcessInformation"]
    [::std::mem::offset_of!(_SHCREATEPROCESSINFOW, lpProcessInformation) - 80usize];
};
pub type SHCREATEPROCESSINFOW = _SHCREATEPROCESSINFOW;
pub type PSHCREATEPROCESSINFOW = *mut _SHCREATEPROCESSINFOW;
unsafe extern "C" {
  pub fn SHCreateProcessAsUserW(pscpi: PSHCREATEPROCESSINFOW) -> BOOL;
}
unsafe extern "C" {
  pub fn SHEvaluateSystemCommandTemplate(
    pszCmdTemplate: PCWSTR,
    ppszApplication: *mut PWSTR,
    ppszCommandLine: *mut PWSTR,
    ppszParameters: *mut PWSTR,
  ) -> HRESULT;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHQUERYRBINFO {
  pub cbSize: DWORD,
  pub i64Size: ::std::os::raw::c_longlong,
  pub i64NumItems: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SHQUERYRBINFO"][::std::mem::size_of::<_SHQUERYRBINFO>() - 24usize];
  ["Alignment of _SHQUERYRBINFO"][::std::mem::align_of::<_SHQUERYRBINFO>() - 8usize];
  ["Offset of field: _SHQUERYRBINFO::cbSize"]
    [::std::mem::offset_of!(_SHQUERYRBINFO, cbSize) - 0usize];
  ["Offset of field: _SHQUERYRBINFO::i64Size"]
    [::std::mem::offset_of!(_SHQUERYRBINFO, i64Size) - 8usize];
  ["Offset of field: _SHQUERYRBINFO::i64NumItems"]
    [::std::mem::offset_of!(_SHQUERYRBINFO, i64NumItems) - 16usize];
};
pub type SHQUERYRBINFO = _SHQUERYRBINFO;
pub type LPSHQUERYRBINFO = *mut _SHQUERYRBINFO;
unsafe extern "C" {
  pub fn SHQueryRecycleBinA(pszRootPath: LPCSTR, pSHQueryRBInfo: LPSHQUERYRBINFO) -> HRESULT;
}
unsafe extern "C" {
  pub fn SHQueryRecycleBinW(pszRootPath: LPCWSTR, pSHQueryRBInfo: LPSHQUERYRBINFO) -> HRESULT;
}
unsafe extern "C" {
  pub fn SHEmptyRecycleBinA(hwnd: HWND, pszRootPath: LPCSTR, dwFlags: DWORD) -> HRESULT;
}
unsafe extern "C" {
  pub fn SHEmptyRecycleBinW(hwnd: HWND, pszRootPath: LPCWSTR, dwFlags: DWORD) -> HRESULT;
}
pub const QUERY_USER_NOTIFICATION_STATE_QUNS_NOT_PRESENT: QUERY_USER_NOTIFICATION_STATE = 1;
pub const QUERY_USER_NOTIFICATION_STATE_QUNS_BUSY: QUERY_USER_NOTIFICATION_STATE = 2;
pub const QUERY_USER_NOTIFICATION_STATE_QUNS_RUNNING_D3D_FULL_SCREEN:
  QUERY_USER_NOTIFICATION_STATE = 3;
pub const QUERY_USER_NOTIFICATION_STATE_QUNS_PRESENTATION_MODE: QUERY_USER_NOTIFICATION_STATE = 4;
pub const QUERY_USER_NOTIFICATION_STATE_QUNS_ACCEPTS_NOTIFICATIONS: QUERY_USER_NOTIFICATION_STATE =
  5;
pub const QUERY_USER_NOTIFICATION_STATE_QUNS_QUIET_TIME: QUERY_USER_NOTIFICATION_STATE = 6;
pub const QUERY_USER_NOTIFICATION_STATE_QUNS_APP: QUERY_USER_NOTIFICATION_STATE = 7;
pub type QUERY_USER_NOTIFICATION_STATE = ::std::os::raw::c_int;
unsafe extern "C" {
  pub fn SHQueryUserNotificationState(pquns: *mut QUERY_USER_NOTIFICATION_STATE) -> HRESULT;
}
unsafe extern "C" {
  pub fn SHGetPropertyStoreForWindow(
    hwnd: HWND,
    riid: *const IID,
    ppv: *mut *mut ::std::os::raw::c_void,
  ) -> HRESULT;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHFILEINFOA {
  pub hIcon: HICON,
  pub iIcon: ::std::os::raw::c_int,
  pub dwAttributes: DWORD,
  pub szDisplayName: [CHAR; 260usize],
  pub szTypeName: [CHAR; 80usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SHFILEINFOA"][::std::mem::size_of::<_SHFILEINFOA>() - 360usize];
  ["Alignment of _SHFILEINFOA"][::std::mem::align_of::<_SHFILEINFOA>() - 8usize];
  ["Offset of field: _SHFILEINFOA::hIcon"][::std::mem::offset_of!(_SHFILEINFOA, hIcon) - 0usize];
  ["Offset of field: _SHFILEINFOA::iIcon"][::std::mem::offset_of!(_SHFILEINFOA, iIcon) - 8usize];
  ["Offset of field: _SHFILEINFOA::dwAttributes"]
    [::std::mem::offset_of!(_SHFILEINFOA, dwAttributes) - 12usize];
  ["Offset of field: _SHFILEINFOA::szDisplayName"]
    [::std::mem::offset_of!(_SHFILEINFOA, szDisplayName) - 16usize];
  ["Offset of field: _SHFILEINFOA::szTypeName"]
    [::std::mem::offset_of!(_SHFILEINFOA, szTypeName) - 276usize];
};
pub type SHFILEINFOA = _SHFILEINFOA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHFILEINFOW {
  pub hIcon: HICON,
  pub iIcon: ::std::os::raw::c_int,
  pub dwAttributes: DWORD,
  pub szDisplayName: [WCHAR; 260usize],
  pub szTypeName: [WCHAR; 80usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SHFILEINFOW"][::std::mem::size_of::<_SHFILEINFOW>() - 696usize];
  ["Alignment of _SHFILEINFOW"][::std::mem::align_of::<_SHFILEINFOW>() - 8usize];
  ["Offset of field: _SHFILEINFOW::hIcon"][::std::mem::offset_of!(_SHFILEINFOW, hIcon) - 0usize];
  ["Offset of field: _SHFILEINFOW::iIcon"][::std::mem::offset_of!(_SHFILEINFOW, iIcon) - 8usize];
  ["Offset of field: _SHFILEINFOW::dwAttributes"]
    [::std::mem::offset_of!(_SHFILEINFOW, dwAttributes) - 12usize];
  ["Offset of field: _SHFILEINFOW::szDisplayName"]
    [::std::mem::offset_of!(_SHFILEINFOW, szDisplayName) - 16usize];
  ["Offset of field: _SHFILEINFOW::szTypeName"]
    [::std::mem::offset_of!(_SHFILEINFOW, szTypeName) - 536usize];
};
pub type SHFILEINFOW = _SHFILEINFOW;
pub type SHFILEINFO = SHFILEINFOW;
unsafe extern "C" {
  pub fn SHGetFileInfoA(
    pszPath: LPCSTR,
    dwFileAttributes: DWORD,
    psfi: *mut SHFILEINFOA,
    cbFileInfo: UINT,
    uFlags: UINT,
  ) -> DWORD_PTR;
}
unsafe extern "C" {
  pub fn SHGetFileInfoW(
    pszPath: LPCWSTR,
    dwFileAttributes: DWORD,
    psfi: *mut SHFILEINFOW,
    cbFileInfo: UINT,
    uFlags: UINT,
  ) -> DWORD_PTR;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHSTOCKICONINFO {
  pub cbSize: DWORD,
  pub hIcon: HICON,
  pub iSysImageIndex: ::std::os::raw::c_int,
  pub iIcon: ::std::os::raw::c_int,
  pub szPath: [WCHAR; 260usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SHSTOCKICONINFO"][::std::mem::size_of::<_SHSTOCKICONINFO>() - 544usize];
  ["Alignment of _SHSTOCKICONINFO"][::std::mem::align_of::<_SHSTOCKICONINFO>() - 8usize];
  ["Offset of field: _SHSTOCKICONINFO::cbSize"]
    [::std::mem::offset_of!(_SHSTOCKICONINFO, cbSize) - 0usize];
  ["Offset of field: _SHSTOCKICONINFO::hIcon"]
    [::std::mem::offset_of!(_SHSTOCKICONINFO, hIcon) - 8usize];
  ["Offset of field: _SHSTOCKICONINFO::iSysImageIndex"]
    [::std::mem::offset_of!(_SHSTOCKICONINFO, iSysImageIndex) - 16usize];
  ["Offset of field: _SHSTOCKICONINFO::iIcon"]
    [::std::mem::offset_of!(_SHSTOCKICONINFO, iIcon) - 20usize];
  ["Offset of field: _SHSTOCKICONINFO::szPath"]
    [::std::mem::offset_of!(_SHSTOCKICONINFO, szPath) - 24usize];
};
pub type SHSTOCKICONINFO = _SHSTOCKICONINFO;
pub const SHSTOCKICONID_SIID_DOCNOASSOC: SHSTOCKICONID = 0;
pub const SHSTOCKICONID_SIID_DOCASSOC: SHSTOCKICONID = 1;
pub const SHSTOCKICONID_SIID_APPLICATION: SHSTOCKICONID = 2;
pub const SHSTOCKICONID_SIID_FOLDER: SHSTOCKICONID = 3;
pub const SHSTOCKICONID_SIID_FOLDEROPEN: SHSTOCKICONID = 4;
pub const SHSTOCKICONID_SIID_DRIVE525: SHSTOCKICONID = 5;
pub const SHSTOCKICONID_SIID_DRIVE35: SHSTOCKICONID = 6;
pub const SHSTOCKICONID_SIID_DRIVEREMOVE: SHSTOCKICONID = 7;
pub const SHSTOCKICONID_SIID_DRIVEFIXED: SHSTOCKICONID = 8;
pub const SHSTOCKICONID_SIID_DRIVENET: SHSTOCKICONID = 9;
pub const SHSTOCKICONID_SIID_DRIVENETDISABLED: SHSTOCKICONID = 10;
pub const SHSTOCKICONID_SIID_DRIVECD: SHSTOCKICONID = 11;
pub const SHSTOCKICONID_SIID_DRIVERAM: SHSTOCKICONID = 12;
pub const SHSTOCKICONID_SIID_WORLD: SHSTOCKICONID = 13;
pub const SHSTOCKICONID_SIID_SERVER: SHSTOCKICONID = 15;
pub const SHSTOCKICONID_SIID_PRINTER: SHSTOCKICONID = 16;
pub const SHSTOCKICONID_SIID_MYNETWORK: SHSTOCKICONID = 17;
pub const SHSTOCKICONID_SIID_FIND: SHSTOCKICONID = 22;
pub const SHSTOCKICONID_SIID_HELP: SHSTOCKICONID = 23;
pub const SHSTOCKICONID_SIID_SHARE: SHSTOCKICONID = 28;
pub const SHSTOCKICONID_SIID_LINK: SHSTOCKICONID = 29;
pub const SHSTOCKICONID_SIID_SLOWFILE: SHSTOCKICONID = 30;
pub const SHSTOCKICONID_SIID_RECYCLER: SHSTOCKICONID = 31;
pub const SHSTOCKICONID_SIID_RECYCLERFULL: SHSTOCKICONID = 32;
pub const SHSTOCKICONID_SIID_MEDIACDAUDIO: SHSTOCKICONID = 40;
pub const SHSTOCKICONID_SIID_LOCK: SHSTOCKICONID = 47;
pub const SHSTOCKICONID_SIID_AUTOLIST: SHSTOCKICONID = 49;
pub const SHSTOCKICONID_SIID_PRINTERNET: SHSTOCKICONID = 50;
pub const SHSTOCKICONID_SIID_SERVERSHARE: SHSTOCKICONID = 51;
pub const SHSTOCKICONID_SIID_PRINTERFAX: SHSTOCKICONID = 52;
pub const SHSTOCKICONID_SIID_PRINTERFAXNET: SHSTOCKICONID = 53;
pub const SHSTOCKICONID_SIID_PRINTERFILE: SHSTOCKICONID = 54;
pub const SHSTOCKICONID_SIID_STACK: SHSTOCKICONID = 55;
pub const SHSTOCKICONID_SIID_MEDIASVCD: SHSTOCKICONID = 56;
pub const SHSTOCKICONID_SIID_STUFFEDFOLDER: SHSTOCKICONID = 57;
pub const SHSTOCKICONID_SIID_DRIVEUNKNOWN: SHSTOCKICONID = 58;
pub const SHSTOCKICONID_SIID_DRIVEDVD: SHSTOCKICONID = 59;
pub const SHSTOCKICONID_SIID_MEDIADVD: SHSTOCKICONID = 60;
pub const SHSTOCKICONID_SIID_MEDIADVDRAM: SHSTOCKICONID = 61;
pub const SHSTOCKICONID_SIID_MEDIADVDRW: SHSTOCKICONID = 62;
pub const SHSTOCKICONID_SIID_MEDIADVDR: SHSTOCKICONID = 63;
pub const SHSTOCKICONID_SIID_MEDIADVDROM: SHSTOCKICONID = 64;
pub const SHSTOCKICONID_SIID_MEDIACDAUDIOPLUS: SHSTOCKICONID = 65;
pub const SHSTOCKICONID_SIID_MEDIACDRW: SHSTOCKICONID = 66;
pub const SHSTOCKICONID_SIID_MEDIACDR: SHSTOCKICONID = 67;
pub const SHSTOCKICONID_SIID_MEDIACDBURN: SHSTOCKICONID = 68;
pub const SHSTOCKICONID_SIID_MEDIABLANKCD: SHSTOCKICONID = 69;
pub const SHSTOCKICONID_SIID_MEDIACDROM: SHSTOCKICONID = 70;
pub const SHSTOCKICONID_SIID_AUDIOFILES: SHSTOCKICONID = 71;
pub const SHSTOCKICONID_SIID_IMAGEFILES: SHSTOCKICONID = 72;
pub const SHSTOCKICONID_SIID_VIDEOFILES: SHSTOCKICONID = 73;
pub const SHSTOCKICONID_SIID_MIXEDFILES: SHSTOCKICONID = 74;
pub const SHSTOCKICONID_SIID_FOLDERBACK: SHSTOCKICONID = 75;
pub const SHSTOCKICONID_SIID_FOLDERFRONT: SHSTOCKICONID = 76;
pub const SHSTOCKICONID_SIID_SHIELD: SHSTOCKICONID = 77;
pub const SHSTOCKICONID_SIID_WARNING: SHSTOCKICONID = 78;
pub const SHSTOCKICONID_SIID_INFO: SHSTOCKICONID = 79;
pub const SHSTOCKICONID_SIID_ERROR: SHSTOCKICONID = 80;
pub const SHSTOCKICONID_SIID_KEY: SHSTOCKICONID = 81;
pub const SHSTOCKICONID_SIID_SOFTWARE: SHSTOCKICONID = 82;
pub const SHSTOCKICONID_SIID_RENAME: SHSTOCKICONID = 83;
pub const SHSTOCKICONID_SIID_DELETE: SHSTOCKICONID = 84;
pub const SHSTOCKICONID_SIID_MEDIAAUDIODVD: SHSTOCKICONID = 85;
pub const SHSTOCKICONID_SIID_MEDIAMOVIEDVD: SHSTOCKICONID = 86;
pub const SHSTOCKICONID_SIID_MEDIAENHANCEDCD: SHSTOCKICONID = 87;
pub const SHSTOCKICONID_SIID_MEDIAENHANCEDDVD: SHSTOCKICONID = 88;
pub const SHSTOCKICONID_SIID_MEDIAHDDVD: SHSTOCKICONID = 89;
pub const SHSTOCKICONID_SIID_MEDIABLURAY: SHSTOCKICONID = 90;
pub const SHSTOCKICONID_SIID_MEDIAVCD: SHSTOCKICONID = 91;
pub const SHSTOCKICONID_SIID_MEDIADVDPLUSR: SHSTOCKICONID = 92;
pub const SHSTOCKICONID_SIID_MEDIADVDPLUSRW: SHSTOCKICONID = 93;
pub const SHSTOCKICONID_SIID_DESKTOPPC: SHSTOCKICONID = 94;
pub const SHSTOCKICONID_SIID_MOBILEPC: SHSTOCKICONID = 95;
pub const SHSTOCKICONID_SIID_USERS: SHSTOCKICONID = 96;
pub const SHSTOCKICONID_SIID_MEDIASMARTMEDIA: SHSTOCKICONID = 97;
pub const SHSTOCKICONID_SIID_MEDIACOMPACTFLASH: SHSTOCKICONID = 98;
pub const SHSTOCKICONID_SIID_DEVICECELLPHONE: SHSTOCKICONID = 99;
pub const SHSTOCKICONID_SIID_DEVICECAMERA: SHSTOCKICONID = 100;
pub const SHSTOCKICONID_SIID_DEVICEVIDEOCAMERA: SHSTOCKICONID = 101;
pub const SHSTOCKICONID_SIID_DEVICEAUDIOPLAYER: SHSTOCKICONID = 102;
pub const SHSTOCKICONID_SIID_NETWORKCONNECT: SHSTOCKICONID = 103;
pub const SHSTOCKICONID_SIID_INTERNET: SHSTOCKICONID = 104;
pub const SHSTOCKICONID_SIID_ZIPFILE: SHSTOCKICONID = 105;
pub const SHSTOCKICONID_SIID_SETTINGS: SHSTOCKICONID = 106;
pub const SHSTOCKICONID_SIID_DRIVEHDDVD: SHSTOCKICONID = 132;
pub const SHSTOCKICONID_SIID_DRIVEBD: SHSTOCKICONID = 133;
pub const SHSTOCKICONID_SIID_MEDIAHDDVDROM: SHSTOCKICONID = 134;
pub const SHSTOCKICONID_SIID_MEDIAHDDVDR: SHSTOCKICONID = 135;
pub const SHSTOCKICONID_SIID_MEDIAHDDVDRAM: SHSTOCKICONID = 136;
pub const SHSTOCKICONID_SIID_MEDIABDROM: SHSTOCKICONID = 137;
pub const SHSTOCKICONID_SIID_MEDIABDR: SHSTOCKICONID = 138;
pub const SHSTOCKICONID_SIID_MEDIABDRE: SHSTOCKICONID = 139;
pub const SHSTOCKICONID_SIID_CLUSTEREDDRIVE: SHSTOCKICONID = 140;
pub const SHSTOCKICONID_SIID_MAX_ICONS: SHSTOCKICONID = 181;
pub type SHSTOCKICONID = ::std::os::raw::c_int;
unsafe extern "C" {
  pub fn SHGetStockIconInfo(
    siid: SHSTOCKICONID,
    uFlags: UINT,
    psii: *mut SHSTOCKICONINFO,
  ) -> HRESULT;
}
unsafe extern "C" {
  pub fn SHGetDiskFreeSpaceExA(
    pszDirectoryName: LPCSTR,
    pulFreeBytesAvailableToCaller: *mut ULARGE_INTEGER,
    pulTotalNumberOfBytes: *mut ULARGE_INTEGER,
    pulTotalNumberOfFreeBytes: *mut ULARGE_INTEGER,
  ) -> BOOL;
}
unsafe extern "C" {
  pub fn SHGetDiskFreeSpaceExW(
    pszDirectoryName: LPCWSTR,
    pulFreeBytesAvailableToCaller: *mut ULARGE_INTEGER,
    pulTotalNumberOfBytes: *mut ULARGE_INTEGER,
    pulTotalNumberOfFreeBytes: *mut ULARGE_INTEGER,
  ) -> BOOL;
}
unsafe extern "C" {
  pub fn SHGetNewLinkInfoA(
    pszLinkTo: LPCSTR,
    pszDir: LPCSTR,
    pszName: LPSTR,
    pfMustCopy: *mut BOOL,
    uFlags: UINT,
  ) -> BOOL;
}
unsafe extern "C" {
  pub fn SHGetNewLinkInfoW(
    pszLinkTo: LPCWSTR,
    pszDir: LPCWSTR,
    pszName: LPWSTR,
    pfMustCopy: *mut BOOL,
    uFlags: UINT,
  ) -> BOOL;
}
unsafe extern "C" {
  pub fn SHInvokePrinterCommandA(
    hwnd: HWND,
    uAction: UINT,
    lpBuf1: LPCSTR,
    lpBuf2: LPCSTR,
    fModal: BOOL,
  ) -> BOOL;
}
unsafe extern "C" {
  pub fn SHInvokePrinterCommandW(
    hwnd: HWND,
    uAction: UINT,
    lpBuf1: LPCWSTR,
    lpBuf2: LPCWSTR,
    fModal: BOOL,
  ) -> BOOL;
}
unsafe extern "C" {
  pub fn SHLoadNonloadedIconOverlayIdentifiers() -> HRESULT;
}
unsafe extern "C" {
  pub fn SHIsFileAvailableOffline(pwszPath: PCWSTR, pdwStatus: *mut DWORD) -> HRESULT;
}
unsafe extern "C" {
  pub fn SHSetLocalizedName(
    pszPath: PCWSTR,
    pszResModule: PCWSTR,
    idsRes: ::std::os::raw::c_int,
  ) -> HRESULT;
}
unsafe extern "C" {
  pub fn SHRemoveLocalizedName(pszPath: PCWSTR) -> HRESULT;
}
unsafe extern "C" {
  pub fn SHGetLocalizedName(
    pszPath: PCWSTR,
    pszResModule: PWSTR,
    cch: UINT,
    pidsRes: *mut ::std::os::raw::c_int,
  ) -> HRESULT;
}
unsafe extern "C" {
  pub fn SHEnumerateUnreadMailAccountsA(
    hKeyUser: HKEY,
    dwIndex: DWORD,
    pszMailAddress: LPSTR,
    cchMailAddress: ::std::os::raw::c_int,
  ) -> HRESULT;
}
unsafe extern "C" {
  pub fn SHEnumerateUnreadMailAccountsW(
    hKeyUser: HKEY,
    dwIndex: DWORD,
    pszMailAddress: LPWSTR,
    cchMailAddress: ::std::os::raw::c_int,
  ) -> HRESULT;
}
unsafe extern "C" {
  pub fn SHGetUnreadMailCountA(
    hKeyUser: HKEY,
    pszMailAddress: LPCSTR,
    pdwCount: *mut DWORD,
    pFileTime: *mut FILETIME,
    pszShellExecuteCommand: LPSTR,
    cchShellExecuteCommand: ::std::os::raw::c_int,
  ) -> HRESULT;
}
unsafe extern "C" {
  pub fn SHGetUnreadMailCountW(
    hKeyUser: HKEY,
    pszMailAddress: LPCWSTR,
    pdwCount: *mut DWORD,
    pFileTime: *mut FILETIME,
    pszShellExecuteCommand: LPWSTR,
    cchShellExecuteCommand: ::std::os::raw::c_int,
  ) -> HRESULT;
}
unsafe extern "C" {
  pub fn SHSetUnreadMailCountA(
    pszMailAddress: LPCSTR,
    dwCount: DWORD,
    pszShellExecuteCommand: LPCSTR,
  ) -> HRESULT;
}
unsafe extern "C" {
  pub fn SHSetUnreadMailCountW(
    pszMailAddress: LPCWSTR,
    dwCount: DWORD,
    pszShellExecuteCommand: LPCWSTR,
  ) -> HRESULT;
}
unsafe extern "C" {
  pub fn SHTestTokenMembership(hToken: HANDLE, ulRID: ULONG) -> BOOL;
}
unsafe extern "C" {
  pub fn SHGetImageList(
    iImageList: ::std::os::raw::c_int,
    riid: *const IID,
    ppvObj: *mut *mut ::std::os::raw::c_void,
  ) -> HRESULT;
}
unsafe extern "C" {
  pub fn SHGetDriveMedia(pszDrive: PCWSTR, pdwMediaContent: *mut DWORD) -> HRESULT;
}
pub type u_short = ::std::os::raw::c_ushort;
pub type SOCKET = UINT_PTR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct servent {
  pub s_name: *mut ::std::os::raw::c_char,
  pub s_aliases: *mut *mut ::std::os::raw::c_char,
  pub s_proto: *mut ::std::os::raw::c_char,
  pub s_port: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of servent"][::std::mem::size_of::<servent>() - 32usize];
  ["Alignment of servent"][::std::mem::align_of::<servent>() - 8usize];
  ["Offset of field: servent::s_name"][::std::mem::offset_of!(servent, s_name) - 0usize];
  ["Offset of field: servent::s_aliases"][::std::mem::offset_of!(servent, s_aliases) - 8usize];
  ["Offset of field: servent::s_proto"][::std::mem::offset_of!(servent, s_proto) - 16usize];
  ["Offset of field: servent::s_port"][::std::mem::offset_of!(servent, s_port) - 24usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in_addr {
  pub S_un: in_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in_addr__bindgen_ty_1 {
  pub S_un_b: in_addr__bindgen_ty_1__bindgen_ty_1,
  pub S_un_w: in_addr__bindgen_ty_1__bindgen_ty_2,
  pub S_addr: ULONG,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr__bindgen_ty_1__bindgen_ty_1 {
  pub s_b1: UCHAR,
  pub s_b2: UCHAR,
  pub s_b3: UCHAR,
  pub s_b4: UCHAR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of in_addr__bindgen_ty_1__bindgen_ty_1"]
    [::std::mem::size_of::<in_addr__bindgen_ty_1__bindgen_ty_1>() - 4usize];
  ["Alignment of in_addr__bindgen_ty_1__bindgen_ty_1"]
    [::std::mem::align_of::<in_addr__bindgen_ty_1__bindgen_ty_1>() - 1usize];
  ["Offset of field: in_addr__bindgen_ty_1__bindgen_ty_1::s_b1"]
    [::std::mem::offset_of!(in_addr__bindgen_ty_1__bindgen_ty_1, s_b1) - 0usize];
  ["Offset of field: in_addr__bindgen_ty_1__bindgen_ty_1::s_b2"]
    [::std::mem::offset_of!(in_addr__bindgen_ty_1__bindgen_ty_1, s_b2) - 1usize];
  ["Offset of field: in_addr__bindgen_ty_1__bindgen_ty_1::s_b3"]
    [::std::mem::offset_of!(in_addr__bindgen_ty_1__bindgen_ty_1, s_b3) - 2usize];
  ["Offset of field: in_addr__bindgen_ty_1__bindgen_ty_1::s_b4"]
    [::std::mem::offset_of!(in_addr__bindgen_ty_1__bindgen_ty_1, s_b4) - 3usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr__bindgen_ty_1__bindgen_ty_2 {
  pub s_w1: USHORT,
  pub s_w2: USHORT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of in_addr__bindgen_ty_1__bindgen_ty_2"]
    [::std::mem::size_of::<in_addr__bindgen_ty_1__bindgen_ty_2>() - 4usize];
  ["Alignment of in_addr__bindgen_ty_1__bindgen_ty_2"]
    [::std::mem::align_of::<in_addr__bindgen_ty_1__bindgen_ty_2>() - 2usize];
  ["Offset of field: in_addr__bindgen_ty_1__bindgen_ty_2::s_w1"]
    [::std::mem::offset_of!(in_addr__bindgen_ty_1__bindgen_ty_2, s_w1) - 0usize];
  ["Offset of field: in_addr__bindgen_ty_1__bindgen_ty_2::s_w2"]
    [::std::mem::offset_of!(in_addr__bindgen_ty_1__bindgen_ty_2, s_w2) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of in_addr__bindgen_ty_1"][::std::mem::size_of::<in_addr__bindgen_ty_1>() - 4usize];
  ["Alignment of in_addr__bindgen_ty_1"][::std::mem::align_of::<in_addr__bindgen_ty_1>() - 4usize];
  ["Offset of field: in_addr__bindgen_ty_1::S_un_b"]
    [::std::mem::offset_of!(in_addr__bindgen_ty_1, S_un_b) - 0usize];
  ["Offset of field: in_addr__bindgen_ty_1::S_un_w"]
    [::std::mem::offset_of!(in_addr__bindgen_ty_1, S_un_w) - 0usize];
  ["Offset of field: in_addr__bindgen_ty_1::S_addr"]
    [::std::mem::offset_of!(in_addr__bindgen_ty_1, S_addr) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of in_addr"][::std::mem::size_of::<in_addr>() - 4usize];
  ["Alignment of in_addr"][::std::mem::align_of::<in_addr>() - 4usize];
  ["Offset of field: in_addr::S_un"][::std::mem::offset_of!(in_addr, S_un) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in {
  pub sin_family: ::std::os::raw::c_short,
  pub sin_port: u_short,
  pub sin_addr: in_addr,
  pub sin_zero: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of sockaddr_in"][::std::mem::size_of::<sockaddr_in>() - 16usize];
  ["Alignment of sockaddr_in"][::std::mem::align_of::<sockaddr_in>() - 4usize];
  ["Offset of field: sockaddr_in::sin_family"]
    [::std::mem::offset_of!(sockaddr_in, sin_family) - 0usize];
  ["Offset of field: sockaddr_in::sin_port"]
    [::std::mem::offset_of!(sockaddr_in, sin_port) - 2usize];
  ["Offset of field: sockaddr_in::sin_addr"]
    [::std::mem::offset_of!(sockaddr_in, sin_addr) - 4usize];
  ["Offset of field: sockaddr_in::sin_zero"]
    [::std::mem::offset_of!(sockaddr_in, sin_zero) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
  pub sa_family: u_short,
  pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of sockaddr"][::std::mem::size_of::<sockaddr>() - 16usize];
  ["Alignment of sockaddr"][::std::mem::align_of::<sockaddr>() - 2usize];
  ["Offset of field: sockaddr::sa_family"][::std::mem::offset_of!(sockaddr, sa_family) - 0usize];
  ["Offset of field: sockaddr::sa_data"][::std::mem::offset_of!(sockaddr, sa_data) - 2usize];
};
pub type SOCKADDR = sockaddr;
pub type SOCKADDR_IN = sockaddr_in;
pub type SERVENT = servent;
pub type ALG_ID = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCHANNEL_ALG {
  pub dwUse: DWORD,
  pub Algid: ALG_ID,
  pub cBits: DWORD,
  pub dwFlags: DWORD,
  pub dwReserved: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SCHANNEL_ALG"][::std::mem::size_of::<_SCHANNEL_ALG>() - 20usize];
  ["Alignment of _SCHANNEL_ALG"][::std::mem::align_of::<_SCHANNEL_ALG>() - 4usize];
  ["Offset of field: _SCHANNEL_ALG::dwUse"][::std::mem::offset_of!(_SCHANNEL_ALG, dwUse) - 0usize];
  ["Offset of field: _SCHANNEL_ALG::Algid"][::std::mem::offset_of!(_SCHANNEL_ALG, Algid) - 4usize];
  ["Offset of field: _SCHANNEL_ALG::cBits"][::std::mem::offset_of!(_SCHANNEL_ALG, cBits) - 8usize];
  ["Offset of field: _SCHANNEL_ALG::dwFlags"]
    [::std::mem::offset_of!(_SCHANNEL_ALG, dwFlags) - 12usize];
  ["Offset of field: _SCHANNEL_ALG::dwReserved"]
    [::std::mem::offset_of!(_SCHANNEL_ALG, dwReserved) - 16usize];
};
pub type SCHANNEL_ALG = _SCHANNEL_ALG;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SSL_ECCKEY_BLOB {
  pub dwCurveType: ULONG,
  pub cbKey: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SSL_ECCKEY_BLOB"][::std::mem::size_of::<_SSL_ECCKEY_BLOB>() - 8usize];
  ["Alignment of _SSL_ECCKEY_BLOB"][::std::mem::align_of::<_SSL_ECCKEY_BLOB>() - 4usize];
  ["Offset of field: _SSL_ECCKEY_BLOB::dwCurveType"]
    [::std::mem::offset_of!(_SSL_ECCKEY_BLOB, dwCurveType) - 0usize];
  ["Offset of field: _SSL_ECCKEY_BLOB::cbKey"]
    [::std::mem::offset_of!(_SSL_ECCKEY_BLOB, cbKey) - 4usize];
};
pub type SSL_ECCKEY_BLOB = _SSL_ECCKEY_BLOB;
pub type SECURITY_STATUS = LONG;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _HTTPSPolicyCallbackData {
  pub __bindgen_anon_1: _HTTPSPolicyCallbackData__bindgen_ty_1,
  pub dwAuthType: DWORD,
  pub fdwChecks: DWORD,
  pub pwszServerName: *mut WCHAR,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _HTTPSPolicyCallbackData__bindgen_ty_1 {
  pub cbStruct: DWORD,
  pub cbSize: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _HTTPSPolicyCallbackData__bindgen_ty_1"]
    [::std::mem::size_of::<_HTTPSPolicyCallbackData__bindgen_ty_1>() - 4usize];
  ["Alignment of _HTTPSPolicyCallbackData__bindgen_ty_1"]
    [::std::mem::align_of::<_HTTPSPolicyCallbackData__bindgen_ty_1>() - 4usize];
  ["Offset of field: _HTTPSPolicyCallbackData__bindgen_ty_1::cbStruct"]
    [::std::mem::offset_of!(_HTTPSPolicyCallbackData__bindgen_ty_1, cbStruct) - 0usize];
  ["Offset of field: _HTTPSPolicyCallbackData__bindgen_ty_1::cbSize"]
    [::std::mem::offset_of!(_HTTPSPolicyCallbackData__bindgen_ty_1, cbSize) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _HTTPSPolicyCallbackData"][::std::mem::size_of::<_HTTPSPolicyCallbackData>() - 24usize];
  ["Alignment of _HTTPSPolicyCallbackData"]
    [::std::mem::align_of::<_HTTPSPolicyCallbackData>() - 8usize];
  ["Offset of field: _HTTPSPolicyCallbackData::dwAuthType"]
    [::std::mem::offset_of!(_HTTPSPolicyCallbackData, dwAuthType) - 4usize];
  ["Offset of field: _HTTPSPolicyCallbackData::fdwChecks"]
    [::std::mem::offset_of!(_HTTPSPolicyCallbackData, fdwChecks) - 8usize];
  ["Offset of field: _HTTPSPolicyCallbackData::pwszServerName"]
    [::std::mem::offset_of!(_HTTPSPolicyCallbackData, pwszServerName) - 16usize];
};
pub type SSL_EXTRA_CERT_CHAIN_POLICY_PARA = _HTTPSPolicyCallbackData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS {
  pub cbSize: DWORD,
  pub dwErrorLevel: DWORD,
  pub dwErrorCategory: DWORD,
  pub dwReserved: DWORD,
  pub wszErrorText: [WCHAR; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS"]
    [::std::mem::size_of::<_SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS>() - 528usize];
  ["Alignment of _SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS"]
    [::std::mem::align_of::<_SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS>() - 4usize];
  ["Offset of field: _SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS::cbSize"]
    [::std::mem::offset_of!(_SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS, cbSize) - 0usize];
  ["Offset of field: _SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS::dwErrorLevel"]
    [::std::mem::offset_of!(_SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS, dwErrorLevel) - 4usize];
  ["Offset of field: _SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS::dwErrorCategory"]
    [::std::mem::offset_of!(_SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS, dwErrorCategory) - 8usize];
  ["Offset of field: _SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS::dwReserved"]
    [::std::mem::offset_of!(_SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS, dwReserved) - 12usize];
  ["Offset of field: _SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS::wszErrorText"]
    [::std::mem::offset_of!(_SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS, wszErrorText) - 16usize];
};
pub type SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS = _SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SSL_HPKP_HEADER_EXTRA_CERT_CHAIN_POLICY_PARA {
  pub cbSize: DWORD,
  pub dwReserved: DWORD,
  pub pwszServerName: LPWSTR,
  pub rgpszHpkpValue: [LPSTR; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SSL_HPKP_HEADER_EXTRA_CERT_CHAIN_POLICY_PARA"]
    [::std::mem::size_of::<_SSL_HPKP_HEADER_EXTRA_CERT_CHAIN_POLICY_PARA>() - 32usize];
  ["Alignment of _SSL_HPKP_HEADER_EXTRA_CERT_CHAIN_POLICY_PARA"]
    [::std::mem::align_of::<_SSL_HPKP_HEADER_EXTRA_CERT_CHAIN_POLICY_PARA>() - 8usize];
  ["Offset of field: _SSL_HPKP_HEADER_EXTRA_CERT_CHAIN_POLICY_PARA::cbSize"]
    [::std::mem::offset_of!(_SSL_HPKP_HEADER_EXTRA_CERT_CHAIN_POLICY_PARA, cbSize) - 0usize];
  ["Offset of field: _SSL_HPKP_HEADER_EXTRA_CERT_CHAIN_POLICY_PARA::dwReserved"]
    [::std::mem::offset_of!(_SSL_HPKP_HEADER_EXTRA_CERT_CHAIN_POLICY_PARA, dwReserved) - 4usize];
  ["Offset of field: _SSL_HPKP_HEADER_EXTRA_CERT_CHAIN_POLICY_PARA::pwszServerName"][::std::mem::offset_of!(
    _SSL_HPKP_HEADER_EXTRA_CERT_CHAIN_POLICY_PARA,
    pwszServerName
  ) - 8usize];
  ["Offset of field: _SSL_HPKP_HEADER_EXTRA_CERT_CHAIN_POLICY_PARA::rgpszHpkpValue"][::std::mem::offset_of!(
    _SSL_HPKP_HEADER_EXTRA_CERT_CHAIN_POLICY_PARA,
    rgpszHpkpValue
  ) - 16usize];
};
pub type SSL_HPKP_HEADER_EXTRA_CERT_CHAIN_POLICY_PARA =
  _SSL_HPKP_HEADER_EXTRA_CERT_CHAIN_POLICY_PARA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_PARA {
  pub cbSize: DWORD,
  pub dwReserved: DWORD,
  pub pwszServerName: PCWSTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_PARA"]
    [::std::mem::size_of::<_SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_PARA>() - 16usize];
  ["Alignment of _SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_PARA"]
    [::std::mem::align_of::<_SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_PARA>() - 8usize];
  ["Offset of field: _SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_PARA::cbSize"]
    [::std::mem::offset_of!(_SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_PARA, cbSize) - 0usize];
  ["Offset of field: _SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_PARA::dwReserved"]
    [::std::mem::offset_of!(_SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_PARA, dwReserved) - 4usize];
  ["Offset of field: _SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_PARA::pwszServerName"]
    [::std::mem::offset_of!(_SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_PARA, pwszServerName) - 8usize];
};
pub type SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_PARA = _SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_PARA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_STATUS {
  pub cbSize: DWORD,
  pub lError: LONG,
  pub wszErrorText: [WCHAR; 512usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_STATUS"]
    [::std::mem::size_of::<_SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_STATUS>() - 1032usize];
  ["Alignment of _SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_STATUS"]
    [::std::mem::align_of::<_SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_STATUS>() - 4usize];
  ["Offset of field: _SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_STATUS::cbSize"]
    [::std::mem::offset_of!(_SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_STATUS, cbSize) - 0usize];
  ["Offset of field: _SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_STATUS::lError"]
    [::std::mem::offset_of!(_SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_STATUS, lError) - 4usize];
  ["Offset of field: _SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_STATUS::wszErrorText"]
    [::std::mem::offset_of!(_SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_STATUS, wszErrorText) - 8usize];
};
pub type SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_STATUS = _SSL_KEY_PIN_EXTRA_CERT_CHAIN_POLICY_STATUS;
pub type byte = ::std::os::raw::c_uchar;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NDR_SCONTEXT {
  pub pad: [*mut ::std::os::raw::c_void; 2usize],
  pub userContext: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _NDR_SCONTEXT"][::std::mem::size_of::<_NDR_SCONTEXT>() - 24usize];
  ["Alignment of _NDR_SCONTEXT"][::std::mem::align_of::<_NDR_SCONTEXT>() - 8usize];
  ["Offset of field: _NDR_SCONTEXT::pad"][::std::mem::offset_of!(_NDR_SCONTEXT, pad) - 0usize];
  ["Offset of field: _NDR_SCONTEXT::userContext"]
    [::std::mem::offset_of!(_NDR_SCONTEXT, userContext) - 16usize];
};
pub type NDR_SCONTEXT = *mut _NDR_SCONTEXT;
pub type NDR_RUNDOWN =
  ::std::option::Option<unsafe extern "C" fn(context: *mut ::std::os::raw::c_void)>;
pub type NDR_NOTIFY_ROUTINE = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCONTEXT_QUEUE {
  pub NumberOfObjects: ::std::os::raw::c_ulong,
  pub ArrayOfObjects: *mut NDR_SCONTEXT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SCONTEXT_QUEUE"][::std::mem::size_of::<_SCONTEXT_QUEUE>() - 16usize];
  ["Alignment of _SCONTEXT_QUEUE"][::std::mem::align_of::<_SCONTEXT_QUEUE>() - 8usize];
  ["Offset of field: _SCONTEXT_QUEUE::NumberOfObjects"]
    [::std::mem::offset_of!(_SCONTEXT_QUEUE, NumberOfObjects) - 0usize];
  ["Offset of field: _SCONTEXT_QUEUE::ArrayOfObjects"]
    [::std::mem::offset_of!(_SCONTEXT_QUEUE, ArrayOfObjects) - 8usize];
};
pub type SCONTEXT_QUEUE = _SCONTEXT_QUEUE;
pub type error_status_t = ::std::os::raw::c_ulong;
pub type EXPR_EVAL = ::std::option::Option<unsafe extern "C" fn(arg1: *mut _MIDL_STUB_MESSAGE)>;
pub type PFORMAT_STRING = *const ::std::os::raw::c_uchar;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ARRAY_INFO {
  pub Dimension: ::std::os::raw::c_long,
  pub BufferConformanceMark: *mut ::std::os::raw::c_ulong,
  pub BufferVarianceMark: *mut ::std::os::raw::c_ulong,
  pub MaxCountArray: *mut ::std::os::raw::c_ulong,
  pub OffsetArray: *mut ::std::os::raw::c_ulong,
  pub ActualCountArray: *mut ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of ARRAY_INFO"][::std::mem::size_of::<ARRAY_INFO>() - 48usize];
  ["Alignment of ARRAY_INFO"][::std::mem::align_of::<ARRAY_INFO>() - 8usize];
  ["Offset of field: ARRAY_INFO::Dimension"]
    [::std::mem::offset_of!(ARRAY_INFO, Dimension) - 0usize];
  ["Offset of field: ARRAY_INFO::BufferConformanceMark"]
    [::std::mem::offset_of!(ARRAY_INFO, BufferConformanceMark) - 8usize];
  ["Offset of field: ARRAY_INFO::BufferVarianceMark"]
    [::std::mem::offset_of!(ARRAY_INFO, BufferVarianceMark) - 16usize];
  ["Offset of field: ARRAY_INFO::MaxCountArray"]
    [::std::mem::offset_of!(ARRAY_INFO, MaxCountArray) - 24usize];
  ["Offset of field: ARRAY_INFO::OffsetArray"]
    [::std::mem::offset_of!(ARRAY_INFO, OffsetArray) - 32usize];
  ["Offset of field: ARRAY_INFO::ActualCountArray"]
    [::std::mem::offset_of!(ARRAY_INFO, ActualCountArray) - 40usize];
};
pub type PARRAY_INFO = *mut ARRAY_INFO;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NDR_ASYNC_MESSAGE {
  _unused: [u8; 0],
}
pub type PNDR_ASYNC_MESSAGE = *mut _NDR_ASYNC_MESSAGE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NDR_CORRELATION_INFO {
  _unused: [u8; 0],
}
pub type PNDR_CORRELATION_INFO = *mut _NDR_CORRELATION_INFO;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDR_ALLOC_ALL_NODES_CONTEXT {
  _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDR_POINTER_QUEUE_STATE {
  _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NDR_PROC_CONTEXT {
  _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _MIDL_STUB_MESSAGE {
  pub RpcMsg: PRPC_MESSAGE,
  pub Buffer: *mut ::std::os::raw::c_uchar,
  pub BufferStart: *mut ::std::os::raw::c_uchar,
  pub BufferEnd: *mut ::std::os::raw::c_uchar,
  pub BufferMark: *mut ::std::os::raw::c_uchar,
  pub BufferLength: ::std::os::raw::c_ulong,
  pub MemorySize: ::std::os::raw::c_ulong,
  pub Memory: *mut ::std::os::raw::c_uchar,
  pub IsClient: ::std::os::raw::c_uchar,
  pub Pad: ::std::os::raw::c_uchar,
  pub uFlags2: ::std::os::raw::c_ushort,
  pub ReuseBuffer: ::std::os::raw::c_int,
  pub pAllocAllNodesContext: *mut NDR_ALLOC_ALL_NODES_CONTEXT,
  pub pPointerQueueState: *mut NDR_POINTER_QUEUE_STATE,
  pub IgnoreEmbeddedPointers: ::std::os::raw::c_int,
  pub PointerBufferMark: *mut ::std::os::raw::c_uchar,
  pub CorrDespIncrement: ::std::os::raw::c_uchar,
  pub uFlags: ::std::os::raw::c_uchar,
  pub UniquePtrCount: ::std::os::raw::c_ushort,
  pub MaxCount: ULONG_PTR,
  pub Offset: ::std::os::raw::c_ulong,
  pub ActualCount: ::std::os::raw::c_ulong,
  pub pfnAllocate:
    ::std::option::Option<unsafe extern "C" fn(arg1: usize) -> *mut ::std::os::raw::c_void>,
  pub pfnFree: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
  pub StackTop: *mut ::std::os::raw::c_uchar,
  pub pPresentedType: *mut ::std::os::raw::c_uchar,
  pub pTransmitType: *mut ::std::os::raw::c_uchar,
  pub SavedHandle: handle_t,
  pub StubDesc: *const _MIDL_STUB_DESC,
  pub FullPtrXlatTables: *mut _FULL_PTR_XLAT_TABLES,
  pub FullPtrRefId: ::std::os::raw::c_ulong,
  pub PointerLength: ::std::os::raw::c_ulong,
  pub _bitfield_align_1: [u16; 0],
  pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
  pub dwDestContext: ::std::os::raw::c_ulong,
  pub pvDestContext: *mut ::std::os::raw::c_void,
  pub SavedContextHandles: *mut NDR_SCONTEXT,
  pub ParamNumber: ::std::os::raw::c_long,
  pub pRpcChannelBuffer: *mut IRpcChannelBuffer,
  pub pArrayInfo: PARRAY_INFO,
  pub SizePtrCountArray: *mut ::std::os::raw::c_ulong,
  pub SizePtrOffsetArray: *mut ::std::os::raw::c_ulong,
  pub SizePtrLengthArray: *mut ::std::os::raw::c_ulong,
  pub pArgQueue: *mut ::std::os::raw::c_void,
  pub dwStubPhase: ::std::os::raw::c_ulong,
  pub LowStackMark: *mut ::std::os::raw::c_void,
  pub pAsyncMsg: PNDR_ASYNC_MESSAGE,
  pub pCorrInfo: PNDR_CORRELATION_INFO,
  pub pCorrMemory: *mut ::std::os::raw::c_uchar,
  pub pMemoryList: *mut ::std::os::raw::c_void,
  pub pCSInfo: INT_PTR,
  pub ConformanceMark: *mut ::std::os::raw::c_uchar,
  pub VarianceMark: *mut ::std::os::raw::c_uchar,
  pub Unused: INT_PTR,
  pub pContext: *mut _NDR_PROC_CONTEXT,
  pub ContextHandleHash: *mut ::std::os::raw::c_void,
  pub pUserMarshalList: *mut ::std::os::raw::c_void,
  pub pFullPtrFormat: *mut ::std::os::raw::c_uchar,
  pub Reserved51_4: INT_PTR,
  pub Reserved51_5: INT_PTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _MIDL_STUB_MESSAGE"][::std::mem::size_of::<_MIDL_STUB_MESSAGE>() - 400usize];
  ["Alignment of _MIDL_STUB_MESSAGE"][::std::mem::align_of::<_MIDL_STUB_MESSAGE>() - 8usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::RpcMsg"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, RpcMsg) - 0usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::Buffer"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, Buffer) - 8usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::BufferStart"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, BufferStart) - 16usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::BufferEnd"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, BufferEnd) - 24usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::BufferMark"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, BufferMark) - 32usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::BufferLength"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, BufferLength) - 40usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::MemorySize"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, MemorySize) - 44usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::Memory"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, Memory) - 48usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::IsClient"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, IsClient) - 56usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::Pad"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, Pad) - 57usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::uFlags2"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, uFlags2) - 58usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::ReuseBuffer"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, ReuseBuffer) - 60usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pAllocAllNodesContext"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pAllocAllNodesContext) - 64usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pPointerQueueState"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pPointerQueueState) - 72usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::IgnoreEmbeddedPointers"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, IgnoreEmbeddedPointers) - 80usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::PointerBufferMark"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, PointerBufferMark) - 88usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::CorrDespIncrement"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, CorrDespIncrement) - 96usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::uFlags"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, uFlags) - 97usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::UniquePtrCount"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, UniquePtrCount) - 98usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::MaxCount"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, MaxCount) - 104usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::Offset"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, Offset) - 112usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::ActualCount"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, ActualCount) - 116usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pfnAllocate"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pfnAllocate) - 120usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pfnFree"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pfnFree) - 128usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::StackTop"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, StackTop) - 136usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pPresentedType"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pPresentedType) - 144usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pTransmitType"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pTransmitType) - 152usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::SavedHandle"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, SavedHandle) - 160usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::StubDesc"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, StubDesc) - 168usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::FullPtrXlatTables"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, FullPtrXlatTables) - 176usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::FullPtrRefId"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, FullPtrRefId) - 184usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::PointerLength"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, PointerLength) - 188usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::dwDestContext"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, dwDestContext) - 196usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pvDestContext"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pvDestContext) - 200usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::SavedContextHandles"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, SavedContextHandles) - 208usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::ParamNumber"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, ParamNumber) - 216usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pRpcChannelBuffer"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pRpcChannelBuffer) - 224usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pArrayInfo"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pArrayInfo) - 232usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::SizePtrCountArray"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, SizePtrCountArray) - 240usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::SizePtrOffsetArray"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, SizePtrOffsetArray) - 248usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::SizePtrLengthArray"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, SizePtrLengthArray) - 256usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pArgQueue"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pArgQueue) - 264usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::dwStubPhase"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, dwStubPhase) - 272usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::LowStackMark"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, LowStackMark) - 280usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pAsyncMsg"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pAsyncMsg) - 288usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pCorrInfo"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pCorrInfo) - 296usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pCorrMemory"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pCorrMemory) - 304usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pMemoryList"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pMemoryList) - 312usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pCSInfo"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pCSInfo) - 320usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::ConformanceMark"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, ConformanceMark) - 328usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::VarianceMark"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, VarianceMark) - 336usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::Unused"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, Unused) - 344usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pContext"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pContext) - 352usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::ContextHandleHash"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, ContextHandleHash) - 360usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pUserMarshalList"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pUserMarshalList) - 368usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::pFullPtrFormat"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, pFullPtrFormat) - 376usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::Reserved51_4"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, Reserved51_4) - 384usize];
  ["Offset of field: _MIDL_STUB_MESSAGE::Reserved51_5"]
    [::std::mem::offset_of!(_MIDL_STUB_MESSAGE, Reserved51_5) - 392usize];
};
impl _MIDL_STUB_MESSAGE {
  #[inline]
  pub fn fInDontFree(&self) -> ::std::os::raw::c_int {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_fInDontFree(&mut self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(0usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn fInDontFree_raw(this: *const Self) -> ::std::os::raw::c_int {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        0usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_fInDontFree_raw(this: *mut Self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        0usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn fDontCallFreeInst(&self) -> ::std::os::raw::c_int {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_fDontCallFreeInst(&mut self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(1usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn fDontCallFreeInst_raw(this: *const Self) -> ::std::os::raw::c_int {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        1usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_fDontCallFreeInst_raw(this: *mut Self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        1usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn fUnused1(&self) -> ::std::os::raw::c_int {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_fUnused1(&mut self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(2usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn fUnused1_raw(this: *const Self) -> ::std::os::raw::c_int {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        2usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_fUnused1_raw(this: *mut Self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        2usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn fHasReturn(&self) -> ::std::os::raw::c_int {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_fHasReturn(&mut self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(3usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn fHasReturn_raw(this: *const Self) -> ::std::os::raw::c_int {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        3usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_fHasReturn_raw(this: *mut Self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        3usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn fHasExtensions(&self) -> ::std::os::raw::c_int {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_fHasExtensions(&mut self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(4usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn fHasExtensions_raw(this: *const Self) -> ::std::os::raw::c_int {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        4usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_fHasExtensions_raw(this: *mut Self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        4usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn fHasNewCorrDesc(&self) -> ::std::os::raw::c_int {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_fHasNewCorrDesc(&mut self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(5usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn fHasNewCorrDesc_raw(this: *const Self) -> ::std::os::raw::c_int {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        5usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_fHasNewCorrDesc_raw(this: *mut Self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        5usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn fIsIn(&self) -> ::std::os::raw::c_int {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_fIsIn(&mut self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(6usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn fIsIn_raw(this: *const Self) -> ::std::os::raw::c_int {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        6usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_fIsIn_raw(this: *mut Self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        6usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn fIsOut(&self) -> ::std::os::raw::c_int {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_fIsOut(&mut self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(7usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn fIsOut_raw(this: *const Self) -> ::std::os::raw::c_int {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        7usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_fIsOut_raw(this: *mut Self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        7usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn fIsOicf(&self) -> ::std::os::raw::c_int {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_fIsOicf(&mut self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(8usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn fIsOicf_raw(this: *const Self) -> ::std::os::raw::c_int {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        8usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_fIsOicf_raw(this: *mut Self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        8usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn fBufferValid(&self) -> ::std::os::raw::c_int {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_fBufferValid(&mut self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(9usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn fBufferValid_raw(this: *const Self) -> ::std::os::raw::c_int {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        9usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_fBufferValid_raw(this: *mut Self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        9usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn fHasMemoryValidateCallback(&self) -> ::std::os::raw::c_int {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_fHasMemoryValidateCallback(&mut self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(10usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn fHasMemoryValidateCallback_raw(this: *const Self) -> ::std::os::raw::c_int {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        10usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_fHasMemoryValidateCallback_raw(this: *mut Self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        10usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn fInFree(&self) -> ::std::os::raw::c_int {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_fInFree(&mut self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(11usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn fInFree_raw(this: *const Self) -> ::std::os::raw::c_int {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        11usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_fInFree_raw(this: *mut Self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        11usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn fNeedMCCP(&self) -> ::std::os::raw::c_int {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
  }
  #[inline]
  pub fn set_fNeedMCCP(&mut self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(12usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn fNeedMCCP_raw(this: *const Self) -> ::std::os::raw::c_int {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        12usize,
        1u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_fNeedMCCP_raw(this: *mut Self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        12usize,
        1u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn fUnused2(&self) -> ::std::os::raw::c_int {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 3u8) as u32) }
  }
  #[inline]
  pub fn set_fUnused2(&mut self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(13usize, 3u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn fUnused2_raw(this: *const Self) -> ::std::os::raw::c_int {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        13usize,
        3u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_fUnused2_raw(this: *mut Self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        13usize,
        3u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn fUnused3(&self) -> ::std::os::raw::c_int {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
  }
  #[inline]
  pub fn set_fUnused3(&mut self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      self._bitfield_1.set(16usize, 16u8, val as u64)
    }
  }
  #[inline]
  pub unsafe fn fUnused3_raw(this: *const Self) -> ::std::os::raw::c_int {
    unsafe {
      ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
        ::std::ptr::addr_of!((*this)._bitfield_1),
        16usize,
        16u8,
      ) as u32)
    }
  }
  #[inline]
  pub unsafe fn set_fUnused3_raw(this: *mut Self, val: ::std::os::raw::c_int) {
    unsafe {
      let val: u32 = ::std::mem::transmute(val);
      <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
        ::std::ptr::addr_of_mut!((*this)._bitfield_1),
        16usize,
        16u8,
        val as u64,
      )
    }
  }
  #[inline]
  pub fn new_bitfield_1(
    fInDontFree: ::std::os::raw::c_int,
    fDontCallFreeInst: ::std::os::raw::c_int,
    fUnused1: ::std::os::raw::c_int,
    fHasReturn: ::std::os::raw::c_int,
    fHasExtensions: ::std::os::raw::c_int,
    fHasNewCorrDesc: ::std::os::raw::c_int,
    fIsIn: ::std::os::raw::c_int,
    fIsOut: ::std::os::raw::c_int,
    fIsOicf: ::std::os::raw::c_int,
    fBufferValid: ::std::os::raw::c_int,
    fHasMemoryValidateCallback: ::std::os::raw::c_int,
    fInFree: ::std::os::raw::c_int,
    fNeedMCCP: ::std::os::raw::c_int,
    fUnused2: ::std::os::raw::c_int,
    fUnused3: ::std::os::raw::c_int,
  ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
    let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
    __bindgen_bitfield_unit.set(0usize, 1u8, {
      let fInDontFree: u32 = unsafe { ::std::mem::transmute(fInDontFree) };
      fInDontFree as u64
    });
    __bindgen_bitfield_unit.set(1usize, 1u8, {
      let fDontCallFreeInst: u32 = unsafe { ::std::mem::transmute(fDontCallFreeInst) };
      fDontCallFreeInst as u64
    });
    __bindgen_bitfield_unit.set(2usize, 1u8, {
      let fUnused1: u32 = unsafe { ::std::mem::transmute(fUnused1) };
      fUnused1 as u64
    });
    __bindgen_bitfield_unit.set(3usize, 1u8, {
      let fHasReturn: u32 = unsafe { ::std::mem::transmute(fHasReturn) };
      fHasReturn as u64
    });
    __bindgen_bitfield_unit.set(4usize, 1u8, {
      let fHasExtensions: u32 = unsafe { ::std::mem::transmute(fHasExtensions) };
      fHasExtensions as u64
    });
    __bindgen_bitfield_unit.set(5usize, 1u8, {
      let fHasNewCorrDesc: u32 = unsafe { ::std::mem::transmute(fHasNewCorrDesc) };
      fHasNewCorrDesc as u64
    });
    __bindgen_bitfield_unit.set(6usize, 1u8, {
      let fIsIn: u32 = unsafe { ::std::mem::transmute(fIsIn) };
      fIsIn as u64
    });
    __bindgen_bitfield_unit.set(7usize, 1u8, {
      let fIsOut: u32 = unsafe { ::std::mem::transmute(fIsOut) };
      fIsOut as u64
    });
    __bindgen_bitfield_unit.set(8usize, 1u8, {
      let fIsOicf: u32 = unsafe { ::std::mem::transmute(fIsOicf) };
      fIsOicf as u64
    });
    __bindgen_bitfield_unit.set(9usize, 1u8, {
      let fBufferValid: u32 = unsafe { ::std::mem::transmute(fBufferValid) };
      fBufferValid as u64
    });
    __bindgen_bitfield_unit.set(10usize, 1u8, {
      let fHasMemoryValidateCallback: u32 =
        unsafe { ::std::mem::transmute(fHasMemoryValidateCallback) };
      fHasMemoryValidateCallback as u64
    });
    __bindgen_bitfield_unit.set(11usize, 1u8, {
      let fInFree: u32 = unsafe { ::std::mem::transmute(fInFree) };
      fInFree as u64
    });
    __bindgen_bitfield_unit.set(12usize, 1u8, {
      let fNeedMCCP: u32 = unsafe { ::std::mem::transmute(fNeedMCCP) };
      fNeedMCCP as u64
    });
    __bindgen_bitfield_unit.set(13usize, 3u8, {
      let fUnused2: u32 = unsafe { ::std::mem::transmute(fUnused2) };
      fUnused2 as u64
    });
    __bindgen_bitfield_unit.set(16usize, 16u8, {
      let fUnused3: u32 = unsafe { ::std::mem::transmute(fUnused3) };
      fUnused3 as u64
    });
    __bindgen_bitfield_unit
  }
}
pub type PMIDL_STUB_MESSAGE = *mut _MIDL_STUB_MESSAGE;
pub type GENERIC_BINDING_ROUTINE = ::std::option::Option<
  unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
pub type GENERIC_UNBIND_ROUTINE = ::std::option::Option<
  unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: *mut ::std::os::raw::c_uchar),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GENERIC_BINDING_ROUTINE_PAIR {
  pub pfnBind: GENERIC_BINDING_ROUTINE,
  pub pfnUnbind: GENERIC_UNBIND_ROUTINE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _GENERIC_BINDING_ROUTINE_PAIR"]
    [::std::mem::size_of::<_GENERIC_BINDING_ROUTINE_PAIR>() - 16usize];
  ["Alignment of _GENERIC_BINDING_ROUTINE_PAIR"]
    [::std::mem::align_of::<_GENERIC_BINDING_ROUTINE_PAIR>() - 8usize];
  ["Offset of field: _GENERIC_BINDING_ROUTINE_PAIR::pfnBind"]
    [::std::mem::offset_of!(_GENERIC_BINDING_ROUTINE_PAIR, pfnBind) - 0usize];
  ["Offset of field: _GENERIC_BINDING_ROUTINE_PAIR::pfnUnbind"]
    [::std::mem::offset_of!(_GENERIC_BINDING_ROUTINE_PAIR, pfnUnbind) - 8usize];
};
pub type GENERIC_BINDING_ROUTINE_PAIR = _GENERIC_BINDING_ROUTINE_PAIR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __GENERIC_BINDING_INFO {
  pub pObj: *mut ::std::os::raw::c_void,
  pub Size: ::std::os::raw::c_uint,
  pub pfnBind: GENERIC_BINDING_ROUTINE,
  pub pfnUnbind: GENERIC_UNBIND_ROUTINE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of __GENERIC_BINDING_INFO"][::std::mem::size_of::<__GENERIC_BINDING_INFO>() - 32usize];
  ["Alignment of __GENERIC_BINDING_INFO"]
    [::std::mem::align_of::<__GENERIC_BINDING_INFO>() - 8usize];
  ["Offset of field: __GENERIC_BINDING_INFO::pObj"]
    [::std::mem::offset_of!(__GENERIC_BINDING_INFO, pObj) - 0usize];
  ["Offset of field: __GENERIC_BINDING_INFO::Size"]
    [::std::mem::offset_of!(__GENERIC_BINDING_INFO, Size) - 8usize];
  ["Offset of field: __GENERIC_BINDING_INFO::pfnBind"]
    [::std::mem::offset_of!(__GENERIC_BINDING_INFO, pfnBind) - 16usize];
  ["Offset of field: __GENERIC_BINDING_INFO::pfnUnbind"]
    [::std::mem::offset_of!(__GENERIC_BINDING_INFO, pfnUnbind) - 24usize];
};
pub type PGENERIC_BINDING_INFO = *mut __GENERIC_BINDING_INFO;
pub type XMIT_HELPER_ROUTINE =
  ::std::option::Option<unsafe extern "C" fn(arg1: PMIDL_STUB_MESSAGE)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XMIT_ROUTINE_QUINTUPLE {
  pub pfnTranslateToXmit: XMIT_HELPER_ROUTINE,
  pub pfnTranslateFromXmit: XMIT_HELPER_ROUTINE,
  pub pfnFreeXmit: XMIT_HELPER_ROUTINE,
  pub pfnFreeInst: XMIT_HELPER_ROUTINE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _XMIT_ROUTINE_QUINTUPLE"][::std::mem::size_of::<_XMIT_ROUTINE_QUINTUPLE>() - 32usize];
  ["Alignment of _XMIT_ROUTINE_QUINTUPLE"]
    [::std::mem::align_of::<_XMIT_ROUTINE_QUINTUPLE>() - 8usize];
  ["Offset of field: _XMIT_ROUTINE_QUINTUPLE::pfnTranslateToXmit"]
    [::std::mem::offset_of!(_XMIT_ROUTINE_QUINTUPLE, pfnTranslateToXmit) - 0usize];
  ["Offset of field: _XMIT_ROUTINE_QUINTUPLE::pfnTranslateFromXmit"]
    [::std::mem::offset_of!(_XMIT_ROUTINE_QUINTUPLE, pfnTranslateFromXmit) - 8usize];
  ["Offset of field: _XMIT_ROUTINE_QUINTUPLE::pfnFreeXmit"]
    [::std::mem::offset_of!(_XMIT_ROUTINE_QUINTUPLE, pfnFreeXmit) - 16usize];
  ["Offset of field: _XMIT_ROUTINE_QUINTUPLE::pfnFreeInst"]
    [::std::mem::offset_of!(_XMIT_ROUTINE_QUINTUPLE, pfnFreeInst) - 24usize];
};
pub type XMIT_ROUTINE_QUINTUPLE = _XMIT_ROUTINE_QUINTUPLE;
pub type USER_MARSHAL_SIZING_ROUTINE = ::std::option::Option<
  unsafe extern "C" fn(
    arg1: *mut ::std::os::raw::c_ulong,
    arg2: ::std::os::raw::c_ulong,
    arg3: *mut ::std::os::raw::c_void,
  ) -> ::std::os::raw::c_ulong,
>;
pub type USER_MARSHAL_MARSHALLING_ROUTINE = ::std::option::Option<
  unsafe extern "C" fn(
    arg1: *mut ::std::os::raw::c_ulong,
    arg2: *mut ::std::os::raw::c_uchar,
    arg3: *mut ::std::os::raw::c_void,
  ) -> *mut ::std::os::raw::c_uchar,
>;
pub type USER_MARSHAL_UNMARSHALLING_ROUTINE = ::std::option::Option<
  unsafe extern "C" fn(
    arg1: *mut ::std::os::raw::c_ulong,
    arg2: *mut ::std::os::raw::c_uchar,
    arg3: *mut ::std::os::raw::c_void,
  ) -> *mut ::std::os::raw::c_uchar,
>;
pub type USER_MARSHAL_FREEING_ROUTINE = ::std::option::Option<
  unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_ulong, arg2: *mut ::std::os::raw::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _USER_MARSHAL_ROUTINE_QUADRUPLE {
  pub pfnBufferSize: USER_MARSHAL_SIZING_ROUTINE,
  pub pfnMarshall: USER_MARSHAL_MARSHALLING_ROUTINE,
  pub pfnUnmarshall: USER_MARSHAL_UNMARSHALLING_ROUTINE,
  pub pfnFree: USER_MARSHAL_FREEING_ROUTINE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _USER_MARSHAL_ROUTINE_QUADRUPLE"]
    [::std::mem::size_of::<_USER_MARSHAL_ROUTINE_QUADRUPLE>() - 32usize];
  ["Alignment of _USER_MARSHAL_ROUTINE_QUADRUPLE"]
    [::std::mem::align_of::<_USER_MARSHAL_ROUTINE_QUADRUPLE>() - 8usize];
  ["Offset of field: _USER_MARSHAL_ROUTINE_QUADRUPLE::pfnBufferSize"]
    [::std::mem::offset_of!(_USER_MARSHAL_ROUTINE_QUADRUPLE, pfnBufferSize) - 0usize];
  ["Offset of field: _USER_MARSHAL_ROUTINE_QUADRUPLE::pfnMarshall"]
    [::std::mem::offset_of!(_USER_MARSHAL_ROUTINE_QUADRUPLE, pfnMarshall) - 8usize];
  ["Offset of field: _USER_MARSHAL_ROUTINE_QUADRUPLE::pfnUnmarshall"]
    [::std::mem::offset_of!(_USER_MARSHAL_ROUTINE_QUADRUPLE, pfnUnmarshall) - 16usize];
  ["Offset of field: _USER_MARSHAL_ROUTINE_QUADRUPLE::pfnFree"]
    [::std::mem::offset_of!(_USER_MARSHAL_ROUTINE_QUADRUPLE, pfnFree) - 24usize];
};
pub type USER_MARSHAL_ROUTINE_QUADRUPLE = _USER_MARSHAL_ROUTINE_QUADRUPLE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _MALLOC_FREE_STRUCT {
  pub pfnAllocate:
    ::std::option::Option<unsafe extern "C" fn(arg1: usize) -> *mut ::std::os::raw::c_void>,
  pub pfnFree: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _MALLOC_FREE_STRUCT"][::std::mem::size_of::<_MALLOC_FREE_STRUCT>() - 16usize];
  ["Alignment of _MALLOC_FREE_STRUCT"][::std::mem::align_of::<_MALLOC_FREE_STRUCT>() - 8usize];
  ["Offset of field: _MALLOC_FREE_STRUCT::pfnAllocate"]
    [::std::mem::offset_of!(_MALLOC_FREE_STRUCT, pfnAllocate) - 0usize];
  ["Offset of field: _MALLOC_FREE_STRUCT::pfnFree"]
    [::std::mem::offset_of!(_MALLOC_FREE_STRUCT, pfnFree) - 8usize];
};
pub type MALLOC_FREE_STRUCT = _MALLOC_FREE_STRUCT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _COMM_FAULT_OFFSETS {
  pub CommOffset: ::std::os::raw::c_short,
  pub FaultOffset: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _COMM_FAULT_OFFSETS"][::std::mem::size_of::<_COMM_FAULT_OFFSETS>() - 4usize];
  ["Alignment of _COMM_FAULT_OFFSETS"][::std::mem::align_of::<_COMM_FAULT_OFFSETS>() - 2usize];
  ["Offset of field: _COMM_FAULT_OFFSETS::CommOffset"]
    [::std::mem::offset_of!(_COMM_FAULT_OFFSETS, CommOffset) - 0usize];
  ["Offset of field: _COMM_FAULT_OFFSETS::FaultOffset"]
    [::std::mem::offset_of!(_COMM_FAULT_OFFSETS, FaultOffset) - 2usize];
};
pub type COMM_FAULT_OFFSETS = _COMM_FAULT_OFFSETS;
pub const _IDL_CS_CONVERT_IDL_CS_NO_CONVERT: _IDL_CS_CONVERT = 0;
pub const _IDL_CS_CONVERT_IDL_CS_IN_PLACE_CONVERT: _IDL_CS_CONVERT = 1;
pub const _IDL_CS_CONVERT_IDL_CS_NEW_BUFFER_CONVERT: _IDL_CS_CONVERT = 2;
pub type _IDL_CS_CONVERT = ::std::os::raw::c_int;
pub use self::_IDL_CS_CONVERT as IDL_CS_CONVERT;
pub type CS_TYPE_NET_SIZE_ROUTINE = ::std::option::Option<
  unsafe extern "C" fn(
    hBinding: RPC_BINDING_HANDLE,
    ulNetworkCodeSet: ::std::os::raw::c_ulong,
    ulLocalBufferSize: ::std::os::raw::c_ulong,
    conversionType: *mut IDL_CS_CONVERT,
    pulNetworkBufferSize: *mut ::std::os::raw::c_ulong,
    pStatus: *mut error_status_t,
  ),
>;
pub type CS_TYPE_LOCAL_SIZE_ROUTINE = ::std::option::Option<
  unsafe extern "C" fn(
    hBinding: RPC_BINDING_HANDLE,
    ulNetworkCodeSet: ::std::os::raw::c_ulong,
    ulNetworkBufferSize: ::std::os::raw::c_ulong,
    conversionType: *mut IDL_CS_CONVERT,
    pulLocalBufferSize: *mut ::std::os::raw::c_ulong,
    pStatus: *mut error_status_t,
  ),
>;
pub type CS_TYPE_TO_NETCS_ROUTINE = ::std::option::Option<
  unsafe extern "C" fn(
    hBinding: RPC_BINDING_HANDLE,
    ulNetworkCodeSet: ::std::os::raw::c_ulong,
    pLocalData: *mut ::std::os::raw::c_void,
    ulLocalDataLength: ::std::os::raw::c_ulong,
    pNetworkData: *mut byte,
    pulNetworkDataLength: *mut ::std::os::raw::c_ulong,
    pStatus: *mut error_status_t,
  ),
>;
pub type CS_TYPE_FROM_NETCS_ROUTINE = ::std::option::Option<
  unsafe extern "C" fn(
    hBinding: RPC_BINDING_HANDLE,
    ulNetworkCodeSet: ::std::os::raw::c_ulong,
    pNetworkData: *mut byte,
    ulNetworkDataLength: ::std::os::raw::c_ulong,
    ulLocalBufferSize: ::std::os::raw::c_ulong,
    pLocalData: *mut ::std::os::raw::c_void,
    pulLocalDataLength: *mut ::std::os::raw::c_ulong,
    pStatus: *mut error_status_t,
  ),
>;
pub type CS_TAG_GETTING_ROUTINE = ::std::option::Option<
  unsafe extern "C" fn(
    hBinding: RPC_BINDING_HANDLE,
    fServerSide: ::std::os::raw::c_int,
    pulSendingTag: *mut ::std::os::raw::c_ulong,
    pulDesiredReceivingTag: *mut ::std::os::raw::c_ulong,
    pulReceivingTag: *mut ::std::os::raw::c_ulong,
    pStatus: *mut error_status_t,
  ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NDR_CS_SIZE_CONVERT_ROUTINES {
  pub pfnNetSize: CS_TYPE_NET_SIZE_ROUTINE,
  pub pfnToNetCs: CS_TYPE_TO_NETCS_ROUTINE,
  pub pfnLocalSize: CS_TYPE_LOCAL_SIZE_ROUTINE,
  pub pfnFromNetCs: CS_TYPE_FROM_NETCS_ROUTINE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _NDR_CS_SIZE_CONVERT_ROUTINES"]
    [::std::mem::size_of::<_NDR_CS_SIZE_CONVERT_ROUTINES>() - 32usize];
  ["Alignment of _NDR_CS_SIZE_CONVERT_ROUTINES"]
    [::std::mem::align_of::<_NDR_CS_SIZE_CONVERT_ROUTINES>() - 8usize];
  ["Offset of field: _NDR_CS_SIZE_CONVERT_ROUTINES::pfnNetSize"]
    [::std::mem::offset_of!(_NDR_CS_SIZE_CONVERT_ROUTINES, pfnNetSize) - 0usize];
  ["Offset of field: _NDR_CS_SIZE_CONVERT_ROUTINES::pfnToNetCs"]
    [::std::mem::offset_of!(_NDR_CS_SIZE_CONVERT_ROUTINES, pfnToNetCs) - 8usize];
  ["Offset of field: _NDR_CS_SIZE_CONVERT_ROUTINES::pfnLocalSize"]
    [::std::mem::offset_of!(_NDR_CS_SIZE_CONVERT_ROUTINES, pfnLocalSize) - 16usize];
  ["Offset of field: _NDR_CS_SIZE_CONVERT_ROUTINES::pfnFromNetCs"]
    [::std::mem::offset_of!(_NDR_CS_SIZE_CONVERT_ROUTINES, pfnFromNetCs) - 24usize];
};
pub type NDR_CS_SIZE_CONVERT_ROUTINES = _NDR_CS_SIZE_CONVERT_ROUTINES;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NDR_CS_ROUTINES {
  pub pSizeConvertRoutines: *mut NDR_CS_SIZE_CONVERT_ROUTINES,
  pub pTagGettingRoutines: *mut CS_TAG_GETTING_ROUTINE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _NDR_CS_ROUTINES"][::std::mem::size_of::<_NDR_CS_ROUTINES>() - 16usize];
  ["Alignment of _NDR_CS_ROUTINES"][::std::mem::align_of::<_NDR_CS_ROUTINES>() - 8usize];
  ["Offset of field: _NDR_CS_ROUTINES::pSizeConvertRoutines"]
    [::std::mem::offset_of!(_NDR_CS_ROUTINES, pSizeConvertRoutines) - 0usize];
  ["Offset of field: _NDR_CS_ROUTINES::pTagGettingRoutines"]
    [::std::mem::offset_of!(_NDR_CS_ROUTINES, pTagGettingRoutines) - 8usize];
};
pub type NDR_CS_ROUTINES = _NDR_CS_ROUTINES;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NDR_EXPR_DESC {
  pub pOffset: *const ::std::os::raw::c_ushort,
  pub pFormatExpr: PFORMAT_STRING,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _NDR_EXPR_DESC"][::std::mem::size_of::<_NDR_EXPR_DESC>() - 16usize];
  ["Alignment of _NDR_EXPR_DESC"][::std::mem::align_of::<_NDR_EXPR_DESC>() - 8usize];
  ["Offset of field: _NDR_EXPR_DESC::pOffset"]
    [::std::mem::offset_of!(_NDR_EXPR_DESC, pOffset) - 0usize];
  ["Offset of field: _NDR_EXPR_DESC::pFormatExpr"]
    [::std::mem::offset_of!(_NDR_EXPR_DESC, pFormatExpr) - 8usize];
};
pub type NDR_EXPR_DESC = _NDR_EXPR_DESC;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _MIDL_STUB_DESC {
  pub RpcInterfaceInformation: *mut ::std::os::raw::c_void,
  pub pfnAllocate:
    ::std::option::Option<unsafe extern "C" fn(arg1: usize) -> *mut ::std::os::raw::c_void>,
  pub pfnFree: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
  pub IMPLICIT_HANDLE_INFO: _MIDL_STUB_DESC__bindgen_ty_1,
  pub apfnNdrRundownRoutines: *const NDR_RUNDOWN,
  pub aGenericBindingRoutinePairs: *const GENERIC_BINDING_ROUTINE_PAIR,
  pub apfnExprEval: *const EXPR_EVAL,
  pub aXmitQuintuple: *const XMIT_ROUTINE_QUINTUPLE,
  pub pFormatTypes: *const ::std::os::raw::c_uchar,
  pub fCheckBounds: ::std::os::raw::c_int,
  pub Version: ::std::os::raw::c_ulong,
  pub pMallocFreeStruct: *mut MALLOC_FREE_STRUCT,
  pub MIDLVersion: ::std::os::raw::c_long,
  pub CommFaultOffsets: *const COMM_FAULT_OFFSETS,
  pub aUserMarshalQuadruple: *const USER_MARSHAL_ROUTINE_QUADRUPLE,
  pub NotifyRoutineTable: *const NDR_NOTIFY_ROUTINE,
  pub mFlags: ULONG_PTR,
  pub CsRoutineTables: *const NDR_CS_ROUTINES,
  pub ProxyServerInfo: *mut ::std::os::raw::c_void,
  pub pExprInfo: *const NDR_EXPR_DESC,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _MIDL_STUB_DESC__bindgen_ty_1 {
  pub pAutoHandle: *mut handle_t,
  pub pPrimitiveHandle: *mut handle_t,
  pub pGenericBindingInfo: PGENERIC_BINDING_INFO,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _MIDL_STUB_DESC__bindgen_ty_1"]
    [::std::mem::size_of::<_MIDL_STUB_DESC__bindgen_ty_1>() - 8usize];
  ["Alignment of _MIDL_STUB_DESC__bindgen_ty_1"]
    [::std::mem::align_of::<_MIDL_STUB_DESC__bindgen_ty_1>() - 8usize];
  ["Offset of field: _MIDL_STUB_DESC__bindgen_ty_1::pAutoHandle"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC__bindgen_ty_1, pAutoHandle) - 0usize];
  ["Offset of field: _MIDL_STUB_DESC__bindgen_ty_1::pPrimitiveHandle"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC__bindgen_ty_1, pPrimitiveHandle) - 0usize];
  ["Offset of field: _MIDL_STUB_DESC__bindgen_ty_1::pGenericBindingInfo"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC__bindgen_ty_1, pGenericBindingInfo) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _MIDL_STUB_DESC"][::std::mem::size_of::<_MIDL_STUB_DESC>() - 152usize];
  ["Alignment of _MIDL_STUB_DESC"][::std::mem::align_of::<_MIDL_STUB_DESC>() - 8usize];
  ["Offset of field: _MIDL_STUB_DESC::RpcInterfaceInformation"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, RpcInterfaceInformation) - 0usize];
  ["Offset of field: _MIDL_STUB_DESC::pfnAllocate"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, pfnAllocate) - 8usize];
  ["Offset of field: _MIDL_STUB_DESC::pfnFree"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, pfnFree) - 16usize];
  ["Offset of field: _MIDL_STUB_DESC::IMPLICIT_HANDLE_INFO"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, IMPLICIT_HANDLE_INFO) - 24usize];
  ["Offset of field: _MIDL_STUB_DESC::apfnNdrRundownRoutines"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, apfnNdrRundownRoutines) - 32usize];
  ["Offset of field: _MIDL_STUB_DESC::aGenericBindingRoutinePairs"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, aGenericBindingRoutinePairs) - 40usize];
  ["Offset of field: _MIDL_STUB_DESC::apfnExprEval"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, apfnExprEval) - 48usize];
  ["Offset of field: _MIDL_STUB_DESC::aXmitQuintuple"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, aXmitQuintuple) - 56usize];
  ["Offset of field: _MIDL_STUB_DESC::pFormatTypes"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, pFormatTypes) - 64usize];
  ["Offset of field: _MIDL_STUB_DESC::fCheckBounds"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, fCheckBounds) - 72usize];
  ["Offset of field: _MIDL_STUB_DESC::Version"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, Version) - 76usize];
  ["Offset of field: _MIDL_STUB_DESC::pMallocFreeStruct"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, pMallocFreeStruct) - 80usize];
  ["Offset of field: _MIDL_STUB_DESC::MIDLVersion"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, MIDLVersion) - 88usize];
  ["Offset of field: _MIDL_STUB_DESC::CommFaultOffsets"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, CommFaultOffsets) - 96usize];
  ["Offset of field: _MIDL_STUB_DESC::aUserMarshalQuadruple"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, aUserMarshalQuadruple) - 104usize];
  ["Offset of field: _MIDL_STUB_DESC::NotifyRoutineTable"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, NotifyRoutineTable) - 112usize];
  ["Offset of field: _MIDL_STUB_DESC::mFlags"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, mFlags) - 120usize];
  ["Offset of field: _MIDL_STUB_DESC::CsRoutineTables"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, CsRoutineTables) - 128usize];
  ["Offset of field: _MIDL_STUB_DESC::ProxyServerInfo"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, ProxyServerInfo) - 136usize];
  ["Offset of field: _MIDL_STUB_DESC::pExprInfo"]
    [::std::mem::offset_of!(_MIDL_STUB_DESC, pExprInfo) - 144usize];
};
pub type STUB_THUNK = ::std::option::Option<unsafe extern "C" fn(arg1: PMIDL_STUB_MESSAGE)>;
pub type SERVER_ROUTINE = ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_long>;
pub const XLAT_SIDE_XLAT_SERVER: XLAT_SIDE = 1;
pub const XLAT_SIDE_XLAT_CLIENT: XLAT_SIDE = 2;
pub type XLAT_SIDE = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FULL_PTR_XLAT_TABLES {
  pub RefIdToPointer: *mut ::std::os::raw::c_void,
  pub PointerToRefId: *mut ::std::os::raw::c_void,
  pub NextRefId: ::std::os::raw::c_ulong,
  pub XlatSide: XLAT_SIDE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _FULL_PTR_XLAT_TABLES"][::std::mem::size_of::<_FULL_PTR_XLAT_TABLES>() - 24usize];
  ["Alignment of _FULL_PTR_XLAT_TABLES"][::std::mem::align_of::<_FULL_PTR_XLAT_TABLES>() - 8usize];
  ["Offset of field: _FULL_PTR_XLAT_TABLES::RefIdToPointer"]
    [::std::mem::offset_of!(_FULL_PTR_XLAT_TABLES, RefIdToPointer) - 0usize];
  ["Offset of field: _FULL_PTR_XLAT_TABLES::PointerToRefId"]
    [::std::mem::offset_of!(_FULL_PTR_XLAT_TABLES, PointerToRefId) - 8usize];
  ["Offset of field: _FULL_PTR_XLAT_TABLES::NextRefId"]
    [::std::mem::offset_of!(_FULL_PTR_XLAT_TABLES, NextRefId) - 16usize];
  ["Offset of field: _FULL_PTR_XLAT_TABLES::XlatSide"]
    [::std::mem::offset_of!(_FULL_PTR_XLAT_TABLES, XlatSide) - 20usize];
};
pub const STUB_PHASE_STUB_UNMARSHAL: STUB_PHASE = 0;
pub const STUB_PHASE_STUB_CALL_SERVER: STUB_PHASE = 1;
pub const STUB_PHASE_STUB_MARSHAL: STUB_PHASE = 2;
pub const STUB_PHASE_STUB_CALL_SERVER_NO_HRESULT: STUB_PHASE = 3;
pub type STUB_PHASE = ::std::os::raw::c_int;
pub type OLECHAR = WCHAR;
pub type LPOLESTR = *mut OLECHAR;
pub type LPCOLESTR = *const OLECHAR;
pub type DOUBLE = f64;
pub type SCODE = LONG;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FLAGGED_WORD_BLOB {
  pub fFlags: ULONG,
  pub clSize: ULONG,
  pub asData: [::std::os::raw::c_ushort; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _FLAGGED_WORD_BLOB"][::std::mem::size_of::<_FLAGGED_WORD_BLOB>() - 12usize];
  ["Alignment of _FLAGGED_WORD_BLOB"][::std::mem::align_of::<_FLAGGED_WORD_BLOB>() - 4usize];
  ["Offset of field: _FLAGGED_WORD_BLOB::fFlags"]
    [::std::mem::offset_of!(_FLAGGED_WORD_BLOB, fFlags) - 0usize];
  ["Offset of field: _FLAGGED_WORD_BLOB::clSize"]
    [::std::mem::offset_of!(_FLAGGED_WORD_BLOB, clSize) - 4usize];
  ["Offset of field: _FLAGGED_WORD_BLOB::asData"]
    [::std::mem::offset_of!(_FLAGGED_WORD_BLOB, asData) - 8usize];
};
pub type FLAGGED_WORD_BLOB = _FLAGGED_WORD_BLOB;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _BYTE_SIZEDARR {
  pub clSize: ULONG,
  pub pData: *mut byte,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _BYTE_SIZEDARR"][::std::mem::size_of::<_BYTE_SIZEDARR>() - 16usize];
  ["Alignment of _BYTE_SIZEDARR"][::std::mem::align_of::<_BYTE_SIZEDARR>() - 8usize];
  ["Offset of field: _BYTE_SIZEDARR::clSize"]
    [::std::mem::offset_of!(_BYTE_SIZEDARR, clSize) - 0usize];
  ["Offset of field: _BYTE_SIZEDARR::pData"]
    [::std::mem::offset_of!(_BYTE_SIZEDARR, pData) - 8usize];
};
pub type BYTE_SIZEDARR = _BYTE_SIZEDARR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHORT_SIZEDARR {
  pub clSize: ULONG,
  pub pData: *mut ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _SHORT_SIZEDARR"][::std::mem::size_of::<_SHORT_SIZEDARR>() - 16usize];
  ["Alignment of _SHORT_SIZEDARR"][::std::mem::align_of::<_SHORT_SIZEDARR>() - 8usize];
  ["Offset of field: _SHORT_SIZEDARR::clSize"]
    [::std::mem::offset_of!(_SHORT_SIZEDARR, clSize) - 0usize];
  ["Offset of field: _SHORT_SIZEDARR::pData"]
    [::std::mem::offset_of!(_SHORT_SIZEDARR, pData) - 8usize];
};
pub type WORD_SIZEDARR = _SHORT_SIZEDARR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LONG_SIZEDARR {
  pub clSize: ULONG,
  pub pData: *mut ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _LONG_SIZEDARR"][::std::mem::size_of::<_LONG_SIZEDARR>() - 16usize];
  ["Alignment of _LONG_SIZEDARR"][::std::mem::align_of::<_LONG_SIZEDARR>() - 8usize];
  ["Offset of field: _LONG_SIZEDARR::clSize"]
    [::std::mem::offset_of!(_LONG_SIZEDARR, clSize) - 0usize];
  ["Offset of field: _LONG_SIZEDARR::pData"]
    [::std::mem::offset_of!(_LONG_SIZEDARR, pData) - 8usize];
};
pub type DWORD_SIZEDARR = _LONG_SIZEDARR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _HYPER_SIZEDARR {
  pub clSize: ULONG,
  pub pData: *mut ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _HYPER_SIZEDARR"][::std::mem::size_of::<_HYPER_SIZEDARR>() - 16usize];
  ["Alignment of _HYPER_SIZEDARR"][::std::mem::align_of::<_HYPER_SIZEDARR>() - 8usize];
  ["Offset of field: _HYPER_SIZEDARR::clSize"]
    [::std::mem::offset_of!(_HYPER_SIZEDARR, clSize) - 0usize];
  ["Offset of field: _HYPER_SIZEDARR::pData"]
    [::std::mem::offset_of!(_HYPER_SIZEDARR, pData) - 8usize];
};
pub type HYPER_SIZEDARR = _HYPER_SIZEDARR;
pub const tagSTGC_STGC_DEFAULT: tagSTGC = 0;
pub const tagSTGC_STGC_OVERWRITE: tagSTGC = 1;
pub const tagSTGC_STGC_ONLYIFCURRENT: tagSTGC = 2;
pub const tagSTGC_STGC_DANGEROUSLYCOMMITMERELYTODISKCACHE: tagSTGC = 4;
pub const tagSTGC_STGC_CONSOLIDATE: tagSTGC = 8;
pub type tagSTGC = ::std::os::raw::c_int;
pub use self::tagSTGC as STGC;
pub const tagSTGMOVE_STGMOVE_MOVE: tagSTGMOVE = 0;
pub const tagSTGMOVE_STGMOVE_COPY: tagSTGMOVE = 1;
pub const tagSTGMOVE_STGMOVE_SHALLOWCOPY: tagSTGMOVE = 2;
pub type tagSTGMOVE = ::std::os::raw::c_int;
pub use self::tagSTGMOVE as STGMOVE;
pub const tagSTATFLAG_STATFLAG_DEFAULT: tagSTATFLAG = 0;
pub const tagSTATFLAG_STATFLAG_NONAME: tagSTATFLAG = 1;
pub const tagSTATFLAG_STATFLAG_NOOPEN: tagSTATFLAG = 2;
pub type tagSTATFLAG = ::std::os::raw::c_int;
pub use self::tagSTATFLAG as STATFLAG;
pub type CLIPFORMAT = WORD;
pub type HMETAFILEPICT = *mut ::std::os::raw::c_void;
pub type DATE = f64;
#[repr(C)]
#[derive(Copy, Clone)]
pub union tagCY {
  pub __bindgen_anon_1: tagCY__bindgen_ty_1,
  pub int64: LONGLONG,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagCY__bindgen_ty_1 {
  pub Lo: ULONG,
  pub Hi: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagCY__bindgen_ty_1"][::std::mem::size_of::<tagCY__bindgen_ty_1>() - 8usize];
  ["Alignment of tagCY__bindgen_ty_1"][::std::mem::align_of::<tagCY__bindgen_ty_1>() - 4usize];
  ["Offset of field: tagCY__bindgen_ty_1::Lo"]
    [::std::mem::offset_of!(tagCY__bindgen_ty_1, Lo) - 0usize];
  ["Offset of field: tagCY__bindgen_ty_1::Hi"]
    [::std::mem::offset_of!(tagCY__bindgen_ty_1, Hi) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagCY"][::std::mem::size_of::<tagCY>() - 8usize];
  ["Alignment of tagCY"][::std::mem::align_of::<tagCY>() - 8usize];
  ["Offset of field: tagCY::int64"][::std::mem::offset_of!(tagCY, int64) - 0usize];
};
pub type CY = tagCY;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct tagDEC {
  pub wReserved: USHORT,
  pub __bindgen_anon_1: tagDEC__bindgen_ty_1,
  pub Hi32: ULONG,
  pub __bindgen_anon_2: tagDEC__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union tagDEC__bindgen_ty_1 {
  pub __bindgen_anon_1: tagDEC__bindgen_ty_1__bindgen_ty_1,
  pub signscale: USHORT,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagDEC__bindgen_ty_1__bindgen_ty_1 {
  pub scale: BYTE,
  pub sign: BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagDEC__bindgen_ty_1__bindgen_ty_1"]
    [::std::mem::size_of::<tagDEC__bindgen_ty_1__bindgen_ty_1>() - 2usize];
  ["Alignment of tagDEC__bindgen_ty_1__bindgen_ty_1"]
    [::std::mem::align_of::<tagDEC__bindgen_ty_1__bindgen_ty_1>() - 1usize];
  ["Offset of field: tagDEC__bindgen_ty_1__bindgen_ty_1::scale"]
    [::std::mem::offset_of!(tagDEC__bindgen_ty_1__bindgen_ty_1, scale) - 0usize];
  ["Offset of field: tagDEC__bindgen_ty_1__bindgen_ty_1::sign"]
    [::std::mem::offset_of!(tagDEC__bindgen_ty_1__bindgen_ty_1, sign) - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagDEC__bindgen_ty_1"][::std::mem::size_of::<tagDEC__bindgen_ty_1>() - 2usize];
  ["Alignment of tagDEC__bindgen_ty_1"][::std::mem::align_of::<tagDEC__bindgen_ty_1>() - 2usize];
  ["Offset of field: tagDEC__bindgen_ty_1::signscale"]
    [::std::mem::offset_of!(tagDEC__bindgen_ty_1, signscale) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union tagDEC__bindgen_ty_2 {
  pub __bindgen_anon_1: tagDEC__bindgen_ty_2__bindgen_ty_1,
  pub Lo64: ULONGLONG,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagDEC__bindgen_ty_2__bindgen_ty_1 {
  pub Lo32: ULONG,
  pub Mid32: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagDEC__bindgen_ty_2__bindgen_ty_1"]
    [::std::mem::size_of::<tagDEC__bindgen_ty_2__bindgen_ty_1>() - 8usize];
  ["Alignment of tagDEC__bindgen_ty_2__bindgen_ty_1"]
    [::std::mem::align_of::<tagDEC__bindgen_ty_2__bindgen_ty_1>() - 4usize];
  ["Offset of field: tagDEC__bindgen_ty_2__bindgen_ty_1::Lo32"]
    [::std::mem::offset_of!(tagDEC__bindgen_ty_2__bindgen_ty_1, Lo32) - 0usize];
  ["Offset of field: tagDEC__bindgen_ty_2__bindgen_ty_1::Mid32"]
    [::std::mem::offset_of!(tagDEC__bindgen_ty_2__bindgen_ty_1, Mid32) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagDEC__bindgen_ty_2"][::std::mem::size_of::<tagDEC__bindgen_ty_2>() - 8usize];
  ["Alignment of tagDEC__bindgen_ty_2"][::std::mem::align_of::<tagDEC__bindgen_ty_2>() - 8usize];
  ["Offset of field: tagDEC__bindgen_ty_2::Lo64"]
    [::std::mem::offset_of!(tagDEC__bindgen_ty_2, Lo64) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of tagDEC"][::std::mem::size_of::<tagDEC>() - 16usize];
  ["Alignment of tagDEC"][::std::mem::align_of::<tagDEC>() - 8usize];
  ["Offset of field: tagDEC::wReserved"][::std::mem::offset_of!(tagDEC, wReserved) - 0usize];
  ["Offset of field: tagDEC::Hi32"][::std::mem::offset_of!(tagDEC, Hi32) - 4usize];
};
pub type DECIMAL = tagDEC;
pub type wireBSTR = *mut FLAGGED_WORD_BLOB;
pub type BSTR = *mut OLECHAR;
pub type VARIANT_BOOL = ::std::os::raw::c_short;
pub type VARTYPE = ::std::os::raw::c_ushort;
pub type PROPID = ULONG;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _STORAGE_HOTPLUG_INFO {
  pub Size: DWORD,
  pub MediaRemovable: BOOLEAN,
  pub MediaHotplug: BOOLEAN,
  pub DeviceHotplug: BOOLEAN,
  pub WriteCacheEnableOverride: BOOLEAN,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
  ["Size of _STORAGE_HOTPLUG_INFO"][::std::mem::size_of::<_STORAGE_HOTPLUG_INFO>() - 8usize];
  ["Alignment of _STORAGE_HOTPLUG_INFO"][::std::mem::align_of::<_STORAGE_HOTPLUG_INFO>() - 4usize];
  ["Offset of field: _STORAGE_HOTPLUG_INFO::Size"]
    [::std::mem::offset_of!(_STORAGE_HOTPLUG_INFO, Size) - 0usize];
  ["Offset of field: _STORAGE_HOTPLUG_INFO::MediaRemovable"]
    [::std::mem::offset_of!(_STORAGE_HOTPLUG_INFO, MediaRemovable) - 4usize];
  ["Offset of field: _STORAGE_HOTPLUG_INFO::MediaHotplug"]
